#include "hinshi_map.h"

int hinshi_info[1096][4] = {
	{6, 1, 0, 0}, // 15 未定義語
	{1, 1, 0, 0}, // 1 特殊, 句点
	{1, 2, 0, 0}, // 2 特殊, 読点
	{1, 3, 0, 0}, // 3 特殊, 括弧始
	{1, 4, 0, 0}, // 4 特殊, 括弧終
	{1, 5, 0, 0}, // 5 特殊, 記号
	{1, 6, 0, 0}, // 6 特殊, 空白
	{6, 1, 0, 0}, // 7 名詞, 普通名詞
	{6, 2, 0, 0}, // 8 名詞, サ変名詞
	{6, 3, 0, 0}, // 9 名詞, 固有名詞
	{6, 4, 0, 0}, // 10 名詞, 地名
	{6, 5, 0, 0}, // 11 名詞, 人名
	{6, 6, 0, 0}, // 12 名詞, 組織名
	{6, 7, 0, 0}, // 13 名詞, 数詞
	{6, 8, 0, 0}, // 14 名詞, 形式名詞
	{6, 9, 0, 0}, // 15 名詞, 副詞的名詞
	{6, 10, 0, 0}, // 16 名詞, 時相名詞
	{7, 1, 0, 0}, // 17 指示詞 名詞形態指示詞
	{7, 2, 0, 0}, // 18 指示詞 連体詞形態指示詞
	{7, 3, 0, 0}, // 19 指示詞 副詞形態指示詞
	{8, 1, 0, 0}, // 20 副詞 様態副詞
	{8, 2, 0, 0}, // 21 副詞 程度副詞
	{8, 3, 0, 0}, // 22 副詞 量副詞
	{8, 4, 0, 0}, // 23 副詞 頻度副詞
	{8, 5, 0, 0}, // 24 副詞 時制相副詞
	{8, 6, 0, 0}, // 25 副詞 陳述副詞
	{8, 7, 0, 0}, // 26 副詞 評価副詞
	{8, 8, 0, 0}, // 27 副詞 発言副詞
	{9, 1, 0, 0}, // 28 助詞 格助詞
	{9, 2, 0, 0}, // 29 助詞 副助詞
	{9, 3, 0, 0}, // 30 助詞 接続助詞
	{9, 4, 0, 0}, // 31 助詞 終助詞
	{10, 0, 0, 0}, // 32 接続詞
	{11, 0, 0, 0}, // 33 連体詞
	{12, 0, 0, 0}, // 34 感動詞

	{6, 1, 0, 0}, // 35 接頭辞 名詞接頭辞
	{6, 1, 0, 0}, // 36 接頭辞 動詞接頭辞
	{6, 1, 0, 0}, // 37 接頭辞 イ形容詞接頭辞
	{6, 1, 0, 0}, // 38 接頭辞 ナ形容詞接頭辞
/*
	{13, 1, 0, 0}, // 35 接頭辞 名詞接頭辞
	{13, 2, 0, 0}, // 36 接頭辞 動詞接頭辞
	{13, 3, 0, 0}, // 37 接頭辞 イ形容詞接頭辞
	{13, 4, 0, 0}, // 38 接頭辞 ナ形容詞接頭辞
*/
	{15, 1, 0, 0}, // 39 未定義語 その他
	{15, 2, 0, 0}, // 40 未定義語 カタカナ
	{15, 3, 0, 0}, // 41 未定義語 アルファベット
	{6, 1, 0, 0}, // 42 接尾辞 名詞性述語接尾辞
	{6, 1, 0, 0}, // 43 接尾辞 名詞性名詞接尾辞
	{14, 3, 0, 0}, // 44 接尾辞 名詞性名詞助数辞
	{6, 1, 0, 0}, // 45 接尾辞 名詞性特殊接尾辞
/*
	{14, 1, 0, 0}, // 42 接尾辞 名詞性述語接尾辞
	{14, 2, 0, 0}, // 43 接尾辞 名詞性名詞接尾辞
	{14, 3, 0, 0}, // 44 接尾辞 名詞性名詞助数辞
	{14, 4, 0, 0}, // 45 接尾辞 名詞性特殊接尾辞
	{6, 1, 0, 0}, // 46 接尾辞 形容詞性述語接尾辞 %
	{6, 1, 0, 0}, // 47 接尾辞 形容詞性名詞接尾辞 %
	{6, 1, 0, 0}, // 48 接尾辞 動詞性接尾辞 %
*/
	{14, 5, 0, 0}, // 46 接尾辞 形容詞性述語接尾辞 %
	{14, 6, 0, 0}, // 47 接尾辞 形容詞性名詞接尾辞 %
	{14, 7, 0, 0}, // 48 接尾辞 動詞性接尾辞 %

	{2, 0, 1, 1}, // 49	動詞 母音動詞 語幹
	{2, 0, 1, 2}, // 50 基本形
	{2, 0, 1, 3}, // 51 未然形
	{2, 0, 1, 4}, // 52 意志形
	{2, 0, 1, 5}, // 53 省略意志形
	{2, 0, 1, 6}, // 54 命令形
	{2, 0, 1, 7}, // 55 基本条件形
	{2, 0, 1, 8}, // 56 基本連用形
	{2, 0, 1, 9}, // 57 タ接連用形
	{2, 0, 1, 10}, // 58 タ形
	{2, 0, 1, 11}, // 59 タ系推量形
	{2, 0, 1, 12}, // 60 タ系省略推量形
	{2, 0, 1, 13}, // 61 タ系条件形
	{2, 0, 1, 14}, // 62 タ系連用テ形
	{2, 0, 1, 15}, // 63 タ系連用タリ形
	{2, 0, 1, 16}, // 64 タ系連用チャ形
	{2, 0, 1, 17}, // 65 音便条件形
	{2, 0, 1, 18}, // 66 文語命令形
// 子音動詞カ行
{2, 0, 2, 1}, // 67語幹             * 
{2, 0, 2, 2}, // 68基本形           く
{2, 0, 2, 3}, // 69未然形           か
{2, 0, 2, 4}, // 70意志形           こう  
{2, 0, 2, 5}, // 71省略意志形       こ  
{2, 0, 2, 6}, // 72命令形           け
{2, 0, 2, 7}, // 73基本条件形       けば  
{2, 0, 2, 8}, // 74基本連用形       き
{2, 0, 2, 9}, // 75タ接連用形       い
{2, 0, 2, 10}, // 76タ形             いた  
{2, 0, 2, 11}, // 77タ系推量形       いたろう
{2, 0, 2, 12}, // 78タ系省略推量形   いたろ
{2, 0, 2, 13}, // 79タ系条件形       いたら
{2, 0, 2, 14}, // 80タ系連用テ形     いて  
{2, 0, 2, 15}, // 81タ系連用タリ形   いたり
{2, 0, 2, 16}, // 82タ系連用チャ形   いちゃ
{2, 0, 2, 17}, // 83音便条件形       きゃ  
// 子音動詞カ行促音便形
{2, 0, 3, 1}, // 84語幹             *     
{2, 0, 3, 2}, // 85基本形           く
{2, 0, 3, 3}, // 86未然形           か
{2, 0, 3, 4}, // 87意志形           こう  
{2, 0, 3, 5}, // 88省略意志形       こ
{2, 0, 3, 6}, // 89命令形           け
{2, 0, 3, 7}, // 90基本条件形       けば  
{2, 0, 3, 8}, // 91基本連用形       き
{2, 0, 3, 9}, // 92タ接連用形       っ
{2, 0, 3, 10}, // 93タ形             った  
{2, 0, 3, 11}, // 94タ系推量形       ったろう
{2, 0, 3, 12}, // 95タ系省略推量形   ったろ
{2, 0, 3, 13}, // 96タ系条件形       ったら
{2, 0, 3, 14}, // 97タ系連用テ形     って  
{2, 0, 3, 15}, // 98タ系連用タリ形   ったり
{2, 0, 3, 16}, // 99タ系連用チャ形   っちゃ
{2, 0, 3, 17}, // 100音便条件形       きゃ  
// 子音動詞ガ行
{2, 0, 4, 1}, // 101語幹             * 
{2, 0, 4, 2}, // 102基本形           ぐ
{2, 0, 4, 3}, // 103未然形           が
{2, 0, 4, 4}, // 104意志形           ごう  
{2, 0, 4, 5}, // 105省略意志形       ご
{2, 0, 4, 6}, // 106命令形           げ
{2, 0, 4, 7}, // 107基本条件形       げば  
{2, 0, 4, 8}, // 108基本連用形       ぎ
{2, 0, 4, 9}, // 109タ接連用形       い
{2, 0, 4, 10}, // 110タ形             いだ  
{2, 0, 4, 11}, // 111タ系推量形       いだろう
{2, 0, 4, 12}, // 112タ系省略推量形   いだろ
{2, 0, 4, 13}, // 113タ系条件形       いだら
{2, 0, 4, 14}, // 114タ系連用テ形     いで  
{2, 0, 4, 15}, // 115タ系連用タリ形   いだり
{2, 0, 4, 16}, // 116タ系連用チャ形   いじゃ
{2, 0, 4, 17}, // 117音便条件形       ぎゃ  
// 子音動詞サ行
{2, 0, 5, 1}, // 118語幹             * 
{2, 0, 5, 2}, // 119基本形           す
{2, 0, 5, 3}, // 120未然形           さ
{2, 0, 5, 4}, // 121意志形           そう  
{2, 0, 5, 5}, // 122省略意志形       そ
{2, 0, 5, 6}, // 123命令形           せ
{2, 0, 5, 7}, // 124基本条件形       せば  
{2, 0, 5, 8}, // 125基本連用形       し
{2, 0, 5, 9}, // 126タ接連用形       し
{2, 0, 5, 10}, // 127タ形             した  
{2, 0, 5, 11}, // 128タ系推量形       したろう
{2, 0, 5, 12}, // 129タ系省略推量形   したろ
{2, 0, 5, 13}, // 130タ系条件形       したら
{2, 0, 5, 14}, // 131タ系連用テ形     して  
{2, 0, 5, 15}, // 132タ系連用タリ形   したり
{2, 0, 5, 16}, // 133タ系連用チャ形   しちゃ
{2, 0, 5, 17}, // 134音便条件形       しゃ  
// 子音動詞タ行
{2, 0, 6, 1}, // 135語幹             * 
{2, 0, 6, 2}, // 136基本形           つ
{2, 0, 6, 3}, // 137未然形           た
{2, 0, 6, 4}, // 138意志形           とう  
{2, 0, 6, 5}, // 139省略意志形       と
{2, 0, 6, 6}, // 140命令形           て
{2, 0, 6, 7}, // 141基本条件形       てば  
{2, 0, 6, 8}, // 142基本連用形       ち
{2, 0, 6, 9}, // 143タ接連用形       っ
{2, 0, 6, 10}, // 144タ形             った  
{2, 0, 6, 11}, // 145タ系推量形       ったろう
{2, 0, 6, 12}, // 146タ系省略推量形   ったろ
{2, 0, 6, 13}, // 147タ系条件形       ったら
{2, 0, 6, 14}, // 148タ系連用テ形     って  
{2, 0, 6, 15}, // 149タ系連用タリ形   ったり
{2, 0, 6, 16}, // 150タ系連用チャ形   っちゃ
{2, 0, 6, 17}, // 151音便条件形       ちゃ  
// 子音動詞ナ行
{2, 0, 7, 1}, // 152語幹             * 
{2, 0, 7, 2}, // 153基本形           ぬ
{2, 0, 7, 3}, // 154未然形           な
{2, 0, 7, 4}, // 155意志形           のう  
{2, 0, 7, 5}, // 156省略意志形       の
{2, 0, 7, 6}, // 157命令形           ね
{2, 0, 7, 7}, // 158基本条件形       ねば  
{2, 0, 7, 8}, // 159基本連用形       に
{2, 0, 7, 9}, // 160タ接連用形       ん
{2, 0, 7, 10}, // 161タ形             んだ  
{2, 0, 7, 11}, // 162タ系推量形       んだろう
{2, 0, 7, 12}, // 163タ系省略推量形   んたろ
{2, 0, 7, 13}, // 164タ系条件形       んだら
{2, 0, 7, 14}, // 165タ系連用テ形     んで  
{2, 0, 7, 15}, // 166タ系連用タリ形   んだり
{2, 0, 7, 16}, // 167タ系連用チャ形   んじゃ
{2, 0, 7, 17}, // 168音便条件形       にゃ  
// 子音動詞バ行
{2, 0, 8, 1}, // 169語幹             * 
{2, 0, 8, 2}, // 170基本形           ぶ
{2, 0, 8, 3}, // 171未然形           ば
{2, 0, 8, 4}, // 172意志形           ぼう  
{2, 0, 8, 5}, // 173省略意志形       ぼ
{2, 0, 8, 6}, // 174命令形           べ
{2, 0, 8, 7}, // 175基本条件形       べば  
{2, 0, 8, 8}, // 176基本連用形       び
{2, 0, 8, 9}, // 177タ接連用形       ん
{2, 0, 8, 10}, // 178タ形             んだ  
{2, 0, 8, 11}, // 179タ系推量形       んだろう
{2, 0, 8, 12}, // 180タ系省略推量形   んたろ
{2, 0, 8, 13}, // 181タ系条件形       んだら
{2, 0, 8, 14}, // 182タ系連用テ形     んで  
{2, 0, 8, 15}, // 183タ系連用タリ形   んだり
{2, 0, 8, 16}, // 184タ系連用チャ形   んじゃ
{2, 0, 8, 17}, // 185音便条件形       びゃ  
// 子音動詞マ行
{2, 0, 9, 1}, // 186語幹             * 
{2, 0, 9, 2}, // 187基本形           む
{2, 0, 9, 3}, // 188未然形           ま
{2, 0, 9, 4}, // 189意志形           もう  
{2, 0, 9, 5}, // 190省略意志形       も
{2, 0, 9, 6}, // 191命令形           め
{2, 0, 9, 7}, // 192基本条件形       めば  
{2, 0, 9, 8}, // 193基本連用形       み
{2, 0, 9, 9}, // 194タ接連用形       ん
{2, 0, 9, 10}, // 195タ形             んだ  
{2, 0, 9, 11}, // 196タ系推量形       んだろう
{2, 0, 9, 12}, // 197タ系省略推量形   んたろ
{2, 0, 9, 13}, // 198タ系条件形       んだら
{2, 0, 9, 14}, // 199タ系連用テ形     んで  
{2, 0, 9, 15}, // 200タ系連用タリ形   んだり
{2, 0, 9, 16}, // 201タ系連用チャ形   んじゃ
{2, 0, 9, 17}, // 202音便条件形       みゃ  
// 子音動詞ラ行
{2, 0, 10, 1}, // 203語幹             * 
{2, 0, 10, 2}, // 204基本形           る
{2, 0, 10, 3}, // 205未然形           ら
{2, 0, 10, 4}, // 206意志形           ろう  
{2, 0, 10, 5}, // 207省略意志形       ろ
{2, 0, 10, 6}, // 208命令形           れ
{2, 0, 10, 7}, // 209基本条件形       れば  
{2, 0, 10, 8}, // 210基本連用形       り
{2, 0, 10, 9}, // 211タ接連用形       っ
{2, 0, 10, 10}, // 212タ形             った  
{2, 0, 10, 11}, // 213タ系推量形       ったろう
{2, 0, 10, 12}, // 214タ系省略推量形   ったろ
{2, 0, 10, 13}, // 215タ系条件形       ったら
{2, 0, 10, 14}, // 216タ系連用テ形     って  
{2, 0, 10, 15}, // 217タ系連用タリ形   ったり
{2, 0, 10, 16}, // 218タ系連用チャ形   っちゃ
{2, 0, 10, 17}, // 219音便条件形       りゃ  
// 子音動詞ラ行イ形
{2, 0, 11, 1}, // 220語幹             * 
{2, 0, 11, 2}, // 221基本形           る
{2, 0, 11, 3}, // 222未然形           ら
{2, 0, 11, 4}, // 223意志形           ろう  
{2, 0, 11, 5}, // 224省略意志形       ろ
{2, 0, 11, 6}, // 225命令形           い    
{2, 0, 11, 7}, // 226基本条件形       れば  
{2, 0, 11, 8}, // 227基本連用形       り
{2, 0, 11, 9}, // 228タ接連用形       っ
{2, 0, 11, 10}, // 229タ形             った  
{2, 0, 11, 11}, // 230タ系推量形       ったろう
{2, 0, 11, 12}, // 231タ系省略推量形   ったろ
{2, 0, 11, 13}, // 232タ系条件形       ったら
{2, 0, 11, 14}, // 233タ系連用テ形     って  
{2, 0, 11, 15}, // 234タ系連用タリ形   ったり
{2, 0, 11, 16}, // 235タ系連用チャ形   っちゃ
{2, 0, 11, 17}, // 236音便条件形       りゃ  
// 子音動詞ワ行
{2, 0, 12, 1}, // 237語幹             * 
{2, 0, 12, 2}, // 238基本形           う
{2, 0, 12, 3}, // 239未然形           わ
{2, 0, 12, 4}, // 240意志形           おう  
{2, 0, 12, 5}, // 241省略意志形       お
{2, 0, 12, 6}, // 242命令形           え
{2, 0, 12, 7}, // 243基本条件形       えば  
{2, 0, 12, 8}, // 244基本連用形       い
{2, 0, 12, 9}, // 245タ接連用形       っ
{2, 0, 12, 10}, // 246タ形             った  
{2, 0, 12, 11}, // 247タ系推量形       ったろう
{2, 0, 12, 12}, // 248タ系省略推量形   ったろ
{2, 0, 12, 13}, // 249タ系条件形       ったら
{2, 0, 12, 14}, // 250タ系連用テ形     って  
{2, 0, 12, 15}, // 251タ系連用タリ形   ったり
{2, 0, 12, 16}, // 252タ系連用チャ形   っちゃ
// 子音動詞ワ行文語音便形
{2, 0, 13, 1}, // 253語幹             * 
{2, 0, 13, 2}, // 254基本形           う
{2, 0, 13, 3}, // 255未然形           わ
{2, 0, 13, 4}, // 256意志形           おう  
{2, 0, 13, 5}, // 257省略意志形       お
{2, 0, 13, 6}, // 258命令形           え
{2, 0, 13, 7}, // 259基本条件形       えば  
{2, 0, 13, 8}, // 260基本連用形       い
{2, 0, 13, 9}, // 261タ接連用形       う
{2, 0, 13, 10}, // 262タ形             うた  
{2, 0, 13, 11}, // 263タ系推量形       うたろう
{2, 0, 13, 12}, // 264タ系省略推量形   うたろ
{2, 0, 13, 13}, // 265タ系条件形       うたら
{2, 0, 13, 14}, // 266タ系連用テ形     うて  
{2, 0, 13, 15}, // 267タ系連用タリ形   うたり
{2, 0, 13, 16}, // 268タ系連用チャ形   うちゃ
// カ変動詞
{2, 0, 14, 1}, // 269語幹             *
{2, 0, 14, 2}, // 270基本形           くる  
{2, 0, 14, 3}, // 271未然形           こ
{2, 0, 14, 4}, // 272意志形           こよう
{2, 0, 14, 5}, // 273省略意志形       こよ  
{2, 0, 14, 6}, // 274命令形           こい  
{2, 0, 14, 7}, // 275基本条件形       くれば
{2, 0, 14, 8}, // 276基本連用形       き
{2, 0, 14, 9}, // 277タ接連用形       き
{2, 0, 14, 10}, // 278タ形             きた  
{2, 0, 14, 11}, // 279タ系推量形       きたろう
{2, 0, 14, 12}, // 280タ系省略推量形   きたろ
{2, 0, 14, 13}, // 281タ系条件形       きたら
{2, 0, 14, 14}, // 282タ系連用テ形     きて  
{2, 0, 14, 15}, // 283タ系連用タリ形   きたり
{2, 0, 14, 16}, // 284タ系連用チャ形   きちゃ
{2, 0, 14, 17}, // 285音便条件形       くりゃ
// カ変動詞来
{2, 0, 15, 1}, // 286語幹             *           *
{2, 0, 15, 2}, // 287基本形           来る        くる
{2, 0, 15, 3}, // 288未然形           来          こ
{2, 0, 15, 4}, // 289意志形           来よう      こよう
{2, 0, 15, 5}, // 290省略意志形       来よ        こよ
{2, 0, 15, 6}, // 291命令形           来い        こい
{2, 0, 15, 7}, // 292基本条件形       来れば      くれば
{2, 0, 15, 8}, // 293基本連用形       来          き
{2, 0, 15, 9}, // 294タ接連用形       来          き
{2, 0, 15, 10}, // 295タ形             来た        きた
{2, 0, 15, 11}, // 296タ系推量形       来たろう    きたろう
{2, 0, 15, 12}, // 297タ系省略推量形   来たろ      きたろ
{2, 0, 15, 13}, // 298タ系条件形       来たら      きたら
{2, 0, 15, 14}, // 299タ系連用テ形     来て        きて
{2, 0, 15, 15}, // 300タ系連用タリ形   来たり      きたり
{2, 0, 15, 16}, // 301タ系連用チャ形   来ちゃ      きちゃ
{2, 0, 15, 17}, // 302音便条件形       来りゃ      くりゃ
// サ変動詞
{2, 0, 16, 1}, // 303語幹             * 
{2, 0, 16, 2}, // 304基本形           する  
{2, 0, 16, 3}, // 305未然形           さ
{2, 0, 16, 4}, // 306意志形           しよう
{2, 0, 16, 5}, // 307省略意志形       しよ  
{2, 0, 16, 6}, // 308命令形           しろ  
{2, 0, 16, 7}, // 309基本条件形       すれば
{2, 0, 16, 8}, // 310基本連用形       し
{2, 0, 16, 9}, // 311タ接連用形       し
{2, 0, 16, 10}, // 312タ形             した  
{2, 0, 16, 11}, // 313タ系推量形       したろう
{2, 0, 16, 12}, // 314タ系省略推量形   したろ
{2, 0, 16, 13}, // 315タ系条件形       したら
{2, 0, 16, 14}, // 316タ系連用テ形     して  
{2, 0, 16, 15}, // 317タ系連用タリ形   したり
{2, 0, 16, 16}, // 318タ系連用チャ形   しちゃ
{2, 0, 16, 17}, // 319音便条件形       すりゃ
{2, 0, 16, 18}, // 320文語基本形       す    
{2, 0, 16, 19}, // 321文語未然形       せ
{2, 0, 16, 20}, // 322文語命令形       せよ  
// ザ変動詞
{2, 0, 17, 1}, // 323語幹             * 
{2, 0, 17, 2}, // 324基本形           ずる  
{2, 0, 17, 3}, // 325未然形           ざ
{2, 0, 17, 4}, // 326意志形           じよう
{2, 0, 17, 5}, // 327省略意志形       じよ  
{2, 0, 17, 6}, // 328命令形           ぜよ  
{2, 0, 17, 7}, // 329基本条件形       ずれば
{2, 0, 17, 8}, // 330基本連用形       じ
{2, 0, 17, 9}, // 331タ接連用形       じ
{2, 0, 17, 10}, // 332タ形             じた  
{2, 0, 17, 11}, // 333タ系推量形       じたろう
{2, 0, 17, 12}, // 334タ系省略推量形   じたろ
{2, 0, 17, 13}, // 335タ系条件形       じたら
{2, 0, 17, 14}, // 336タ系連用テ形     じて  
{2, 0, 17, 15}, // 337タ系連用タリ形   じたり
{2, 0, 17, 16}, // 338タ系連用チャ形   じちゃ
{2, 0, 17, 17}, // 339音便条件形       ずりゃ
{2, 0, 17, 18}, // 340文語基本形       ず
{2, 0, 17, 19}, // 341文語未然形       ぜ
{2, 0, 17, 20}, // 342文語命令形       じろ  
// 形容詞活用型 および 活用形
// イ形容詞アウオ段
{3, 0, 18, 1}, // 343語幹             *     
{3, 0, 18, 2}, // 344基本形           い    
{3, 0, 18, 3}, // 345命令形           かれ  
{3, 0, 18, 4}, // 346基本推量形       かろう
{3, 0, 18, 5}, // 347基本省略推量形   かろ  
{3, 0, 18, 6}, // 348基本条件形       ければ
{3, 0, 18, 7}, // 349基本連用形       く    
{3, 0, 18, 8}, // 350タ形             かった
{3, 0, 18, 9}, // 351タ系推量形       かったろう
{3, 0, 18, 10}, // 352タ系省略推量形   かったろ  
{3, 0, 18, 11}, // 353タ系条件形       かったら  
{3, 0, 18, 12}, // 354タ系連用テ形     くて  
{3, 0, 18, 13}, // 355タ系連用タリ形   かったり  
{3, 0, 18, 14}, // 356タ系連用チャ形   くちゃ
{3, 0, 18, 15}, // 357タ系連用チャ形２ くっちゃ  
{3, 0, 18, 16}, // 358音便条件形       けりゃ
{3, 0, 18, 17}, // 359音便条件形２     きゃ  
{3, 0, 18, 18}, // 360文語基本形       し    
{3, 0, 18, 19}, // 361文語未然形       から  
{3, 0, 18, 20}, // 362文語連用形       う    
{3, 0, 18, 21}, // 363文語連体形       き    
{3, 0, 18, 22}, // 364文語命令形       かれ  
// イ形容詞イ段
{3, 0, 19, 1}, // 365語幹             *     
{3, 0, 19, 2}, // 366基本形           い    
{3, 0, 19, 3}, // 367命令形           かれ  
{3, 0, 19, 4}, // 368基本推量形       かろう
{3, 0, 19, 5}, // 369基本省略推量形   かろ  
{3, 0, 19, 6}, // 370基本条件形       ければ
{3, 0, 19, 7}, // 371基本連用形       く    
{3, 0, 19, 8}, // 372タ形             かった
{3, 0, 19, 9}, // 373タ系推量形       かったろう
{3, 0, 19, 10}, // 374タ系省略推量形   かったろ  
{3, 0, 19, 11}, // 375タ系条件形       かったら  
{3, 0, 19, 12}, // 376タ系連用テ形     くて  
{3, 0, 19, 13}, // 377タ系連用タリ形   かったり  
{3, 0, 19, 14}, // 378タ系連用チャ形   くちゃ
{3, 0, 19, 15}, // 379タ系連用チャ形２ くっちゃ  
{3, 0, 19, 16}, // 380音便条件形       けりゃ
{3, 0, 19, 17}, // 381音便条件形２     きゃ  
{3, 0, 19, 18}, // 382文語基本形       *     
{3, 0, 19, 19}, // 383文語未然形       から  
{3, 0, 19, 20}, // 384文語連用形       ゅう  
{3, 0, 19, 21}, // 385文語連体形       き    
{3, 0, 19, 22}, // 386文語命令形       かれ  
// イ形容詞イ段特殊
{3, 0, 20, 1}, // 387語幹             *     
{3, 0, 20, 2}, // 388基本形           い    
{3, 0, 20, 3}, // 389命令形           かれ  
{3, 0, 20, 4}, // 390基本推量形       かろう
{3, 0, 20, 5}, // 391基本省略推量形   かろ  
{3, 0, 20, 6}, // 392基本条件形       ければ
{3, 0, 20, 7}, // 393基本連用形       く    
{3, 0, 20, 8}, // 394タ形             かった
{3, 0, 20, 9}, // 395タ系推量形       かったろう
{3, 0, 20, 10}, // 396タ系省略推量形   かったろ  
{3, 0, 20, 11}, // 397タ系条件形       かったら  
{3, 0, 20, 12}, // 398タ系連用テ形     くて  
{3, 0, 20, 13}, // 399タ系連用タリ形   かったり  
{3, 0, 20, 14}, // 400タ系連用チャ形   くちゃ
{3, 0, 20, 15}, // 401タ系連用チャ形２ くっちゃ  
{3, 0, 20, 16}, // 402音便条件形       けりゃ
{3, 0, 20, 17}, // 403音便条件形２     きゃ  
{3, 0, 20, 18}, // 404文語基本形       し    
{3, 0, 20, 19}, // 405文語未然形       から  
{3, 0, 20, 20}, // 406文語連用形       ゅう  
{3, 0, 20, 21}, // 407文語連体形       き    
{3, 0, 20, 22}, // 408文語命令形       かれ  
// ナ形容詞
{3, 0, 21, 1}, // 409語幹                     *       
{3, 0, 21, 2}, // 410基本形                   だ      
{3, 0, 21, 3}, // 411ダ列命令形               なれ    
{3, 0, 21, 4}, // 412ダ列基本連体形           な      
{3, 0, 21, 5}, // 413ダ列基本推量形           だろう  
{3, 0, 21, 6}, // 414ダ列基本省略推量形       だろ    
{3, 0, 21, 7}, // 415ダ列基本条件形           ならば  
{3, 0, 21, 8}, // 416ダ列基本連用形           に      
{3, 0, 21, 9}, // 417ダ列タ形                 だった  
{3, 0, 21, 10}, // 418ダ列タ系推量形           だったろう  
{3, 0, 21, 11}, // 419ダ列タ系省略推量形       だったろ
{3, 0, 21, 12}, // 420ダ列タ系条件形           だったら
{3, 0, 21, 13}, // 421ダ列タ系連用テ形         で      
{3, 0, 21, 14}, // 422ダ列タ系連用タリ形       だったり
{3, 0, 21, 15}, // 423ダ列タ系連用ジャ形       じゃ    
{3, 0, 21, 16}, // 424ダ列文語連体形           なる    
{3, 0, 21, 17}, // 425ダ列文語条件形           なれば  
{3, 0, 21, 18}, // 426デアル列基本形           である  
{3, 0, 21, 19}, // 427デアル列命令形           であれ  
{3, 0, 21, 20}, // 428デアル列基本推量形       であろう
{3, 0, 21, 21}, // 429デアル列基本省略推量形   であろ  
{3, 0, 21, 22}, // 430デアル列基本条件形       であれば
{3, 0, 21, 23}, // 431デアル列基本連用形       であり  
{3, 0, 21, 24}, // 432デアル列タ形             であった
{3, 0, 21, 25}, // 433デアル列タ系推量形       であったろう
{3, 0, 21, 26}, // 434デアル列タ系省略推量形   であったろ  
{3, 0, 21, 27}, // 435デアル列タ系条件形       であったら  
{3, 0, 21, 28}, // 436デアル列タ系連用テ形     であって
{3, 0, 21, 29}, // 437デアル列タ系連用タリ形   であったり  
{3, 0, 21, 30}, // 438デス列基本形             です    
{3, 0, 21, 31}, // 439デス列基本推量形         でしょう
{3, 0, 21, 32}, // 440デス列基本省略推量形     でしょ  
{3, 0, 21, 33}, // 441デス列タ形               でした  
{3, 0, 21, 34}, // 442デス列タ系推量形         でしたろう  
{3, 0, 21, 35}, // 443デス列タ系省略推量形     でしたろ
{3, 0, 21, 36}, // 444デス列タ系条件形         でしたら
{3, 0, 21, 37}, // 445デス列タ系連用テ形       でして  
{3, 0, 21, 38}, // 446デス列タ系連用タリ形     でしたり
// ナノ形容詞
{3, 0, 22, 1}, // 447語幹                     *       
{3, 0, 22, 2}, // 448基本形                   だ      
{3, 0, 22, 3}, // 449ダ列命令形               なれ    
{3, 0, 22, 4}, // 450ダ列基本連体形           な      
{3, 0, 22, 5}, // 451ダ列特殊連体形           の      
{3, 0, 22, 6}, // 452ダ列基本推量形           だろう  
{3, 0, 22, 7}, // 453ダ列基本省略推量形       だろ    
{3, 0, 22, 8}, // 454ダ列基本条件形           ならば  
{3, 0, 22, 9}, // 455ダ列基本連用形           に      
{3, 0, 22, 10}, // 456ダ列タ形                 だった  
{3, 0, 22, 11}, // 457ダ列タ系推量形           だったろう  
{3, 0, 22, 12}, // 458ダ列タ系省略推量形       だったろ
{3, 0, 22, 13}, // 459ダ列タ系条件形           だったら
{3, 0, 22, 14}, // 460ダ列タ系連用テ形         で      
{3, 0, 22, 15}, // 461ダ列タ系連用タリ形       だったり
{3, 0, 22, 16}, // 462ダ列タ系連用ジャ形       じゃ    
{3, 0, 22, 17}, // 463ダ列文語連体形           なる    
{3, 0, 22, 18}, // 464ダ列文語条件形           なれば  
{3, 0, 22, 19}, // 465デアル列基本形           である  
{3, 0, 22, 20}, // 466デアル列命令形           であれ  
{3, 0, 22, 21}, // 467デアル列基本推量形       であろう
{3, 0, 22, 22}, // 468デアル列基本省略推量形   であろ  
{3, 0, 22, 23}, // 469デアル列基本条件形       であれば
{3, 0, 22, 24}, // 470デアル列基本連用形       であり  
{3, 0, 22, 25}, // 471デアル列タ形             であった
{3, 0, 22, 26}, // 472デアル列タ系推量形       であったろう
{3, 0, 22, 27}, // 473デアル列タ系省略推量形   であったろ  
{3, 0, 22, 28}, // 474デアル列タ系条件形       であったら  
{3, 0, 22, 29}, // 475デアル列タ系連用テ形     であって
{3, 0, 22, 30}, // 476デアル列タ系連用タリ形   であったり  
{3, 0, 22, 31}, // 477デス列基本形             です    
{3, 0, 22, 32}, // 478デス列基本推量形         でしょう
{3, 0, 22, 33}, // 479デス列基本省略推量形         でしょ  
{3, 0, 22, 34}, // 480デス列タ形               でした  
{3, 0, 22, 35}, // 481デス列タ系推量形         でしたろう  
{3, 0, 22, 36}, // 482デス列タ系省略推量形     でしたろ
{3, 0, 22, 37}, // 483デス列タ系条件形         でしたら
{3, 0, 22, 38}, // 484デス列タ系連用テ形       でして  
{3, 0, 22, 39}, // 485デス列タ系連用タリ形     でしたり
// ナ形容詞特殊
{3, 0, 23, 1}, // 486語幹                     *       
{3, 0, 23, 2}, // 487基本形                   だ      
{3, 0, 23, 3}, // 488ダ列命令形               なれ    
{3, 0, 23, 4}, // 489ダ列基本連体形           な      
{3, 0, 23, 5}, // 490ダ列特殊連体形           *       
{3, 0, 23, 6}, // 491ダ列基本推量形           だろう  
{3, 0, 23, 7}, // 492ダ列基本省略推量形       だろ    
{3, 0, 23, 8}, // 493ダ列基本条件形           ならば  
{3, 0, 23, 9}, // 494ダ列基本連用形           に      
{3, 0, 23, 10}, // 495ダ列特殊連用形           く      
{3, 0, 23, 11}, // 496ダ列タ形                 だった  
{3, 0, 23, 12}, // 497ダ列タ系推量形           だったろう  
{3, 0, 23, 13}, // 498ダ列タ系省略推量形       だったろ
{3, 0, 23, 14}, // 499ダ列タ系条件形           だったら
{3, 0, 23, 15}, // 500ダ列タ系連用テ形         で      
{3, 0, 23, 16}, // 501ダ列タ系連用タリ形       だったり
{3, 0, 23, 17}, // 502ダ列タ系連用ジャ形       じゃ    
{3, 0, 23, 18}, // 503ダ列文語連体形           なる    
{3, 0, 23, 19}, // 504ダ列文語条件形           なれば  
{3, 0, 23, 20}, // 505デアル列基本形           である  
{3, 0, 23, 21}, // 506デアル列命令形           であれ  
{3, 0, 23, 22}, // 507デアル列基本推量形       であろう
{3, 0, 23, 23}, // 508デアル列基本省略推量形   であろ  
{3, 0, 23, 24}, // 509デアル列基本条件形       であれば
{3, 0, 23, 25}, // 510デアル列基本連用形       であり  
{3, 0, 23, 26}, // 511デアル列タ形             であった
{3, 0, 23, 27}, // 512デアル列タ系推量形       であったろう
{3, 0, 23, 28}, // 513デアル列タ系省略推量形   であったろ  
{3, 0, 23, 29}, // 514デアル列タ系条件形       であったら  
{3, 0, 23, 30}, // 515デアル列タ系連用テ形     であって
{3, 0, 23, 31}, // 516デアル列タ系連用タリ形   であったり  
{3, 0, 23, 32}, // 517デス列基本形             です    
{3, 0, 23, 33}, // 518デス列基本推量形         でしょう
{3, 0, 23, 34}, // 519デス列基本省略推量形         でしょ  
{3, 0, 23, 35}, // 520デス列タ形               でした  
{3, 0, 23, 36}, // 521デス列タ系推量形         でしたろう  
{3, 0, 23, 37}, // 522デス列タ系省略推量形     でしたろ
{3, 0, 23, 38}, // 523デス列タ系条件形         でしたら
{3, 0, 23, 39}, // 524デス列タ系連用テ形       でして  
{3, 0, 23, 40}, // 525デス列タ系連用タリ形     でしたり
// タル形容詞
{3, 0, 24, 1}, // 526語幹             *     
{3, 0, 24, 2}, // 527基本形           たる  
{3, 0, 24, 3}, // 528基本連用形       と    
// 判定詞
{4, 0, 25, 1}, // 529語幹                     *       
{4, 0, 25, 2}, // 530基本形                   だ      
{4, 0, 25, 3}, // 531ダ列命令形               なれ    
{4, 0, 25, 4}, // 532ダ列基本連体形           な      
{4, 0, 25, 5}, // 533ダ列特殊連体形           の      
{4, 0, 25, 6}, // 534ダ列基本推量形           だろう  
{4, 0, 25, 7}, // 535ダ列基本省略推量形       だろ    
{4, 0, 25, 8}, // 536ダ列基本条件形           ならば  
{4, 0, 25, 9}, // 537ダ列タ形                 だった  
{4, 0, 25, 10}, // 538ダ列タ系推量形           だったろう  
{4, 0, 25, 11}, // 539ダ列タ系省略推量形       だったろ
{4, 0, 25, 12}, // 540ダ列タ系条件形           だったら
{4, 0, 25, 13}, // 541ダ列タ系連用テ形         で      
{4, 0, 25, 14}, // 542ダ列タ系連用タリ形       だったり
{4, 0, 25, 15}, // 543ダ列タ系連用ジャ形       じゃ    
{4, 0, 25, 16}, // 544デアル列基本形           である  
{4, 0, 25, 17}, // 545デアル列命令形           であれ  
{4, 0, 25, 18}, // 546デアル列基本推量形       であろう
{4, 0, 25, 19}, // 547デアル列基本省略推量形   であろ  
{4, 0, 25, 20}, // 548デアル列基本条件形       であれば
{4, 0, 25, 21}, // 549デアル列基本連用形       であり  
{4, 0, 25, 22}, // 550デアル列タ形             であった
{4, 0, 25, 23}, // 551デアル列タ系推量形       であったろう
{4, 0, 25, 24}, // 552デアル列タ系省略推量形   であったろ  
{4, 0, 25, 25}, // 553デアル列タ系条件形       であったら  
{4, 0, 25, 26}, // 554デアル列タ系連用テ形     であって
{4, 0, 25, 27}, // 555デアル列タ系連用タリ形   であったり  
{4, 0, 25, 28}, // 556デス列基本形             です    
{4, 0, 25, 29}, // 557デス列基本推量形         でしょう
{4, 0, 25, 30}, // 558デス列基本省略推量形         でしょ  
{4, 0, 25, 31}, // 559デス列タ形               でした  
{4, 0, 25, 32}, // 560デス列タ系推量形         でしたろう  
{4, 0, 25, 33}, // 561デス列タ系省略推量形     でしたろ
{4, 0, 25, 34}, // 562デス列タ系条件形         でしたら
{4, 0, 25, 35}, // 563デス列タ系連用テ形       でして  
{4, 0, 25, 36}, // 564デス列タ系連用タリ形     でしたり
// 助動詞
// 無活用型
{5, 0, 26, 1}, // 565語幹      *   
{5, 0, 26, 2}, // 566基本形    *   
// 助動詞ぬ型
{5, 0, 27, 1}, // 567語幹             *   
{5, 0, 27, 2}, // 568基本形           ぬ  
{5, 0, 27, 3}, // 569基本条件形       ねば
{5, 0, 27, 4}, // 570基本連用形       ず  
{5, 0, 27, 5}, // 571基本推量形       ぬだろう
{5, 0, 27, 6}, // 572基本省略推量形   ぬだろ
{5, 0, 27, 7}, // 573タ形             なんだ
{5, 0, 27, 8}, // 574タ系条件形       なんだら
{5, 0, 27, 9}, // 575タ系連用テ形     ないで
{5, 0, 27, 10}, // 576タ系推量形       なんだろう
{5, 0, 27, 11}, // 577タ系省略推量形   なんだろ
{5, 0, 27, 12}, // 578音便基本形       ん  
{5, 0, 27, 13}, // 579音便推量形       んだろう
{5, 0, 27, 14}, // 580音便省略推量形   んだろ
{5, 0, 27, 15}, // 581文語連体形       ざる
{5, 0, 27, 16}, // 582文語条件形       ざれば
{5, 0, 27, 17}, // 583文語音便条件形   ずんば
// 助動詞だろう型
{5, 0, 28, 1}, // 584語幹                    *   
{5, 0, 28, 2}, // 585基本形                  だろう  
{5, 0, 28, 3}, // 586ダ列基本省略推量形      だろ
{5, 0, 28, 4}, // 587ダ列基本条件形          ならば  
{5, 0, 28, 5}, // 588デアル列基本推量形      であろう
{5, 0, 28, 6}, // 589デアル列基本省略推量形  であろ  
{5, 0, 28, 7}, // 590デス列基本推量形        でしょう
{5, 0, 28, 8}, // 591デス列基本省略推量形    でしょ  
// 助動詞そうだ型
{5, 0, 29, 1}, // 592語幹             * 
{5, 0, 29, 2}, // 593基本形           だ
{5, 0, 29, 3}, // 594ダ列タ系連用テ形 で
{5, 0, 29, 4}, // 595デアル列基本形   である
{5, 0, 29, 5}, // 596デス列基本形     です  
// 助動詞く型
{5, 0, 30, 1}, // 597語幹             *   
{5, 0, 30, 2}, // 598基本形           し  
{5, 0, 30, 3}, // 599基本連用形       く  
{5, 0, 30, 4}, // 600文語連体形       き  
// 動詞性接尾辞ます型
{14, 7, 31, 1}, // 601語幹             *   
{14, 7, 31, 2}, // 602基本形           ます
{14, 7, 31, 3}, // 603未然形           ませ
{14, 7, 31, 4}, // 604意志形           ましょう
{14, 7, 31, 5}, // 605省略意志形       ましょ  
{14, 7, 31, 6}, // 606命令形           ませ
{14, 7, 31, 7}, // 607タ形             ました  
{14, 7, 31, 8}, // 608タ系条件形       ましたら
{14, 7, 31, 9}, // 609タ系連用テ形     まして  
{14, 7, 31, 10}, // 610タ系連用タリ形   ましたり
// 動詞性接尾辞うる型
{14, 7, 32, 1}, // 611語幹             * 
{14, 7, 32, 2}, // 612基本形           うる  
{14, 7, 32, 3}, // 613未然形           え
{14, 7, 32, 4}, // 614基本条件形       うれば
{14, 7, 32, 5}, // 615タ形             えた  
{14, 7, 32, 6}, // 616タ系推量形       えたろう
{14, 7, 32, 7}, // 617タ系省略推量形   えたろ
{14, 7, 32, 8}, // 618タ系条件形       えたら
{14, 7, 32, 9}, // 619タ系連用テ形     えて  
{14, 7, 32, 10}, // 620タ系連用タリ形   えたり
// 動詞性接尾辞得る型
{14, 7, 33, 1}, // 621語幹             *         *
{14, 7, 33, 2}, // 622基本形           得る      うる
{14, 7, 33, 3}, // 623未然形           得        え
{14, 7, 33, 4}, // 624基本条件形       得れば    うれば
{14, 7, 33, 5}, // 625タ形             得た      えた
{14, 7, 33, 6}, // 626タ系推量形       得たろう  えたろう
{14, 7, 33, 7}, // 627タ系省略推量形   得たろ    えたろ
{14, 7, 33, 8}, // 628タ系条件形       得たら    えたら
{14, 7, 33, 9}, // 629タ系連用テ形     得て      えて
{14, 7, 33, 10}, // 630タ系連用タリ形   得たり    えたり
// 接尾辞 動詞性接尾辞
{14, 7, 1, 1}, // 631語幹             *   
{14, 7, 1, 2}, // 632基本形           る  
{14, 7, 1, 3}, // 633未然形           *   
{14, 7, 1, 4}, // 634意志形           よう
{14, 7, 1, 5}, // 635省略意志形       よ  
{14, 7, 1, 6}, // 636命令形           ろ  
{14, 7, 1, 7}, // 637基本条件形       れば
{14, 7, 1, 8}, // 638基本連用形       *   
{14, 7, 1, 9}, // 639タ接連用形       *   
{14, 7, 1, 10}, // 640タ形             た  
{14, 7, 1, 11}, // 641タ系推量形       たろう
{14, 7, 1, 12}, // 642タ系省略推量形   たろ
{14, 7, 1, 13}, // 643タ系条件形       たら
{14, 7, 1, 14}, // 644タ系連用テ形     て  
{14, 7, 1, 15}, // 645タ系連用タリ形   たり
{14, 7, 1, 16}, // 646タ系連用チャ形   ちゃ
{14, 7, 1, 17}, // 647音便条件形       りゃ
{14, 7, 1, 18}, // 648文語命令形       よ  
{14, 7, 2, 1}, // 649語幹             * 
{14, 7, 2, 2}, // 650基本形           く
{14, 7, 2, 3}, // 651未然形           か
{14, 7, 2, 4}, // 652意志形           こう  
{14, 7, 2, 5}, // 653省略意志形       こ  
{14, 7, 2, 6}, // 654命令形           け
{14, 7, 2, 7}, // 655基本条件形       けば  
{14, 7, 2, 8}, // 656基本連用形       き
{14, 7, 2, 9}, // 657タ接連用形       い
{14, 7, 2, 10}, // 658タ形             いた  
{14, 7, 2, 11}, // 659タ系推量形       いたろう
{14, 7, 2, 12}, // 660タ系省略推量形   いたろ
{14, 7, 2, 13}, // 661タ系条件形       いたら
{14, 7, 2, 14}, // 662タ系連用テ形     いて  
{14, 7, 2, 15}, // 663タ系連用タリ形   いたり
{14, 7, 2, 16}, // 664タ系連用チャ形   いちゃ
{14, 7, 2, 17}, // 665音便条件形       きゃ  
{14, 7, 3, 1}, // 666語幹             *     
{14, 7, 3, 2}, // 667基本形           く
{14, 7, 3, 3}, // 668未然形           か
{14, 7, 3, 4}, // 669意志形           こう  
{14, 7, 3, 5}, // 670省略意志形       こ
{14, 7, 3, 6}, // 671命令形           け
{14, 7, 3, 7}, // 672基本条件形       けば  
{14, 7, 3, 8}, // 673基本連用形       き
{14, 7, 3, 9}, // 674タ接連用形       っ
{14, 7, 3, 10}, // 675タ形             った  
{14, 7, 3, 11}, // 676タ系推量形       ったろう
{14, 7, 3, 12}, // 677タ系省略推量形   ったろ
{14, 7, 3, 13}, // 678タ系条件形       ったら
{14, 7, 3, 14}, // 679タ系連用テ形     って  
{14, 7, 3, 15}, // 680タ系連用タリ形   ったり
{14, 7, 3, 16}, // 681タ系連用チャ形   っちゃ
{14, 7, 3, 17}, // 682音便条件形       きゃ  
{14, 7, 5, 1}, // 683語幹             * 
{14, 7, 5, 2}, // 684基本形           す
{14, 7, 5, 3}, // 685未然形           さ
{14, 7, 5, 4}, // 686意志形           そう  
{14, 7, 5, 5}, // 687省略意志形       そ
{14, 7, 5, 6}, // 688命令形           せ
{14, 7, 5, 7}, // 689基本条件形       せば  
{14, 7, 5, 8}, // 690基本連用形       し
{14, 7, 5, 9}, // 691タ接連用形       し
{14, 7, 5, 10}, // 692タ形             した  
{14, 7, 5, 11}, // 693タ系推量形       したろう
{14, 7, 5, 12}, // 694タ系省略推量形   したろ
{14, 7, 5, 13}, // 695タ系条件形       したら
{14, 7, 5, 14}, // 696タ系連用テ形     して  
{14, 7, 5, 15}, // 697タ系連用タリ形   したり
{14, 7, 5, 16}, // 698タ系連用チャ形   しちゃ
{14, 7, 5, 17}, // 699音便条件形       しゃ  
{14, 7, 9, 1}, // 700語幹             * 
{14, 7, 9, 2}, // 701基本形           む
{14, 7, 9, 3}, // 702未然形           ま
{14, 7, 9, 4}, // 703意志形           もう  
{14, 7, 9, 5}, // 704省略意志形       も
{14, 7, 9, 6}, // 705命令形           め
{14, 7, 9, 7}, // 706基本条件形       めば  
{14, 7, 9, 8}, // 707基本連用形       み
{14, 7, 9, 9}, // 708タ接連用形       ん
{14, 7, 9, 10}, // 709タ形             んだ  
{14, 7, 9, 11}, // 710タ系推量形       んだろう
{14, 7, 9, 12}, // 711タ系省略推量形   んたろ
{14, 7, 9, 13}, // 712タ系条件形       んだら
{14, 7, 9, 14}, // 713タ系連用テ形     んで  
{14, 7, 9, 15}, // 714タ系連用タリ形   んだり
{14, 7, 9, 16}, // 715タ系連用チャ形   んじゃ
{14, 7, 9, 17}, // 716音便条件形       みゃ  
{14, 7, 10, 1}, // 717語幹             * 
{14, 7, 10, 2}, // 718基本形           る
{14, 7, 10, 3}, // 719未然形           ら
{14, 7, 10, 4}, // 720意志形           ろう  
{14, 7, 10, 5}, // 721省略意志形       ろ
{14, 7, 10, 6}, // 722命令形           れ
{14, 7, 10, 7}, // 723基本条件形       れば  
{14, 7, 10, 8}, // 724基本連用形       り
{14, 7, 10, 9}, // 725タ接連用形       っ
{14, 7, 10, 10}, // 726タ形             った  
{14, 7, 10, 11}, // 727タ系推量形       ったろう
{14, 7, 10, 12}, // 728タ系省略推量形   ったろ
{14, 7, 10, 13}, // 729タ系条件形       ったら
{14, 7, 10, 14}, // 730タ系連用テ形     って  
{14, 7, 10, 15}, // 731タ系連用タリ形   ったり
{14, 7, 10, 16}, // 732タ系連用チャ形   っちゃ
{14, 7, 10, 17}, // 733音便条件形       りゃ  
{14, 7, 11, 1}, // 734語幹             * 
{14, 7, 11, 2}, // 735基本形           る
{14, 7, 11, 3}, // 736未然形           ら
{14, 7, 11, 4}, // 737意志形           ろう  
{14, 7, 11, 5}, // 738省略意志形       ろ
{14, 7, 11, 6}, // 739命令形           い    
{14, 7, 11, 7}, // 740基本条件形       れば  
{14, 7, 11, 8}, // 741基本連用形       り
{14, 7, 11, 9}, // 742タ接連用形       っ
{14, 7, 11, 10}, // 743タ形             った  
{14, 7, 11, 11}, // 744タ系推量形       ったろう
{14, 7, 11, 12}, // 745タ系省略推量形   ったろ
{14, 7, 11, 13}, // 746タ系条件形       ったら
{14, 7, 11, 14}, // 747タ系連用テ形     って  
{14, 7, 11, 15}, // 748タ系連用タリ形   ったり
{14, 7, 11, 16}, // 749タ系連用チャ形   っちゃ
{14, 7, 11, 17}, // 750音便条件形       りゃ  
{14, 7, 12, 1}, // 751語幹             * 
{14, 7, 12, 2}, // 752基本形           う
{14, 7, 12, 3}, // 753未然形           わ
{14, 7, 12, 4}, // 754意志形           おう  
{14, 7, 12, 5}, // 755省略意志形       お
{14, 7, 12, 6}, // 756命令形           え
{14, 7, 12, 7}, // 757基本条件形       えば  
{14, 7, 12, 8}, // 758基本連用形       い
{14, 7, 12, 9}, // 759タ接連用形       っ
{14, 7, 12, 10}, // 760タ形             った  
{14, 7, 12, 11}, // 761タ系推量形       ったろう
{14, 7, 12, 12}, // 762タ系省略推量形   ったろ
{14, 7, 12, 13}, // 763タ系条件形       ったら
{14, 7, 12, 14}, // 764タ系連用テ形     って  
{14, 7, 12, 15}, // 765タ系連用タリ形   ったり
{14, 7, 12, 16}, // 766タ系連用チャ形   っちゃ
{14, 7, 14, 1}, // 767語幹             *
{14, 7, 14, 2}, // 768基本形           くる  
{14, 7, 14, 3}, // 769未然形           こ
{14, 7, 14, 4}, // 770意志形           こよう
{14, 7, 14, 5}, // 771省略意志形       こよ  
{14, 7, 14, 6}, // 772命令形           こい  
{14, 7, 14, 7}, // 773基本条件形       くれば
{14, 7, 14, 8}, // 774基本連用形       き
{14, 7, 14, 9}, // 775タ接連用形       き
{14, 7, 14, 10}, // 776タ形             きた  
{14, 7, 14, 11}, // 777タ系推量形       きたろう
{14, 7, 14, 12}, // 778タ系省略推量形   きたろ
{14, 7, 14, 13}, // 779タ系条件形       きたら
{14, 7, 14, 14}, // 780タ系連用テ形     きて  
{14, 7, 14, 15}, // 781タ系連用タリ形   きたり
{14, 7, 14, 16}, // 782タ系連用チャ形   きちゃ
{14, 7, 14, 17}, // 783音便条件形       くりゃ
{14, 7, 15, 1}, // 784語幹             *           *
{14, 7, 15, 2}, // 785基本形           来る        くる
{14, 7, 15, 3}, // 786未然形           来          こ
{14, 7, 15, 4}, // 787意志形           来よう      こよう
{14, 7, 15, 5}, // 788省略意志形       来よ        こよ
{14, 7, 15, 6}, // 789命令形           来い        こい
{14, 7, 15, 7}, // 790基本条件形       来れば      くれば
{14, 7, 15, 8}, // 791基本連用形       来          き
{14, 7, 15, 9}, // 792タ接連用形       来          き
{14, 7, 15, 10}, // 793タ形             来た        きた
{14, 7, 15, 11}, // 794タ系推量形       来たろう    きたろう
{14, 7, 15, 12}, // 795タ系省略推量形   来たろ      きたろ
{14, 7, 15, 13}, // 796タ系条件形       来たら      きたら
{14, 7, 15, 14}, // 797タ系連用テ形     来て        きて
{14, 7, 15, 15}, // 798タ系連用タリ形   来たり      きたり
{14, 7, 15, 16}, // 799タ系連用チャ形   来ちゃ      きちゃ
{14, 7, 15, 17}, // 800音便条件形       来りゃ      くりゃ
{14, 7, 16, 1}, // 801語幹             * 
{14, 7, 16, 2}, // 802基本形           する  
{14, 7, 16, 3}, // 803未然形           さ
{14, 7, 16, 4}, // 804意志形           しよう
{14, 7, 16, 5}, // 805省略意志形       しよ  
{14, 7, 16, 6}, // 806命令形           しろ  
{14, 7, 16, 7}, // 807基本条件形       すれば
{14, 7, 16, 8}, // 808基本連用形       し
{14, 7, 16, 9}, // 809タ接連用形       し
{14, 7, 16, 10}, // 810タ形             した  
{14, 7, 16, 11}, // 811タ系推量形       したろう
{14, 7, 16, 12}, // 812タ系省略推量形   したろ
{14, 7, 16, 13}, // 813タ系条件形       したら
{14, 7, 16, 14}, // 814タ系連用テ形     して  
{14, 7, 16, 15}, // 815タ系連用タリ形   したり
{14, 7, 16, 16}, // 816タ系連用チャ形   しちゃ
{14, 7, 16, 17}, // 817音便条件形       すりゃ
{14, 7, 16, 18}, // 818文語基本形       す    
{14, 7, 16, 19}, // 819文語未然形       せ
{14, 7, 16, 20}, // 820文語命令形       せよ  
// 后缀 形容詞性名詞接尾辞
{14, 6, 21, 1}, // 821語幹                     *       
{14, 6, 21, 2}, // 822基本形                   だ      
{14, 6, 21, 3}, // 823ダ列命令形               なれ    
{14, 6, 21, 4}, // 824ダ列基本連体形           な      
{14, 6, 21, 5}, // 825ダ列基本推量形           だろう  
{14, 6, 21, 6}, // 826ダ列基本省略推量形       だろ    
{14, 6, 21, 7}, // 827ダ列基本条件形           ならば  
{14, 6, 21, 8}, // 828ダ列基本連用形           に      
{14, 6, 21, 9}, // 829ダ列タ形                 だった  
{14, 6, 21, 10}, // 830ダ列タ系推量形           だったろう  
{14, 6, 21, 11}, // 831ダ列タ系省略推量形       だったろ
{14, 6, 21, 12}, // 832ダ列タ系条件形           だったら
{14, 6, 21, 13}, // 833ダ列タ系連用テ形         で      
{14, 6, 21, 14}, // 834ダ列タ系連用タリ形       だったり
{14, 6, 21, 15}, // 835ダ列タ系連用ジャ形       じゃ    
{14, 6, 21, 16}, // 836ダ列文語連体形           なる    
{14, 6, 21, 17}, // 837ダ列文語条件形           なれば  
{14, 6, 21, 18}, // 838デアル列基本形           である  
{14, 6, 21, 19}, // 839デアル列命令形           であれ  
{14, 6, 21, 20}, // 840デアル列基本推量形       であろう
{14, 6, 21, 21}, // 841デアル列基本省略推量形   であろ  
{14, 6, 21, 22}, // 842デアル列基本条件形       であれば
{14, 6, 21, 23}, // 843デアル列基本連用形       であり  
{14, 6, 21, 24}, // 844デアル列タ形             であった
{14, 6, 21, 25}, // 845デアル列タ系推量形       であったろう
{14, 6, 21, 26}, // 846デアル列タ系省略推量形   であったろ  
{14, 6, 21, 27}, // 847デアル列タ系条件形       であったら  
{14, 6, 21, 28}, // 848デアル列タ系連用テ形     であって
{14, 6, 21, 29}, // 849デアル列タ系連用タリ形   であったり  
{14, 6, 21, 30}, // 850デス列基本形             です    
{14, 6, 21, 31}, // 851デス列基本推量形         でしょう
{14, 6, 21, 32}, // 852デス列基本省略推量形     でしょ  
{14, 6, 21, 33}, // 853デス列タ形               でした  
{14, 6, 21, 34}, // 854デス列タ系推量形         でしたろう  
{14, 6, 21, 35}, // 855デス列タ系省略推量形     でしたろ
{14, 6, 21, 36}, // 856デス列タ系条件形         でしたら
{14, 6, 21, 37}, // 857デス列タ系連用テ形       でして  
{14, 6, 21, 38}, // 858デス列タ系連用タリ形     でしたり
{14, 6, 22, 1}, // 859語幹                     *       
{14, 6, 22, 2}, // 860基本形                   だ      
{14, 6, 22, 3}, // 861ダ列命令形               なれ    
{14, 6, 22, 4}, // 862ダ列基本連体形           な      
{14, 6, 22, 5}, // 863ダ列特殊連体形           の      
{14, 6, 22, 6}, // 864ダ列基本推量形           だろう  
{14, 6, 22, 7}, // 865ダ列基本省略推量形       だろ    
{14, 6, 22, 8}, // 866ダ列基本条件形           ならば  
{14, 6, 22, 9}, // 867ダ列基本連用形           に      
{14, 6, 22, 10}, // 868ダ列タ形                 だった  
{14, 6, 22, 11}, // 869ダ列タ系推量形           だったろう  
{14, 6, 22, 12}, // 870ダ列タ系省略推量形       だったろ
{14, 6, 22, 13}, // 871ダ列タ系条件形           だったら
{14, 6, 22, 14}, // 872ダ列タ系連用テ形         で      
{14, 6, 22, 15}, // 873ダ列タ系連用タリ形       だったり
{14, 6, 22, 16}, // 874ダ列タ系連用ジャ形       じゃ    
{14, 6, 22, 17}, // 875ダ列文語連体形           なる    
{14, 6, 22, 18}, // 876ダ列文語条件形           なれば  
{14, 6, 22, 19}, // 877デアル列基本形           である  
{14, 6, 22, 20}, // 878デアル列命令形           であれ  
{14, 6, 22, 21}, // 879デアル列基本推量形       であろう
{14, 6, 22, 22}, // 880デアル列基本省略推量形   であろ  
{14, 6, 22, 23}, // 881デアル列基本条件形       であれば
{14, 6, 22, 24}, // 882デアル列基本連用形       であり  
{14, 6, 22, 25}, // 883デアル列タ形             であった
{14, 6, 22, 26}, // 884デアル列タ系推量形       であったろう
{14, 6, 22, 27}, // 885デアル列タ系省略推量形   であったろ  
{14, 6, 22, 28}, // 886デアル列タ系条件形       であったら  
{14, 6, 22, 29}, // 887デアル列タ系連用テ形     であって
{14, 6, 22, 30}, // 888デアル列タ系連用タリ形   であったり  
{14, 6, 22, 31}, // 889デス列基本形             です    
{14, 6, 22, 32}, // 890デス列基本推量形         でしょう
{14, 6, 22, 33}, // 891デス列基本省略推量形         でしょ  
{14, 6, 22, 34}, // 892デス列タ形               でした  
{14, 6, 22, 35}, // 893デス列タ系推量形         でしたろう  
{14, 6, 22, 36}, // 894デス列タ系省略推量形     でしたろ
{14, 6, 22, 37}, // 895デス列タ系条件形         でしたら
{14, 6, 22, 38}, // 896デス列タ系連用テ形       でして  
{14, 6, 22, 39}, // 897デス列タ系連用タリ形     でしたり
{14, 6, 18, 1}, // 898語幹             *     
{14, 6, 18, 2}, // 899基本形           い    
{14, 6, 18, 3}, // 900命令形           かれ  
{14, 6, 18, 4}, // 901基本推量形       かろう
{14, 6, 18, 5}, // 902基本省略推量形   かろ  
{14, 6, 18, 6}, // 903基本条件形       ければ
{14, 6, 18, 7}, // 904基本連用形       く    
{14, 6, 18, 8}, // 905タ形             かった
{14, 6, 18, 9}, // 906タ系推量形       かったろう
{14, 6, 18, 10}, // 907タ系省略推量形   かったろ  
{14, 6, 18, 11}, // 908タ系条件形       かったら  
{14, 6, 18, 12}, // 909タ系連用テ形     くて  
{14, 6, 18, 13}, // 910タ系連用タリ形   かったり  
{14, 6, 18, 14}, // 911タ系連用チャ形   くちゃ
{14, 6, 18, 15}, // 912タ系連用チャ形２ くっちゃ  
{14, 6, 18, 16}, // 913音便条件形       けりゃ
{14, 6, 18, 17}, // 914音便条件形２     きゃ  
{14, 6, 18, 18}, // 915文語基本形       し    
{14, 6, 18, 19}, // 916文語未然形       から  
{14, 6, 18, 20}, // 917文語連用形       う    
{14, 6, 18, 21}, // 918文語連体形       き    
{14, 6, 18, 22}, // 919文語命令形       かれ  
// 后缀 形容詞性述語接尾辞
{14, 5, 21, 1}, // 920語幹                     *       
{14, 5, 21, 2}, // 921基本形                   だ      
{14, 5, 21, 3}, // 922ダ列命令形               なれ    
{14, 5, 21, 4}, // 923ダ列基本連体形           な      
{14, 5, 21, 5}, // 924ダ列基本推量形           だろう  
{14, 5, 21, 6}, // 925ダ列基本省略推量形       だろ    
{14, 5, 21, 7}, // 926ダ列基本条件形           ならば  
{14, 5, 21, 8}, // 927ダ列基本連用形           に      
{14, 5, 21, 9}, // 928ダ列タ形                 だった  
{14, 5, 21, 10}, // 929ダ列タ系推量形           だったろう  
{14, 5, 21, 11}, // 930ダ列タ系省略推量形       だったろ
{14, 5, 21, 12}, // 931ダ列タ系条件形           だったら
{14, 5, 21, 13}, // 932ダ列タ系連用テ形         で      
{14, 5, 21, 14}, // 933ダ列タ系連用タリ形       だったり
{14, 5, 21, 15}, // 934ダ列タ系連用ジャ形       じゃ    
{14, 5, 21, 16}, // 935ダ列文語連体形           なる    
{14, 5, 21, 17}, // 936ダ列文語条件形           なれば  
{14, 5, 21, 18}, // 937デアル列基本形           である  
{14, 5, 21, 19}, // 938デアル列命令形           であれ  
{14, 5, 21, 20}, // 939デアル列基本推量形       であろう
{14, 5, 21, 21}, // 940デアル列基本省略推量形   であろ  
{14, 5, 21, 22}, // 941デアル列基本条件形       であれば
{14, 5, 21, 23}, // 942デアル列基本連用形       であり  
{14, 5, 21, 24}, // 943デアル列タ形             であった
{14, 5, 21, 25}, // 944デアル列タ系推量形       であったろう
{14, 5, 21, 26}, // 945デアル列タ系省略推量形   であったろ  
{14, 5, 21, 27}, // 946デアル列タ系条件形       であったら  
{14, 5, 21, 28}, // 947デアル列タ系連用テ形     であって
{14, 5, 21, 29}, // 948デアル列タ系連用タリ形   であったり  
{14, 5, 21, 30}, // 949デス列基本形             です    
{14, 5, 21, 31}, // 950デス列基本推量形         でしょう
{14, 5, 21, 32}, // 951デス列基本省略推量形     でしょ  
{14, 5, 21, 33}, // 952デス列タ形               でした  
{14, 5, 21, 34}, // 953デス列タ系推量形         でしたろう  
{14, 5, 21, 35}, // 954デス列タ系省略推量形     でしたろ
{14, 5, 21, 36}, // 955デス列タ系条件形         でしたら
{14, 5, 21, 37}, // 956デス列タ系連用テ形       でして  
{14, 5, 21, 38}, // 957デス列タ系連用タリ形     でしたり
{14, 5, 22, 1}, // 958語幹                     *       
{14, 5, 22, 2}, // 959基本形                   だ      
{14, 5, 22, 3}, // 960ダ列命令形               なれ    
{14, 5, 22, 4}, // 961ダ列基本連体形           な      
{14, 5, 22, 5}, // 962ダ列特殊連体形           の      
{14, 5, 22, 6}, // 963ダ列基本推量形           だろう  
{14, 5, 22, 7}, // 964ダ列基本省略推量形       だろ    
{14, 5, 22, 8}, // 965ダ列基本条件形           ならば  
{14, 5, 22, 9}, // 966ダ列基本連用形           に      
{14, 5, 22, 10}, // 967ダ列タ形                 だった  
{14, 5, 22, 11}, // 968ダ列タ系推量形           だったろう  
{14, 5, 22, 12}, // 969ダ列タ系省略推量形       だったろ
{14, 5, 22, 13}, // 970ダ列タ系条件形           だったら
{14, 5, 22, 14}, // 971ダ列タ系連用テ形         で      
{14, 5, 22, 15}, // 972ダ列タ系連用タリ形       だったり
{14, 5, 22, 16}, // 973ダ列タ系連用ジャ形       じゃ    
{14, 5, 22, 17}, // 974ダ列文語連体形           なる    
{14, 5, 22, 18}, // 975ダ列文語条件形           なれば  
{14, 5, 22, 19}, // 976デアル列基本形           である  
{14, 5, 22, 20}, // 977デアル列命令形           であれ  
{14, 5, 22, 21}, // 978デアル列基本推量形       であろう
{14, 5, 22, 22}, // 979デアル列基本省略推量形   であろ  
{14, 5, 22, 23}, // 980デアル列基本条件形       であれば
{14, 5, 22, 24}, // 981デアル列基本連用形       であり  
{14, 5, 22, 25}, // 982デアル列タ形             であった
{14, 5, 22, 26}, // 983デアル列タ系推量形       であったろう
{14, 5, 22, 27}, // 984デアル列タ系省略推量形   であったろ  
{14, 5, 22, 28}, // 985デアル列タ系条件形       であったら  
{14, 5, 22, 29}, // 986デアル列タ系連用テ形     であって
{14, 5, 22, 30}, // 987デアル列タ系連用タリ形   であったり  
{14, 5, 22, 31}, // 988デス列基本形             です    
{14, 5, 22, 32}, // 989デス列基本推量形         でしょう
{14, 5, 22, 33}, // 990デス列基本省略推量形         でしょ  
{14, 5, 22, 34}, // 991デス列タ形               でした  
{14, 5, 22, 35}, // 992デス列タ系推量形         でしたろう  
{14, 5, 22, 36}, // 993デス列タ系省略推量形     でしたろ
{14, 5, 22, 37}, // 994デス列タ系条件形         でしたら
{14, 5, 22, 38}, // 995デス列タ系連用テ形       でして  
{14, 5, 22, 39}, // 996デス列タ系連用タリ形     でしたり
{14, 5, 18, 1}, // 997語幹             *     
{14, 5, 18, 2}, // 998基本形           い    
{14, 5, 18, 3}, // 999命令形           かれ  
{14, 5, 18, 4}, // 1000基本推量形       かろう
{14, 5, 18, 5}, // 1001基本省略推量形   かろ  
{14, 5, 18, 6}, // 1002基本条件形       ければ
{14, 5, 18, 7}, // 1003基本連用形       く    
{14, 5, 18, 8}, // 1004タ形             かった
{14, 5, 18, 9}, // 1005タ系推量形       かったろう
{14, 5, 18, 10}, // 1006タ系省略推量形   かったろ  
{14, 5, 18, 11}, // 1007タ系条件形       かったら  
{14, 5, 18, 12}, // 1008タ系連用テ形     くて  
{14, 5, 18, 13}, // 1009タ系連用タリ形   かったり  
{14, 5, 18, 14}, // 1010タ系連用チャ形   くちゃ
{14, 5, 18, 15}, // 1011タ系連用チャ形２ くっちゃ  
{14, 5, 18, 16}, // 1012音便条件形       けりゃ
{14, 5, 18, 17}, // 1013音便条件形２     きゃ  
{14, 5, 18, 18}, // 1014文語基本形       し    
{14, 5, 18, 19}, // 1015文語未然形       から  
{14, 5, 18, 20}, // 1016文語連用形       う    
{14, 5, 18, 21}, // 1017文語連体形       き    
{14, 5, 18, 22}, // 1018文語命令形       かれ  
// 副词
{8, 0, 0, 0},  // 1019 副詞
{15, 3, 0, 0}, // 1020 特殊, 空白 未定义语，单独的英文假名
{15, 3, 0, 0}, // 1021 特殊, 空白 未定义语，单独的英文假名
{5, 0, 26, 2}, // 1022 だ
{9, 4, 0, 0},  // 1023 か
{14, 5, 18, 2}, // 1024 ない
{6, 5, 0, 0}, // 1025 苗字
{14, 2, 0, 0}, // 1026 name suffix
{2, 0, 12, 8}, // 1027基本連用形ちゃい
{9, 2, 0, 0}, // 1028 助詞 副助詞 も
{2, 0, 16, 1}, // 1029 へん 大阪方言 -> ない
{2, 0, 1, 8}, // 1030 きれ
{7, 3, 0, 0}, // 1031 そう 动词连用形+そう
{14, 7, 1, 2}, // 1032 れる 动词未然+れる
{14, 5, 18, 2}, // 1033 たい 动词连用形+たい
{9, 3, 0, 0}, // 1034 や
{9, 1, 0, 0}, // 1035 を
{5, 0, 26, 2}, // 1036 る
{9, 1, 0, 0}, // 1037 と
{9, 3, 0, 0}, // 1038 し
{14, 2, 0, 0}, // 1039 名词性性名詞接尾辞
{14, 5, 21, 1}, // 1040 よう
{9, 4, 0, 0}, // 1041 で
{15, 1, 0, 0}, // 1042 。
{6, 7, 0, 0}, // 1043 全角数词
{2, 0, 10, 1}, // 1044 つ
{9, 2, 0, 0}, // 1045 なら
{14, 5, 18, 2}, // 1046 なの
{9, 3, 0, 0}, // 1047 て
{9, 4, 0, 0}, // 1048 の
{9, 1, 0, 0}, // 1049 に
{9, 4, 0, 0}, // 1050 ん
// しまう
{2, 0, 12, 1}, // 1051語幹             * 
{2, 0, 12, 2}, // 1052基本形           う
{2, 0, 12, 3}, // 1053未然形           わ
{2, 0, 12, 4}, // 1054意志形           おう  
{2, 0, 12, 5}, // 1055省略意志形       お
{2, 0, 12, 6}, // 1056命令形           え
{2, 0, 12, 7}, // 1057基本条件形       えば  
{2, 0, 12, 8}, // 1058基本連用形       い
{2, 0, 12, 9}, // 1059タ接連用形       っ
{2, 0, 12, 10}, // 1060タ形             った  
{2, 0, 12, 11}, // 1061タ系推量形       ったろう
{2, 0, 12, 12}, // 1062タ系省略推量形   ったろ
{2, 0, 12, 13}, // 1063タ系条件形       ったら
{2, 0, 12, 14}, // 1064タ系連用テ形     って  
{2, 0, 12, 15}, // 1065タ系連用タリ形   ったり
{2, 0, 12, 16}, // 1066タ系連用チャ形   っちゃ

{14, 7, 10, 8}, // 1067 り 

{9, 1, 0, 0}, // 1068 助詞 格助詞
{9, 2, 0, 0}, // 1069 助詞 副助詞
{9, 3, 0, 0}, // 1070 助詞 接続助詞
{9, 4, 0, 0}, // 1071 助詞 終助詞
};

// 基本形还原：删除变形词，加基本词后缀
char *kihongkei[] = {
	"", // NIL
	"る", //母音動詞
	"く",
	"く",
	"ぐ",
	"す",
	"つ",
	"ぬ",
	"ぶ",
	"む",
	"る",
	"る",
	"う",
	"う",
	"くる",
	"来る",
	"する",
	"ずる",
	"い", // イ形容詞アウオ段
	"い",
	"い",
	"だ", // ナ形容詞
	"だ",
	"だ",
	"たる",
	"だ", // 判定詞
	"", // 助動詞無活用型
	"ぬ",
	"だろう",
	"だ",
	"し",
	"ます",
	"うる",
	"得る"
};

int kihonglen[34][64] = {
	{0}, // NIL
	{0, 2, 0, 4, 2, 2, 4, 0, 0, 2, 6, 4, 4, 2, 4, 4, 4, 2}, // 母音動詞
	{0, 2, 2, 4, 2, 2, 4, 2, 2, 4, 8, 6, 6, 4, 6, 6, 4}, // 子音動詞カ行
	{0, 2, 2, 4, 2, 2, 4, 2, 2, 4, 8, 6, 6, 4, 6, 6, 4}, // 子音動詞カ行促音便形
	{0, 2, 2, 4, 2, 2, 4, 2, 2, 4, 8, 6, 6, 4, 6, 6, 4}, // 子音動詞ガ行
	{0, 2, 2, 4, 2, 2, 4, 2, 2, 4, 8, 6, 6, 4, 6, 6, 4}, // 子音動詞サ行
	{0, 2, 2, 4, 2, 2, 4, 2, 2, 4, 8, 6, 6, 4, 6, 6, 4}, // 子音動詞タ行
	{0, 2, 2, 4, 2, 2, 4, 2, 2, 4, 8, 6, 6, 8, 6, 6, 4}, // 子音動詞ナ行
	{0, 2, 2, 4, 2, 2, 4, 2, 2, 4, 8, 6, 6, 4, 6, 6, 4}, // 子音動詞バ行
	{0, 2, 2, 4, 2, 2, 4, 2, 2, 4, 8, 6, 6, 4, 6, 6, 4}, // 子音動詞マ行
	{0, 2, 2, 4, 2, 2, 4, 2, 2, 4, 8, 6, 6, 4, 6, 6, 4},
	{0, 2, 2, 4, 2, 2, 4, 2, 2, 4, 8, 6, 6, 4, 6, 6, 4},
	{0, 2, 2, 4, 2, 2, 4, 2, 2, 4, 8, 6, 6, 4, 6, 6},
	{0, 2, 2, 4, 2, 2, 4, 2, 2, 4, 8, 6, 6, 4, 6, 6},
	{0, 4, 2, 6, 4, 4, 6, 2, 2, 4, 8, 6, 6, 4, 6, 6, 6},
	{0, 4, 2, 6, 4, 4, 6, 2, 2, 4, 8, 6, 6, 4, 6, 6, 6},
	{0, 4, 2, 6, 4, 4, 6, 2, 2, 4, 8, 6, 6, 4, 6, 6, 6, 2, 2, 4},
	{0, 4, 2, 6, 4, 4, 6, 2, 2, 4, 8, 6, 6, 4, 6, 6, 6, 2, 2, 4},
	{0, 2, 4, 6, 4, 6, 2, 6, 10, 8, 8, 4, 8, 6, 8, 6, 4, 2, 4, 2, 2, 4}, // イ形容詞アウオ段
	{0, 2, 4, 6, 4, 6, 2, 6, 10, 8, 8, 4, 8, 6, 8, 6, 4, 0, 4, 4, 2, 4}, // イ形容詞イ段
	{0, 2, 4, 6, 4, 6, 2, 6, 10, 8, 8, 4, 8, 6, 8, 6, 4, 2, 4, 4, 2, 4}, // イ形容詞イ段特殊
	{0, 2, 4, 2, 6, 4, 6, 2, 6, 10, 8, 8, 2, 8, 4, 4, 6, 6, 6, 8, 6, 8, 6, 8, 12, 10, 10, 8, 10, 4, 8, 6, 6, 10, 8, 8, 6, 8}, // ナ形容詞
	{0, 2, 4, 2, 2, 6, 4, 6, 2, 6, 10, 8, 8, 2, 8, 4, 4, 6, 6, 6, 8, 6, 8, 6, 8, 12, 10, 10, 8, 10, 4, 8, 6, 6, 10, 8, 8, 6, 8}, // ナノ形容詞
	{0, 2, 4, 2, 0, 6, 4, 6, 2, 2, 6, 10, 8, 8, 2, 8, 4, 4, 6, 6, 6, 8, 6, 8, 6, 8, 12, 10, 10, 8, 10, 4, 8, 6, 6, 10, 8, 8, 6, 8}, // ナ形容詞特殊
	{0, 4, 2}, // タル形容詞
	{0, 2, 4, 2, 2, 6, 4, 6, 6, 10, 8, 8, 2, 8, 4, 6, 6, 8, 6, 8, 6, 8, 12, 10, 10, 8, 10, 4, 8, 6, 6, 10, 8, 8, 6, 8}, // 判定詞
	{0, 0}, // 助動詞 無活用型
	{0, 2, 4, 2, 8, 6, 6, 8, 6, 10, 8, 2, 8, 6, 4, 6, 6}, // 助動詞ぬ型
	{0, 6, 4, 6, 8, 6, 8, 6},
	{0, 2, 2, 6, 4},
	{0, 2, 2, 2},
	{0, 4, 4, 8, 6, 4, 6, 8, 6, 8},
	{0, 4, 2, 6, 4, 8, 6, 6, 4, 6},
	{0, 4, 2, 6, 4, 8, 6, 6, 4, 6} // 動詞性接尾辞得る型
};

int hyoji_level[34][64] = {
	{1}, // NIL
	{0, 1, 2, 2, 2, 1, 2, 2, 2, 2, 2, 2, 1, 2, 2, 2, 1, 2, 2}, // 母音動詞
	{0, 0, 2, 0, 2, 1, 2, 2, 2, 0, 2, 2, 1, 2, 2, 2, 1, 2}, // 子音動詞カ行
	{0, 0, 2, 0, 2, 1, 2, 2, 2, 0, 2, 2, 1, 2, 2, 2, 1, 2}, // 子音動詞カ行促音便形
	{0, 0, 2, 0, 2, 1, 2, 2, 2, 0, 2, 2, 1, 2, 2, 2, 1, 2}, // 子音動詞ガ行
	{0, 0, 2, 0, 2, 1, 2, 2, 2, 2, 2, 2, 1, 2, 2, 2, 1, 2}, // 子音動詞サ行
	{0, 0, 2, 0, 2, 1, 2, 2, 2, 0, 2, 2, 1, 2, 2, 2, 2, 2}, // 子音動詞タ行
	{0, 0, 2, 0, 2, 1, 2, 2, 2, 0, 2, 2, 1, 2, 2, 2, 1, 2}, // 子音動詞ナ行
	{0, 0, 2, 0, 2, 1, 2, 2, 2, 0, 2, 2, 1, 2, 2, 2, 1, 2}, // 子音動詞バ行
	{0, 0, 2, 0, 2, 1, 2, 2, 2, 0, 2, 2, 1, 2, 2, 2, 1, 2}, // 子音動詞マ行
	{0, 0, 2, 0, 2, 1, 2, 2, 2, 0, 2, 2, 1, 2, 2, 2, 1, 2}, // 子音動詞ラ行
	{0, 0, 2, 0, 2, 0, 2, 2, 2, 0, 2, 2, 0, 2, 2, 2, 1, 2}, // 子音動詞ラ行イ形
	{0, 0, 2, 0, 2, 1, 2, 2, 2, 0, 2, 2, 1, 2, 2, 2, 1}, // 子音動詞ワ行
	{0, 0, 2, 0, 2, 1, 2, 2, 2, 2, 2, 2, 1, 2, 2, 2, 1}, // 子音動詞ワ行文語音便形
	{0, 0, 2, 0, 2, 1, 2, 2, 2, 0, 2, 2, 1, 2, 2, 2, 2, 2}, // カ変動詞
	{0, 0, 2, 0, 2, 1, 2, 2, 2, 0, 2, 2, 1, 2, 2, 2, 2, 2}, // カ変動詞来
	{0, 2, 2, 1, 2, 1, 2, 2, 2, 2, 2, 2, 1, 2, 2, 2, 2, 2, 2, 2, 2}, // サ変動詞
	{0, 0, 2, 0, 2, 1, 2, 2, 2, 2, 2, 2, 1, 2, 2, 2, 1, 1, 2, 0, 2}, // ザ変動詞
	{0, 0, 2, 2, 2, 0, 2, 2, 2, 2, 0, 2, 2, 2, 2, 2, 2, 2, 1, 1, 1, 1, 1}, // イ形容詞アウオ段
	{0, 1, 2, 2, 2, 0, 2, 2, 2, 2, 0, 2, 2, 2, 2, 2, 2, 2, 1, 1, 1, 1, 1}, // イ形容詞イ段
	{0, 1, 2, 2, 2, 0, 2, 2, 2, 2, 0, 2, 2, 2, 2, 2, 2, 2, 1, 1, 1, 1, 1}, // イ形容詞イ段特殊
	//{0, 2, 2, 2, 2, 2, 1, 2, 2, 2, 2, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 0, 2, 2, 2, 2, 0, 2, 2, 2, 0, 2, 2, 0, 2, 2, 0, 2, 2}, // ナ形容詞
	//{0, 2, 2, 2, 2, 2, 2, 0, 2, 2, 2, 2, 0, 2, 2, 2, 2, 2, 2, 2, 2, 2, 0, 2, 2, 2, 2, 2, 0, 2, 2, 2, 2, 2, 0, 2, 2, 0, 2, 2, 2}, // ナノ形容詞
	//{0, 2, 2, 2, 2, 2, 2, 0, 2, 2, 2, 2, 2, 0, 2, 2, 2, 2, 2, 2, 2, 2, 2, 0, 2, 2, 2, 2, 0, 2, 2, 2, 2, 2, 0, 2, 2, 0, 2, 2, 2}, // ナ形容詞特殊
	{0, 2, 2, 2, 2, 2, 1, 2, 2, 2, 2, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 0, 2, 2, 2, 2, 0, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2}, // ナ形容詞
	{0, 2, 2, 2, 2, 2, 2, 0, 2, 2, 2, 2, 0, 2, 2, 2, 2, 2, 2, 2, 2, 2, 0, 2, 2, 2, 2, 2, 0, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2}, // ナノ形容詞
	{0, 2, 2, 2, 2, 2, 2, 0, 2, 2, 2, 2, 2, 0, 2, 2, 2, 2, 2, 2, 2, 2, 2, 0, 2, 2, 2, 2, 0, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2}, // ナ形容詞特殊
	{0, 2, 2, 2}, // タル形容詞
	{0, 2, 2, 2, 2, 2, 2, 0, 2, 2, 2, 0, 2, 2, 2, 2, 2, 2, 2, 0, 2, 2, 2, 2, 0, 2, 2, 2, 2, 2, 0, 2, 2, 0, 2, 2, 2}, // 判定詞
	{0, 2, 2}, // 助動詞 無活用型
	{0, 2, 2, 2, 2, 2, 0, 2, 2, 2, 2, 0, 0, 2, 0, 2, 2, 2}, // 助動詞ぬ型
	{0, 2, 2, 0, 2, 2, 0, 2, 0},
	{0, 2, 2, 2, 2, 2},
	{0, 2, 2, 2, 2},
	{0, 2, 2, 2, 2, 0, 2, 2, 2, 2, 2}, // 動詞性接尾辞ます型
	{0, 2, 2, 2, 2, 2, 2, 0, 2, 2, 2}, // 動詞性接尾辞うる型
	{0, 2, 2, 2, 2, 2, 2, 0, 2, 2, 2} // 動詞性接尾辞得る型
};

// hinshi matrix  map 
/*
char *matrix_string = "243 209 "
"0 10 10 10 10 10 10 10 10 0 0 0 0 0 0 10 10 10 10 10 0 8 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 20 0 0 0 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 7 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 20 20 0 0 0 0 0 0 0 0 0 0 0 0 8 0 0 0 0 0 0 0 0 0 10 10 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 10 30 10 30 10 10 10 10 10 0 0 10 10 10 10 10 0 8 10 10 "
"0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 10 0 0 0 0 0 0 0 10 0 10 0 2 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 "
"10 10 10 10 10 10 10 10 10 4 0 0 0 0 0 10 10 10 4 10 20 0 0 10 0 0 10 0 10 10 0 10 10 10 10 10 10 10 10 10 10 10 10 10 10 4 10 4 0 0 4 10 4 10 10 10 4 10 10 10 80 80 10 10 10 10 0 0 0 0 10 10 4 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 4 0 0 0 0 0 0 0 0 0 0 0 4 4 4 10 10 80 10 10 0 0 0 0 0 0 10 10 0 10 10 10 10 10 10 10 0 0 0 10 10 10 0 10 10 10 10 0 0 0 80 80 80 80 80 80 0 0 0 10 10 0 10 0 0 0 0 0 0 10 0 0 10 10 0 0 0 10 0 0 0 10 10 10 5 10 0 10 4 10 10 10 10 4 4 4 4 4 4 80 0 10 4 "
"10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 20 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 10 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 10 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 80 80 80 80 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 20 0 5 10 0 0 0 0 0 0 0 0 0 0 0 0 0 80 0 0 0 "
"10 10 10 10 10 10 10 10 10 4 0 0 0 0 0 10 10 10 4 10 20 0 0 10 0 0 0 0 0 0 0 10 10 10 0 0 10 10 10 10 10 10 10 0 0 4 10 4 0 0 4 10 4 10 10 10 4 10 10 10 80 80 0 0 0 0 0 0 0 0 0 0 4 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 4 0 0 0 0 0 0 0 0 0 0 0 4 4 4 10 10 80 80 10 0 0 0 0 0 0 10 0 0 10 10 0 0 0 0 0 0 0 0 10 10 10 0 0 10 10 10 0 0 0 80 80 80 80 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 10 0 0 0 0 0 0 0 10 10 10 5 10 0 10 4 10 10 10 0 4 4 4 4 4 4 80 0 10 4 "
"10 10 10 10 10 10 10 10 10 4 0 0 0 0 0 10 10 10 4 10 20 0 0 0 0 0 0 0 0 0 0 10 10 10 0 0 10 10 10 10 10 10 10 0 0 4 0 4 0 0 4 10 4 10 10 10 4 10 10 10 80 80 0 0 0 0 0 0 0 0 0 0 4 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 4 0 0 0 0 0 0 0 0 0 0 0 4 4 4 20 20 80 80 10 0 0 0 0 0 0 10 0 0 10 0 0 0 0 0 0 0 0 0 10 10 10 0 0 10 10 10 0 0 0 80 80 80 80 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 10 0 0 0 0 0 0 0 10 10 10 5 10 0 10 4 10 10 10 0 4 4 4 4 4 4 80 0 10 4 "
"12 10 10 10 10 10 10 10 10 0 0 0 0 0 0 10 10 10 10 10 20 0 0 0 0 0 0 0 0 0 0 10 0 0 0 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 10 10 10 10 10 10 10 10 10 10 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 20 80 80 80 0 0 0 0 0 0 10 0 0 0 10 0 0 0 0 0 0 0 0 0 10 10 10 0 0 10 0 0 0 0 0 80 80 80 80 80 80 0 0 0 0 0 0 0 0 0 0 0 10 10 10 0 0 0 0 0 0 0 0 0 0 0 12 10 10 25 10 0 10 10 10 10 10 0 0 10 10 10 10 10 80 0 10 10 "
"12 10 10 10 10 10 10 10 10 0 0 0 0 0 0 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 0 10 0 0 0 10 10 10 10 10 10 10 10 0 10 0 0 0 0 0 10 10 10 10 10 10 10 10 10 10 80 80 0 0 0 10 10 0 0 10 0 0 0 0 0 0 0 0 0 0 10 10 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 20 80 80 80 10 0 10 10 0 0 0 10 0 0 10 0 0 0 0 0 0 0 0 0 10 10 10 0 0 10 0 0 0 0 0 80 80 80 80 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 10 10 10 0 0 0 0 12 10 10 25 10 0 10 10 10 10 10 0 0 10 10 10 10 10 80 0 10 10 "
"10 10 10 10 10 10 10 10 10 4 0 0 0 0 0 10 10 10 4 10 20 0 0 0 0 0 10 0 10 10 0 10 10 10 0 10 10 10 10 10 10 10 10 10 10 4 10 4 0 0 4 10 4 10 10 10 4 10 10 10 80 80 10 10 10 10 0 0 0 0 10 10 4 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 4 0 0 0 0 0 0 0 0 0 0 0 4 4 4 10 10 80 10 10 0 0 0 0 0 0 10 10 0 10 10 10 10 10 10 10 0 0 0 10 10 10 0 10 10 10 10 0 10 0 80 80 80 80 80 80 0 0 0 10 10 0 10 0 0 0 0 0 0 10 0 0 10 10 0 0 0 10 0 0 0 10 10 10 5 10 0 10 4 10 10 10 10 4 4 4 4 4 4 80 0 10 4 "
"10 10 10 10 10 10 10 10 10 4 0 0 0 0 0 10 10 10 4 10 20 0 0 0 0 0 0 0 0 0 0 10 10 10 0 0 10 10 10 10 10 10 10 0 0 4 10 4 0 0 4 10 4 10 10 10 4 10 10 10 80 80 0 0 0 0 0 0 0 0 10 0 4 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 4 0 0 0 0 0 0 0 0 0 0 0 4 4 4 10 10 80 80 10 0 0 0 0 0 0 10 0 0 10 10 0 10 0 0 0 0 0 0 10 10 10 0 0 10 10 10 0 0 0 80 80 80 80 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 10 0 0 0 0 0 0 0 10 10 10 5 10 0 10 4 10 10 10 0 4 4 4 4 4 4 80 0 10 4 "
"12 10 10 10 10 10 10 10 10 0 0 0 0 0 0 10 10 10 10 10 20 0 0 0 0 0 0 0 0 0 0 10 0 0 0 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 10 10 10 10 10 10 10 10 10 10 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 20 80 80 80 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 10 10 10 0 0 10 0 0 0 0 0 80 80 80 80 80 80 0 0 0 0 0 0 0 0 0 0 0 10 10 10 0 0 0 0 0 0 0 0 0 0 0 12 10 10 25 10 0 10 10 10 10 10 0 0 10 10 10 10 10 80 0 10 10 "
"12 10 10 10 10 10 10 10 10 0 0 0 0 0 0 10 10 10 10 10 10 10 10 0 0 0 0 0 10 10 0 10 0 0 0 10 10 10 10 10 10 10 10 0 10 0 0 0 0 0 10 10 10 10 10 10 10 10 10 10 80 80 0 0 0 10 10 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 20 80 80 80 10 0 10 10 0 0 0 10 0 0 10 0 0 0 0 0 0 0 0 0 10 10 10 0 0 10 0 0 0 0 0 80 80 80 80 80 80 0 0 0 0 0 0 0 0 0 0 0 10 10 10 0 0 0 0 0 0 0 0 0 0 0 12 10 10 25 10 0 10 10 10 10 10 0 0 10 10 10 10 10 80 0 10 10 "
"12 10 10 10 10 10 10 10 10 0 0 0 0 0 0 10 10 10 10 10 10 0 10 0 0 0 0 0 0 0 0 10 0 0 0 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 10 10 10 10 10 10 10 10 10 10 80 80 0 0 0 10 10 0 0 10 0 0 0 0 0 0 0 0 0 0 10 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 20 80 80 80 10 0 10 10 0 0 0 10 0 0 10 0 0 0 0 0 0 0 0 0 10 10 10 0 0 10 0 0 0 0 0 80 80 80 80 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 10 0 0 0 0 0 0 12 10 10 25 10 0 10 10 10 10 10 0 0 10 10 10 10 10 80 0 10 10 "
"12 10 10 10 10 10 10 10 10 0 0 0 0 0 0 10 10 10 10 10 20 0 0 0 0 0 0 0 0 0 0 10 0 0 0 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 10 10 10 10 10 10 10 10 10 10 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 20 80 80 80 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 10 10 10 0 0 10 0 0 0 0 0 80 80 80 80 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 12 10 10 25 10 0 10 10 10 10 10 0 0 10 10 10 10 10 80 0 10 10 "
"12 10 10 10 10 10 10 10 10 0 0 0 0 0 0 10 10 10 10 10 20 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 10 10 10 10 10 10 10 10 10 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 20 80 80 80 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 10 10 10 0 0 0 0 0 0 0 0 80 80 80 80 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 12 10 10 25 10 0 10 10 10 10 10 0 0 10 10 10 10 10 80 0 10 10 "
"12 10 10 10 10 10 10 10 10 0 0 0 0 0 0 10 10 10 10 10 20 0 0 0 0 0 0 0 0 0 0 10 0 0 0 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 10 10 10 10 10 10 10 10 10 10 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 20 80 80 80 0 0 0 0 0 0 10 0 0 0 10 0 0 0 0 0 0 0 0 0 10 10 10 0 0 10 0 0 0 0 0 80 80 80 80 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 12 10 10 25 10 0 10 10 10 10 10 0 0 10 10 10 10 10 80 0 10 10 "
"10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 20 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 10 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 10 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 80 80 80 80 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 20 0 5 10 0 0 0 0 0 0 0 0 0 0 0 0 0 80 0 0 0 "
"0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 "
"0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 "
"30 10 10 10 10 10 10 10 10 4 0 0 0 0 0 10 10 10 4 10 20 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 4 0 4 0 0 4 10 4 10 10 10 4 10 10 10 80 80 0 0 0 0 0 0 0 0 0 0 4 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 4 0 0 0 0 0 0 0 0 0 0 0 4 4 4 20 80 80 10 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 10 10 10 0 0 0 0 0 0 0 0 80 80 80 80 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 10 0 0 0 0 0 0 0 30 10 10 25 10 0 10 4 10 10 10 0 4 4 4 4 4 4 80 0 10 4 "
"10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 20 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 10 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 10 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 80 80 80 80 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 20 0 5 10 0 0 0 0 0 0 0 0 0 0 0 0 0 80 0 0 0 "
"0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 "
"10 10 10 10 10 10 10 10 10 4 0 0 0 0 0 10 10 10 4 10 20 0 0 10 0 0 10 10 10 10 10 10 10 10 0 10 10 10 10 10 10 10 10 10 10 4 10 4 0 0 4 10 4 10 10 10 4 10 10 10 80 80 10 10 10 10 0 0 0 0 10 10 4 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 4 0 0 0 0 0 0 0 0 0 0 0 4 4 4 10 10 80 10 10 0 0 0 0 10 0 10 10 10 10 10 10 10 10 10 0 0 10 0 10 10 10 0 0 10 10 10 10 0 0 80 80 80 80 80 80 0 0 0 10 10 10 10 10 10 0 0 0 0 10 0 0 10 10 0 0 0 10 0 0 0 10 10 10 5 10 0 10 4 10 10 10 10 4 4 4 4 4 4 80 0 10 4 "
"0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 5 5 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 "
"10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 20 0 0 10 0 0 0 0 10 0 0 0 0 0 0 0 10 10 10 10 10 10 10 0 0 10 10 0 0 0 0 0 0 0 0 0 0 0 10 10 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 10 80 80 10 0 0 0 0 0 0 10 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 10 10 10 0 0 0 80 80 80 80 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 10 0 0 0 10 20 0 5 10 0 0 0 0 0 0 0 0 0 0 0 0 0 80 0 0 0 "
"10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 20 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 10 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 20 20 80 80 10 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 10 10 0 0 0 80 80 80 80 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 20 0 5 10 0 0 0 0 0 0 0 0 0 0 0 0 0 80 0 0 0 "
"10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 20 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 10 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 10 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 80 80 80 80 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 20 0 5 10 0 0 0 0 0 0 0 0 0 0 0 0 0 80 0 0 0 "
"12 10 10 10 10 10 10 10 10 0 0 20 0 20 20 10 10 10 10 10 20 10 20 20 20 20 20 20 20 20 20 20 100 20 10 20 20 20 20 20 20 20 20 20 20 0 0 0 0 0 10 10 10 10 10 10 10 10 10 10 20 20 20 20 20 20 20 20 20 20 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 10 10 10 10 0 10 0 0 0 10 0 10 10 0 0 0 0 10 0 0 0 10 0 0 0 0 0 0 0 0 0 0 10 10 10 0 20 20 20 10 20 20 20 20 20 20 20 20 20 20 10 0 0 0 0 0 0 0 0 0 10 10 10 0 0 10 0 0 0 0 0 20 20 20 20 20 20 20 20 20 0 0 0 0 0 0 0 0 20 20 10 0 0 0 0 10 0 0 0 0 0 0 12 10 10 25 10 0 10 10 10 10 10 0 0 10 10 10 10 10 20 0 10 10 "
"0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 "
"10 10 10 10 10 10 10 10 10 4 0 0 0 0 0 10 10 10 4 10 20 0 0 0 0 0 10 10 10 10 10 10 10 10 0 10 10 10 10 10 10 10 10 10 10 4 10 4 0 0 4 10 4 10 10 10 4 10 10 10 10 80 10 10 10 10 0 0 0 0 10 10 4 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 4 0 0 0 0 0 0 0 0 0 0 0 4 4 4 10 10 80 10 10 0 0 0 0 0 0 10 10 10 10 10 10 10 10 10 10 10 0 0 10 10 10 0 0 10 10 10 0 10 0 80 80 80 80 80 80 0 0 0 10 10 10 10 0 10 0 0 0 0 10 0 0 10 10 0 0 0 10 0 0 0 10 10 10 5 10 0 10 4 10 10 10 10 4 4 4 4 4 4 80 0 10 4 "
"12 10 10 10 10 10 10 10 10 0 0 0 0 0 0 10 10 10 10 10 10 10 10 0 0 0 0 0 10 10 0 10 0 0 0 10 10 10 10 10 10 10 10 0 10 0 0 0 0 0 10 10 10 10 10 10 10 10 10 10 80 80 10 10 10 10 10 0 0 10 10 0 0 10 0 10 0 0 10 10 0 0 10 10 0 0 10 0 0 0 0 0 0 0 10 0 0 0 0 0 10 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 20 80 80 80 10 10 10 10 10 10 10 10 0 0 10 0 0 0 0 0 0 0 0 0 10 10 10 0 0 10 0 0 0 0 0 80 80 80 80 80 80 0 0 0 0 10 0 0 0 0 0 0 10 10 10 0 0 0 0 0 10 10 0 0 0 0 12 10 10 25 10 0 10 10 10 10 10 0 0 10 10 10 10 10 80 0 10 10 "
"12 10 10 10 10 10 10 10 10 0 0 0 0 0 0 10 10 10 10 10 20 0 0 0 0 0 0 0 0 0 0 10 0 0 0 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 10 10 10 10 10 10 10 10 10 10 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 11 0 0 0 10 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 20 80 80 80 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 10 10 10 0 0 10 0 0 0 0 0 80 80 80 80 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 12 10 10 25 10 0 10 10 10 10 10 0 0 10 10 10 10 10 80 0 10 10 "
"0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 5 0 5 5 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 "
"12 10 10 10 10 10 10 10 10 0 0 20 0 20 20 10 10 10 10 10 20 10 20 20 20 20 20 20 20 20 20 20 100 20 10 20 20 20 20 20 20 20 20 20 20 0 0 0 0 0 10 10 10 10 10 10 10 10 10 10 20 20 20 20 20 20 20 20 20 20 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 10 10 10 10 0 10 0 0 0 10 0 10 10 0 0 0 0 10 0 0 0 10 0 0 0 0 0 0 0 0 0 0 10 10 10 0 20 20 20 10 20 20 20 20 20 20 20 20 20 20 10 0 0 0 0 0 0 0 0 0 10 10 10 0 0 10 0 0 10 0 0 20 20 20 20 20 20 20 20 20 0 0 0 0 0 0 0 0 20 20 10 0 0 0 0 10 0 0 0 0 0 0 12 10 10 25 10 0 10 10 10 10 10 0 0 10 10 10 10 10 20 0 10 10 "
"12 30 10 30 30 30 30 30 30 0 0 0 0 0 10 30 30 30 30 10 10 0 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 20 20 30 30 30 30 30 30 10 10 10 10 10 10 10 10 10 10 0 10 0 0 0 0 0 0 0 0 0 0 0 0 30 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 30 30 0 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 0 30 30 30 0 0 0 0 0 0 0 0 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 10 10 30 0 0 0 0 0 0 0 0 0 0 0 12 10 10 0 10 0 30 20 20 30 30 0 0 30 30 30 30 30 10 0 30 30 "
"12 8 8 8 8 8 8 8 8 0 10 10 10 10 10 8 8 8 10 10 10 0 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 8 8 10 8 8 8 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 10 0 0 0 0 0 10 0 0 0 0 0 10 0 10 0 10 0 0 0 0 0 0 0 0 0 10 0 10 10 0 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 0 8 8 8 0 0 0 0 0 0 0 0 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 10 10 8 0 0 0 0 0 0 0 0 0 0 0 12 10 10 25 10 0 8 8 8 8 8 0 0 8 10 10 10 10 10 0 10 10 "
"12 8 8 8 8 8 8 8 8 0 10 10 10 10 10 8 8 8 10 10 10 0 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 8 8 10 8 8 8 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 10 0 0 0 0 0 10 0 0 0 0 0 10 0 10 0 10 0 0 0 0 0 0 0 0 0 10 0 10 10 0 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 0 8 8 8 0 0 0 0 0 0 0 0 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 10 10 8 0 10 0 0 0 0 0 0 0 0 0 12 10 10 25 10 0 8 8 8 8 8 0 0 8 10 10 10 10 10 0 10 10 "
"0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 5 5 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 "
"10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 10 10 10 10 10 20 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 10 10 10 10 10 10 10 10 10 10 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 10 10 80 80 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 10 10 10 0 0 0 0 0 0 0 0 80 80 80 80 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 20 10 5 10 0 10 10 10 10 10 0 0 10 10 10 10 10 80 0 10 10 "
"30 10 10 10 10 10 10 10 10 0 0 20 0 20 20 10 10 10 10 10 20 10 20 20 20 20 20 20 20 20 20 20 100 20 10 20 20 20 20 20 20 20 20 20 20 0 0 0 0 0 10 10 10 10 10 10 10 10 10 10 20 20 20 20 20 20 20 20 20 20 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 10 10 10 10 0 10 0 0 0 10 0 10 10 0 0 10 0 10 0 0 0 10 0 0 0 0 0 0 0 0 0 0 10 10 10 0 20 20 20 10 20 20 20 20 20 20 20 20 20 20 10 0 0 0 0 0 0 0 0 0 10 10 10 0 0 10 0 0 10 0 0 20 20 20 20 20 20 20 20 20 0 0 0 0 0 0 0 10 20 20 10 0 0 0 0 10 0 0 0 0 0 0 30 10 10 25 10 0 10 10 10 10 10 0 0 10 10 10 10 10 20 0 10 10 "
"10 10 10 10 10 10 10 10 10 4 0 0 0 0 0 10 10 10 4 10 20 0 0 0 0 0 0 0 0 0 0 10 10 10 0 0 0 0 0 0 0 0 0 0 0 4 0 4 0 0 4 10 4 10 10 10 4 10 10 10 80 80 0 0 0 0 0 0 0 0 0 0 4 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 4 0 0 0 0 0 0 0 0 0 0 0 4 4 4 10 10 10 80 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 10 10 10 0 0 0 0 0 0 0 0 80 80 80 80 80 80 0 0 0 0 0 0 0 10 0 0 0 0 0 10 0 0 0 10 0 0 0 0 0 0 0 10 10 10 5 10 0 10 4 10 10 10 0 4 4 4 4 4 4 80 0 10 4 "
"0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 5 0 5 5 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 "
"10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 10 10 10 10 10 20 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 10 10 10 10 10 10 10 10 10 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 10 10 80 80 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 10 10 10 0 0 0 0 0 0 0 0 80 80 80 80 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 20 10 5 10 0 10 10 10 10 10 0 0 10 10 10 10 10 80 0 10 10 "
"0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 10 0 0 0 0 0 0 0 0 0 0 10 0 10 0 0 0 0 0 10 "
"30 10 10 10 10 10 10 10 10 0 0 0 0 0 0 10 10 10 10 10 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 10 10 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 10 0 10 10 10 10 10 0 0 10 10 10 10 10 0 10 10 10 "
"12 8 8 8 8 8 8 8 8 0 0 0 0 0 0 8 8 8 10 10 20 10 0 0 0 0 0 0 0 0 0 10 0 0 0 10 0 0 10 10 10 10 0 0 25 0 0 0 0 0 8 8 10 8 8 8 10 10 10 10 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 10 80 80 80 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 8 8 8 0 0 10 0 0 0 0 0 80 80 80 80 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 8 0 0 0 0 0 0 0 0 0 0 0 12 10 10 25 10 0 8 8 8 8 8 0 0 8 10 10 10 10 80 10 10 10 "
"12 10 10 10 10 10 10 10 10 0 0 0 0 0 0 10 10 10 10 10 20 0 0 0 0 0 0 0 0 0 0 10 0 0 0 10 0 0 10 10 10 10 0 0 0 0 0 0 0 0 10 10 10 10 10 10 10 10 10 10 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 20 80 80 80 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 10 10 10 0 0 10 0 0 0 0 0 80 80 80 80 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 12 10 10 25 10 0 10 10 10 10 10 0 0 10 10 10 10 10 80 0 10 10 "
"12 10 10 10 10 10 10 10 10 4 0 0 0 0 0 10 10 10 4 10 10 0 0 0 0 0 0 0 10 10 0 10 0 0 0 0 0 0 0 0 0 0 0 0 25 4 0 4 0 0 4 10 4 10 10 10 4 10 10 10 10 10 10 10 10 10 10 10 10 10 0 0 4 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 4 0 0 0 0 0 0 0 0 0 0 0 4 4 4 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 10 0 10 0 0 0 0 0 10 10 10 0 0 0 0 0 0 0 0 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 10 10 10 0 0 0 0 0 0 0 0 0 0 0 12 10 10 25 10 0 10 4 10 10 10 0 4 4 4 4 4 4 10 0 10 4 "
"12 10 10 10 10 10 10 10 10 0 0 0 0 0 0 10 10 10 10 10 20 0 0 0 0 0 0 0 0 0 0 10 0 0 0 10 10 0 10 10 10 10 10 0 25 0 0 0 0 0 10 10 10 10 10 10 10 10 10 10 80 10 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 10 80 10 10 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 10 10 10 0 0 10 0 0 0 0 0 10 10 10 10 10 10 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 12 10 10 25 10 0 10 10 10 10 10 0 0 10 10 10 10 10 80 0 10 10 "
"12 10 10 10 10 10 10 10 10 0 0 0 0 0 0 10 10 10 10 10 20 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 25 0 0 0 0 0 10 10 10 10 10 10 10 10 10 10 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 10 80 80 80 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 10 10 10 0 0 0 0 0 0 0 0 80 10 80 80 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 12 10 10 25 10 0 10 10 10 10 10 0 0 10 10 10 10 10 80 0 10 10 "
"12 10 10 10 10 10 10 10 10 0 0 0 0 0 0 10 10 10 10 10 20 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 25 0 0 0 0 0 10 10 10 10 10 10 10 10 10 10 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 10 80 80 80 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 10 10 10 0 0 0 0 0 0 0 0 80 80 80 80 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 12 10 10 25 10 0 10 10 10 10 10 0 0 10 10 10 10 10 80 0 10 10 "
"12 10 10 10 10 10 10 10 10 0 0 0 0 0 0 10 10 10 10 10 20 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 10 10 10 10 0 0 25 0 0 0 0 0 10 10 10 10 10 10 10 10 10 10 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 10 80 80 80 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 10 10 10 0 0 10 0 0 0 0 0 80 80 80 80 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 12 10 10 25 10 0 10 10 10 10 10 0 0 10 10 10 10 10 80 0 10 10 "
"12 10 10 10 10 10 10 10 10 0 0 0 0 0 0 10 10 10 10 10 20 0 0 0 0 0 0 0 0 0 0 10 0 0 0 10 10 10 10 10 10 10 10 0 25 0 0 0 0 0 10 10 10 10 10 10 10 10 10 10 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 10 80 80 80 0 0 0 0 0 0 0 0 0 0 10 0 10 0 0 0 0 0 0 0 10 10 10 0 0 10 0 0 0 0 0 80 80 80 80 80 80 10 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 12 10 10 25 10 0 10 10 10 10 10 0 0 10 10 10 10 10 80 0 10 10 "
"12 10 10 10 10 10 10 10 10 0 0 0 0 0 0 10 10 10 10 10 20 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 25 0 0 0 0 0 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 10 80 10 10 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 10 10 10 0 0 0 0 0 0 0 0 10 10 10 10 10 10 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 12 10 10 25 10 0 10 10 10 10 10 0 0 10 10 10 10 10 80 0 10 10 "
"12 10 10 10 10 10 10 10 10 0 0 0 0 0 0 10 10 10 10 10 10 0 0 0 0 0 0 0 0 0 0 10 0 0 0 10 0 0 0 0 0 10 0 0 25 0 0 0 0 0 10 10 10 10 10 10 10 10 10 10 80 80 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 10 80 80 80 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 10 10 10 0 0 10 0 0 0 0 0 80 80 80 80 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 12 10 10 25 10 0 10 10 10 10 10 0 0 10 10 10 10 10 80 0 10 10 "
"12 10 10 10 10 10 10 10 10 0 0 0 0 0 10 10 10 10 10 10 10 0 10 0 0 0 0 0 0 10 0 10 0 0 0 10 0 0 10 0 0 10 0 0 25 0 0 0 0 0 10 10 10 10 10 10 10 10 10 10 80 10 10 0 0 10 10 10 10 10 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 10 80 10 10 10 0 10 10 10 0 0 10 0 0 10 0 0 0 0 0 0 0 0 0 10 10 10 0 0 10 0 0 0 0 0 10 10 10 10 10 80 0 0 10 0 0 0 0 0 0 0 0 10 10 10 0 0 0 0 0 0 0 0 0 0 0 12 10 10 25 10 0 10 10 10 10 10 0 0 10 10 10 10 10 80 0 10 10 "
"12 10 10 10 10 10 10 10 10 0 0 0 0 0 0 10 10 10 10 10 20 0 10 0 0 0 0 0 0 0 0 10 0 0 0 10 0 0 10 10 10 10 0 0 25 0 0 0 0 0 10 10 10 10 10 10 10 10 10 10 80 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 10 80 80 10 0 0 0 0 0 0 0 0 0 0 10 0 10 0 0 0 0 0 0 0 10 10 10 0 0 10 0 0 0 0 0 80 80 80 80 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 12 10 10 25 10 0 10 10 10 10 10 0 0 10 10 10 10 10 80 0 10 10 "
"12 10 10 10 10 10 10 10 10 0 0 0 0 0 0 10 10 10 10 10 20 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 25 0 0 0 0 0 10 10 10 10 10 10 10 10 10 10 80 80 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 10 80 80 80 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 10 10 10 0 0 0 0 0 0 0 0 80 80 80 80 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 12 10 10 25 10 0 10 10 10 10 10 0 0 10 10 10 10 10 80 0 10 10 "
"12 10 10 10 10 10 10 10 10 0 0 0 0 0 0 10 10 10 10 10 20 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 10 0 0 10 0 0 25 0 0 0 0 0 10 10 10 10 10 10 10 10 10 10 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 10 80 80 80 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 10 10 10 0 0 10 0 0 0 0 0 80 80 80 80 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 12 10 10 25 10 0 10 10 10 10 10 0 0 10 10 10 10 10 80 0 10 10 "
"12 10 10 10 10 10 10 10 10 0 0 0 0 0 0 10 10 10 10 10 10 0 10 0 0 0 0 0 0 0 0 10 0 0 0 10 10 10 10 10 10 10 10 0 25 0 0 0 0 0 10 10 10 10 10 10 10 10 10 10 80 80 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 10 80 80 80 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 10 10 10 0 0 10 0 0 0 0 0 10 10 80 80 80 80 10 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 12 10 10 25 10 0 10 10 10 10 10 0 0 10 10 10 10 10 80 0 10 10 "
"10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 20 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 25 0 0 0 0 0 0 0 0 0 0 0 0 0 10 10 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 10 80 80 10 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 80 80 80 80 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 20 0 5 10 0 0 0 0 0 0 0 0 0 0 0 0 0 80 0 0 0 "
"10 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 10 20 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 10 0 0 25 0 0 0 0 0 0 0 0 0 0 0 0 0 10 10 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 10 10 80 10 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 10 80 80 80 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 20 0 5 10 0 0 0 0 0 0 0 0 0 0 0 0 0 80 0 0 0 "
"10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 20 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 25 0 0 0 0 0 0 0 0 0 0 0 0 0 10 10 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 10 80 80 10 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 80 80 80 80 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 20 0 5 10 0 0 0 0 0 0 0 0 0 0 0 0 0 80 0 0 0 "
"10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 20 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 10 0 0 25 0 0 0 0 0 0 0 0 0 0 0 0 0 10 10 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 10 80 80 10 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 80 80 80 80 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 20 0 5 10 0 0 0 0 0 0 0 0 0 0 0 0 0 80 0 0 0 "
"12 10 10 10 10 10 10 10 10 0 0 0 0 0 0 10 10 10 10 10 10 10 10 0 0 0 0 0 10 10 0 10 0 0 0 10 10 10 10 10 10 10 10 0 10 0 0 0 0 0 10 10 10 10 10 10 10 10 10 10 80 80 10 10 10 10 10 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 20 80 80 80 10 10 10 10 10 10 10 10 0 0 10 0 0 0 0 0 0 0 0 0 10 10 10 0 0 10 0 0 0 0 0 80 80 80 80 80 80 0 0 0 0 0 0 0 0 0 0 0 10 10 10 0 0 0 0 0 0 0 0 0 0 0 12 10 10 25 10 0 10 10 10 10 10 0 0 10 10 10 10 10 80 0 10 10 "
"12 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 20 0 0 0 0 0 0 0 10 10 0 20 20 20 10 10 10 10 10 10 10 0 10 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 10 10 0 0 0 0 0 0 0 0 0 0 0 10 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 12 0 0 25 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 "
"10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 20 0 0 10 0 0 0 0 10 10 0 0 0 0 0 0 0 0 10 10 10 10 0 0 10 10 10 0 0 0 0 0 0 0 0 0 0 0 10 10 80 80 10 10 10 10 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 10 80 80 10 0 0 0 0 0 0 10 10 0 0 10 10 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 0 0 0 80 80 80 80 80 80 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 20 0 5 10 0 0 0 0 0 0 0 0 0 0 0 0 0 80 0 0 0 "
"30 10 10 10 10 10 10 10 10 4 0 0 0 0 0 10 10 10 4 10 20 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 4 0 4 0 0 4 10 4 10 10 10 4 10 10 10 80 80 10 0 0 0 0 0 0 0 0 10 4 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 4 0 0 0 0 0 0 0 0 0 0 0 4 4 4 20 80 80 80 0 0 0 0 0 0 0 0 0 0 10 0 0 0 10 0 10 0 0 0 10 10 10 0 0 0 0 0 0 0 0 80 80 80 80 80 80 0 0 0 10 10 0 0 0 0 0 0 0 0 10 0 0 0 10 0 0 0 0 0 0 0 30 10 10 25 10 0 10 4 10 10 10 0 4 4 4 4 4 4 80 0 10 4 "
"10 10 10 10 10 10 10 10 10 4 0 0 0 0 0 10 10 10 4 10 20 0 0 10 0 0 0 10 0 0 0 10 10 10 0 0 10 10 10 10 10 10 10 0 0 4 10 4 0 0 4 10 4 10 10 10 4 10 10 10 80 80 0 0 0 0 0 0 0 0 10 0 4 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 4 0 0 0 0 0 0 0 0 0 0 0 4 4 4 10 10 80 80 0 0 0 0 0 0 0 0 0 0 10 10 0 10 0 0 0 0 0 0 10 10 10 0 0 10 10 10 0 0 0 80 80 80 80 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 10 0 0 0 0 0 0 0 10 10 10 5 10 0 10 4 10 10 10 0 4 4 4 4 4 4 80 0 10 4 "
"10 10 10 10 10 10 10 10 10 4 0 0 0 0 0 10 10 10 4 10 20 0 0 0 0 0 0 0 0 0 0 10 10 10 0 0 10 10 10 10 10 10 10 0 0 4 0 4 0 0 4 10 4 10 10 10 4 10 10 10 80 80 0 0 0 0 0 0 0 0 0 0 4 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 4 0 0 0 0 0 0 0 0 0 0 0 4 4 4 20 20 80 80 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 10 10 10 0 0 10 10 10 0 0 0 80 80 80 80 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 10 0 0 0 0 0 0 0 10 10 10 5 10 0 10 4 10 10 10 0 4 4 4 4 4 4 80 0 10 4 "
"12 10 10 10 10 10 10 10 10 0 0 0 0 0 0 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 0 10 0 0 0 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 10 10 10 10 10 10 10 10 10 10 80 80 0 0 10 10 10 0 0 10 0 0 0 0 0 0 0 0 0 0 10 10 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 20 80 80 80 10 0 10 10 0 10 10 10 0 0 10 0 0 0 0 0 0 0 0 0 10 10 10 0 0 10 0 0 0 0 0 80 80 80 80 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 10 0 0 0 0 0 0 12 10 10 25 10 0 10 10 10 10 10 0 0 10 10 10 10 10 80 0 10 10 "
"10 10 10 10 10 10 10 10 10 4 0 0 0 0 0 10 10 10 4 10 20 0 0 0 0 0 10 0 10 10 0 10 10 10 0 10 10 10 10 10 10 10 10 10 10 4 10 4 0 0 4 10 4 10 10 10 4 10 10 10 80 80 10 10 10 10 0 0 0 0 10 10 4 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 4 0 0 0 0 0 0 0 0 0 0 0 4 4 4 10 10 80 10 10 0 0 0 0 0 0 10 10 0 10 10 10 10 10 10 10 0 0 0 10 10 10 0 0 10 10 10 0 10 0 80 80 80 80 80 80 0 0 0 10 10 0 10 0 0 0 0 0 0 10 0 0 10 10 0 0 0 10 0 0 0 10 10 10 5 10 0 10 4 10 10 10 10 4 4 4 4 4 4 80 0 10 4 "
"12 10 10 10 10 10 10 10 10 0 0 0 0 0 0 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 0 10 0 0 0 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 10 10 10 10 10 10 10 10 10 10 80 80 0 0 10 10 10 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 10 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 20 80 80 80 10 0 10 10 0 10 10 10 0 0 10 0 0 0 0 0 0 0 0 0 10 10 10 0 0 10 0 0 0 0 0 80 80 80 80 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 10 10 0 0 0 0 12 10 10 25 10 0 10 10 10 10 10 0 0 10 10 10 10 10 80 0 10 10 "
"12 10 10 10 10 10 10 10 10 0 0 0 0 0 0 10 10 10 10 10 20 0 10 0 0 0 0 0 0 0 0 10 0 0 0 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 10 10 10 10 10 10 10 10 10 10 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 20 80 80 80 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 10 10 10 0 0 10 0 0 0 0 0 80 80 80 80 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 10 0 0 0 0 0 0 12 10 10 25 10 0 10 10 10 10 10 0 0 10 10 10 10 10 80 0 10 10 "
"12 10 10 10 10 10 10 10 10 0 0 0 0 0 0 10 10 10 10 10 20 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 10 10 10 10 0 0 0 0 0 0 0 0 10 10 10 10 10 10 10 10 10 10 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 20 80 80 80 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 10 10 10 0 0 10 0 0 0 0 0 80 80 80 80 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 12 10 10 25 10 0 10 10 10 10 10 0 0 10 10 10 10 10 80 0 10 10 "
"30 10 10 10 10 10 10 10 10 4 0 0 0 0 0 10 10 10 4 10 20 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 4 0 4 0 0 4 10 4 10 10 10 4 10 10 10 80 80 0 0 0 0 0 0 0 0 0 0 4 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 4 0 0 0 0 0 0 0 0 0 0 0 4 4 4 20 80 80 80 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 10 10 10 0 0 0 0 0 0 0 0 80 80 80 80 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 10 0 0 0 0 0 0 0 30 10 10 25 10 0 10 4 10 10 10 0 4 4 4 4 4 4 80 0 10 4 "
"10 10 10 10 10 10 10 10 10 4 0 0 0 0 0 10 10 10 4 10 20 0 0 10 0 0 10 0 10 10 0 10 10 10 0 0 10 10 10 10 10 10 10 10 10 4 10 4 0 0 4 10 4 10 10 10 4 10 10 10 80 80 10 10 10 10 0 0 0 0 10 10 4 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 4 0 0 0 0 0 0 0 0 0 0 0 4 4 4 10 10 80 10 10 0 0 0 0 0 0 10 10 0 10 10 10 10 0 10 10 0 0 0 10 10 10 0 0 10 10 10 0 0 0 80 80 80 80 80 80 0 0 0 10 10 0 10 10 10 0 0 0 0 10 0 0 10 10 0 0 0 10 0 0 0 10 10 10 5 10 0 10 4 10 10 10 10 4 4 4 4 4 4 80 0 10 4 "
"12 10 10 10 10 10 10 10 10 0 0 0 0 0 0 10 10 10 10 10 20 10 0 0 0 0 0 0 0 0 0 10 0 0 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 10 10 10 10 10 10 10 10 10 10 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 10 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 20 80 80 80 0 0 10 0 0 0 10 0 0 0 10 0 0 0 0 0 0 0 0 0 10 10 10 0 0 10 0 0 0 0 0 80 80 80 80 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 12 10 10 25 10 0 10 10 10 10 10 0 0 10 10 10 10 10 80 0 10 10 "
"10 10 10 10 10 10 10 10 10 4 0 0 0 0 0 10 10 10 4 10 20 0 0 0 0 0 10 0 10 10 0 10 10 10 0 0 10 10 10 10 10 10 10 10 10 4 10 4 0 0 4 10 4 10 10 10 4 10 10 10 80 80 10 10 10 10 0 0 0 0 10 10 4 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 4 0 0 0 0 0 0 0 0 0 0 0 4 4 4 10 10 80 10 10 0 0 0 0 0 0 10 10 0 10 10 10 10 10 10 10 0 0 0 10 10 10 0 0 10 10 10 0 0 0 80 80 80 80 80 80 0 0 0 10 10 0 10 0 0 0 0 0 0 10 0 0 10 10 0 0 0 10 0 0 0 10 10 10 5 10 0 10 4 10 10 10 10 4 4 4 4 4 4 80 0 10 4 "
"12 10 10 10 10 10 10 10 10 0 0 0 0 0 0 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 0 10 0 0 0 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 10 10 10 10 10 10 10 10 10 10 80 80 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 20 80 80 80 0 10 10 10 0 0 10 0 0 0 10 0 0 0 0 0 0 0 0 0 10 10 10 0 0 10 0 0 0 0 0 80 80 80 80 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 12 10 10 25 10 0 10 10 10 10 10 0 0 10 10 10 10 10 80 0 10 10 "
"10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 20 0 0 10 0 0 10 0 10 10 0 0 0 0 0 0 10 10 10 10 10 10 10 10 10 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 80 80 10 10 10 10 0 0 0 0 10 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 10 80 10 10 0 0 0 0 0 0 10 10 0 0 10 10 10 0 0 0 0 0 0 0 0 0 0 0 10 10 10 0 0 0 80 80 80 80 80 80 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 10 20 0 5 10 0 0 0 0 0 0 0 0 0 0 0 0 0 80 0 0 0 "
"10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 20 0 0 0 0 0 10 0 10 10 0 0 0 0 0 0 10 10 10 10 10 10 10 10 10 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 80 80 10 10 10 10 0 0 0 0 10 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 10 80 10 10 0 0 0 0 0 0 10 10 0 0 10 10 10 0 0 0 0 0 0 0 0 0 0 0 10 10 10 0 10 0 80 80 80 80 80 80 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 10 20 0 5 10 0 0 0 0 0 0 0 0 0 0 0 0 0 80 0 0 0 "
"12 10 10 10 10 10 10 10 10 0 0 0 0 0 0 10 10 10 10 10 20 10 0 0 0 0 0 0 0 0 0 10 0 0 0 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 10 10 10 10 10 10 10 10 10 10 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 20 80 80 80 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 10 10 10 0 0 10 0 0 0 0 0 80 80 80 80 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 12 10 10 25 10 0 10 10 10 10 10 0 0 10 10 10 10 10 80 0 10 10 "
"12 10 10 10 10 10 10 10 10 0 0 0 0 0 0 10 10 10 10 10 20 0 0 0 0 0 0 0 0 0 0 10 0 0 0 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 10 10 10 10 10 10 10 10 10 10 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 20 80 80 80 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 10 10 10 0 0 10 0 0 0 0 0 80 80 80 80 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 10 0 0 0 0 0 0 12 10 10 25 10 0 10 10 10 10 10 0 0 10 10 10 10 10 80 0 10 10 "
"12 8 8 8 8 8 8 8 8 10 0 0 0 0 0 8 8 8 10 10 20 0 0 0 0 0 0 0 10 10 0 10 0 0 0 10 10 0 10 10 10 10 10 0 0 10 0 10 0 0 8 8 10 8 8 8 10 10 10 10 80 80 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 10 80 80 80 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 8 8 8 0 0 10 0 0 0 0 0 80 80 80 80 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 8 0 0 0 0 0 0 0 0 0 0 0 12 10 10 25 10 0 8 8 8 8 8 0 0 8 10 10 10 10 80 0 10 10 "
"12 30 30 30 30 30 30 30 30 0 0 0 0 0 0 30 30 30 30 10 10 0 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 20 20 30 30 30 30 30 30 10 10 10 10 10 10 10 10 10 10 0 10 0 0 0 0 0 0 0 0 0 0 0 0 30 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 30 30 0 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 0 30 30 30 0 0 0 0 0 0 0 0 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 10 10 30 0 0 0 0 0 0 0 0 0 0 0 12 10 10 0 10 0 30 20 20 30 30 0 0 30 30 30 30 30 10 0 30 30 "
"12 10 10 10 10 10 10 10 10 0 0 0 0 0 0 10 10 10 10 10 20 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 10 0 0 10 0 0 25 0 0 10 0 0 10 10 10 10 10 10 10 10 10 10 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 10 80 80 80 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 10 0 0 0 10 10 10 0 0 10 0 0 0 0 0 80 80 80 80 80 80 0 0 0 0 0 0 0 0 10 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 12 10 10 25 10 0 10 10 10 10 10 0 0 10 10 10 10 10 80 0 10 10 "
"12 10 10 10 10 10 10 10 10 0 0 0 0 0 0 10 10 10 10 10 10 0 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 10 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 0 10 10 10 0 0 0 0 0 0 0 0 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 10 10 10 0 0 0 0 0 0 0 0 0 0 0 12 10 10 25 10 0 10 10 10 10 10 0 0 10 10 10 10 10 10 0 10 10 "
"12 10 10 10 10 10 5 5 5 0 10 10 10 10 10 5 5 5 10 10 10 0 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 5 5 10 30 30 30 30 30 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 0 0 0 0 30 0 0 0 0 0 0 0 10 0 0 0 0 0 10 0 0 0 0 0 10 0 10 0 10 0 0 0 0 0 0 0 0 0 10 0 10 10 0 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 0 30 30 30 0 0 0 0 0 0 0 0 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 10 10 30 0 0 0 0 0 0 0 0 0 10 0 12 10 10 0 10 0 30 10 20 30 30 0 0 10 10 10 10 10 10 0 10 10 "
"12 8 8 8 8 8 8 8 8 0 10 10 10 10 10 8 8 8 10 10 10 0 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 8 8 10 8 8 8 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 10 0 0 0 0 0 10 0 0 0 0 0 10 0 10 10 10 10 0 10 0 0 0 0 10 0 10 0 10 10 0 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 0 8 8 8 0 0 0 0 0 0 0 0 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 10 10 8 0 10 0 0 0 0 0 0 0 10 0 12 10 10 25 10 0 8 8 8 8 8 0 0 8 10 10 10 10 10 0 10 10 "
"12 10 10 10 10 10 10 10 10 0 10 10 10 10 10 30 30 30 10 10 10 0 10 10 10 10 10 10 10 10 10 20 20 20 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 10 20 10 30 30 30 30 30 10 10 10 10 10 10 10 10 10 10 0 10 0 0 0 0 0 0 0 0 0 0 0 0 30 0 0 0 0 0 10 10 10 0 0 0 0 0 10 10 0 10 0 10 10 0 10 0 10 0 0 0 0 0 0 0 0 0 10 0 10 10 0 10 10 10 10 10 11 10 10 10 10 10 10 10 10 30 0 10 0 0 0 0 0 0 0 30 30 30 0 0 0 0 0 0 0 0 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 10 10 30 0 0 0 0 0 0 0 0 0 0 0 12 10 10 25 10 0 30 10 20 30 30 0 0 10 10 10 10 10 10 0 10 10 "
"12 10 10 10 10 10 10 10 10 0 10 10 10 10 10 30 30 30 10 10 10 0 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 10 20 10 10 10 10 30 30 10 10 10 10 10 10 10 10 10 10 0 10 0 0 0 0 0 0 0 0 0 0 0 0 30 0 0 0 0 0 0 0 10 0 0 0 0 0 10 0 0 0 0 0 10 0 10 0 10 0 0 0 0 0 0 0 0 0 10 0 10 10 0 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 0 30 30 30 0 0 0 0 0 0 0 0 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 10 10 30 0 0 0 0 0 0 0 0 0 0 0 12 10 10 0 10 0 30 10 20 30 30 0 0 10 10 10 10 10 10 0 10 10 "
"0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 5 5 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 "
"10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 20 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 10 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 10 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 10 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 10 0 0 0 0 0 80 80 80 80 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 20 0 5 10 0 0 0 0 0 0 0 0 0 0 0 0 0 80 0 0 0 "
"12 10 10 10 10 10 10 10 10 0 10 10 10 10 10 30 30 30 10 10 10 0 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 10 20 10 30 30 30 30 30 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 0 0 0 0 30 0 0 0 0 0 0 0 10 0 0 0 0 0 10 0 0 0 0 0 10 0 0 0 10 0 0 0 0 0 0 0 0 0 10 0 10 10 0 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 0 30 30 30 0 0 0 0 0 0 0 0 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 10 10 30 0 0 0 0 0 0 0 0 0 0 0 12 10 10 0 10 0 30 10 20 30 30 0 0 10 10 10 10 10 10 0 10 10 "
"12 10 10 10 10 10 10 10 10 0 10 10 10 10 10 30 30 30 10 10 10 0 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 10 10 10 30 30 30 30 30 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 0 0 0 0 30 0 0 0 0 0 0 0 10 0 0 0 0 0 10 0 0 0 0 0 10 0 10 0 10 0 0 0 0 0 0 0 0 0 10 0 10 10 0 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 0 30 30 30 0 0 0 0 0 0 0 0 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 10 10 30 0 0 0 0 0 0 0 0 0 0 0 12 10 10 0 10 0 10 10 10 10 10 0 0 10 10 10 10 10 10 0 10 10 "
"30 10 10 10 10 10 10 10 10 4 0 0 0 0 0 10 10 10 4 10 20 0 0 0 0 0 0 0 10 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 4 0 4 0 0 4 10 4 10 10 10 4 10 10 10 80 80 0 0 0 0 0 0 0 0 0 0 4 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 4 0 0 0 0 0 0 0 0 0 0 0 4 4 4 20 80 80 80 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 10 10 10 0 0 0 0 0 0 0 0 80 80 80 80 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 10 0 0 0 0 0 0 0 30 10 10 25 10 0 10 4 10 10 10 0 4 4 4 4 4 4 80 0 10 4 "
"10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 10 10 10 10 10 10 0 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 0 10 10 10 0 0 0 0 0 0 0 0 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 10 10 10 0 0 0 0 0 0 0 0 0 0 10 10 10 10 10 10 10 10 10 10 10 10 0 0 10 10 10 10 10 10 0 10 10 "
"0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 10 "
"10 10 10 10 10 10 10 10 10 0 10 10 10 10 10 10 10 10 10 10 10 0 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 10 0 0 0 0 0 0 0 0 0 10 0 10 10 0 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 0 10 10 10 0 0 0 0 0 0 0 0 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 10 10 10 0 0 0 0 0 0 0 0 0 0 10 10 10 10 10 10 10 10 10 10 10 10 0 0 10 10 10 10 10 10 0 10 10 "
"12 8 8 8 8 8 8 8 8 0 0 0 0 0 0 8 8 8 10 10 10 0 10 10 0 0 0 0 0 0 0 10 0 0 0 10 10 10 10 10 10 10 10 0 25 0 0 0 0 0 8 8 10 8 8 8 10 10 10 10 80 10 10 0 10 10 10 10 10 10 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 10 80 80 10 10 10 10 10 0 10 0 10 0 0 10 0 0 0 0 0 0 0 0 0 8 8 8 0 0 10 0 0 0 0 0 10 10 80 10 10 80 10 0 10 0 0 0 0 0 0 0 0 10 10 8 0 0 0 0 0 0 0 0 0 0 0 12 10 10 25 10 0 8 8 8 8 8 0 0 8 10 10 10 10 80 0 10 10 "
"12 8 8 8 8 8 8 8 8 0 0 0 0 0 0 8 8 8 10 10 10 0 10 10 10 0 0 0 10 10 0 10 0 0 0 10 10 10 10 10 10 10 10 0 25 0 0 0 0 0 8 8 10 8 8 8 10 10 10 10 80 80 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 10 80 10 10 10 10 10 10 0 10 10 10 0 0 10 0 0 0 0 0 0 0 0 0 8 8 8 0 0 10 0 0 0 0 0 10 80 80 80 10 80 10 0 10 0 0 0 0 0 0 0 0 10 10 8 0 0 0 0 0 0 0 0 0 0 0 12 10 10 25 10 0 8 8 8 8 8 0 0 8 10 10 10 10 80 0 10 10 "
"12 8 8 8 8 8 8 8 8 0 0 0 0 0 0 8 8 8 10 10 10 0 10 10 10 0 0 0 10 10 0 10 0 0 0 10 10 10 10 10 10 10 10 0 25 0 0 0 0 0 8 8 10 8 8 8 10 10 10 10 80 10 0 0 10 0 0 10 10 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 10 80 10 10 10 10 0 0 0 10 0 10 0 0 10 0 10 0 0 10 0 0 0 0 8 8 8 0 0 10 0 0 0 0 0 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 0 0 10 10 8 0 0 0 0 0 0 0 0 0 0 0 12 10 10 25 10 0 8 8 8 8 8 0 0 8 10 10 10 10 80 0 10 10 "
"12 8 8 8 8 8 8 8 8 0 0 0 0 0 0 8 8 8 10 10 10 0 10 0 0 0 0 0 10 10 0 10 0 0 0 10 10 10 10 10 10 10 10 0 25 0 0 0 0 0 8 8 10 8 8 8 10 10 10 10 80 10 10 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 10 80 10 10 0 10 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 8 8 8 0 0 10 0 0 0 0 0 10 10 10 80 10 10 10 0 0 0 0 0 0 0 0 0 0 10 10 8 0 0 0 0 0 0 0 0 0 0 0 12 10 10 25 10 0 8 8 8 8 8 0 0 8 10 10 10 10 80 0 10 10 "
"12 8 8 8 8 8 8 8 8 0 0 0 0 0 0 8 8 8 10 10 20 0 10 10 0 0 0 0 10 10 0 10 0 0 0 10 10 10 10 10 10 10 10 0 25 0 0 0 0 0 8 8 10 8 8 8 10 10 10 10 80 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 10 80 10 10 0 0 0 0 0 0 0 0 0 0 10 0 10 0 0 0 0 0 0 0 8 8 8 0 0 10 0 0 0 0 0 10 10 10 80 10 10 0 0 0 0 0 0 0 0 0 0 0 10 10 8 0 0 0 0 0 0 0 0 0 0 0 12 10 10 25 10 0 8 8 8 8 8 0 0 8 10 10 10 10 80 0 10 10 "
"12 8 8 8 8 8 8 8 8 0 0 0 0 10 0 8 8 8 10 10 10 0 10 10 10 0 0 0 10 10 0 10 0 0 0 10 10 10 10 10 10 10 10 0 25 0 0 0 0 0 8 8 10 8 8 8 10 10 10 10 10 10 10 10 10 10 0 10 10 10 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 10 80 10 10 10 10 10 10 10 10 10 10 0 0 10 0 0 0 10 10 0 0 0 0 8 8 8 0 0 10 0 0 0 0 0 10 10 10 10 10 10 10 0 10 0 0 0 0 0 0 0 0 10 10 8 0 0 0 0 0 0 0 0 0 0 0 12 10 10 25 10 0 8 8 8 8 8 0 0 8 10 10 10 10 80 0 10 10 "
"12 8 8 8 8 8 8 8 8 0 0 0 0 0 0 8 8 8 10 10 10 0 10 0 0 0 0 0 0 0 0 10 0 0 0 10 0 0 10 10 10 10 0 0 25 0 0 0 0 0 8 8 10 8 8 8 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 10 80 10 10 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 10 0 0 0 0 8 8 8 0 0 10 0 0 0 0 0 10 10 10 10 10 10 0 0 0 0 0 0 0 0 0 0 0 10 10 8 0 0 0 0 0 0 0 0 0 0 0 12 10 10 25 10 0 8 8 8 8 8 0 0 8 10 10 10 10 80 0 10 10 "
"12 8 8 8 8 8 8 8 8 0 0 0 10 0 0 8 8 8 10 10 10 0 10 0 0 0 0 0 10 10 0 10 0 0 0 10 10 10 10 10 10 10 10 0 25 0 0 0 0 0 8 8 10 8 8 8 10 10 10 10 10 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 10 80 10 10 0 0 0 0 0 10 0 0 0 0 10 0 10 0 10 0 0 0 0 0 8 8 8 0 0 10 0 0 0 0 0 10 10 10 80 10 80 10 0 0 0 0 0 0 0 0 0 0 10 10 8 0 0 0 0 0 0 0 0 0 0 0 12 10 10 25 10 0 8 8 8 8 8 0 0 8 10 10 10 10 80 0 10 10 "
"12 8 8 8 8 8 8 8 8 0 0 0 0 0 0 8 8 8 10 10 20 0 0 0 0 0 0 0 10 10 0 10 0 0 0 10 10 10 10 10 10 10 10 0 25 0 0 0 0 0 8 8 10 8 8 8 10 10 10 10 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 10 80 80 80 0 0 0 0 0 0 0 0 0 0 10 0 10 0 0 0 0 0 0 0 8 8 8 0 0 10 0 0 0 0 0 10 80 80 80 80 80 0 0 0 0 0 0 0 0 0 0 0 10 10 8 0 0 0 0 0 0 0 0 0 0 0 12 10 10 25 10 0 8 8 8 8 8 0 0 8 10 10 10 10 80 0 10 10 "
"12 10 10 10 10 10 10 10 10 0 0 0 0 0 0 10 10 10 10 10 10 0 0 0 10 0 0 0 10 10 0 10 0 0 0 10 10 10 10 10 10 10 10 0 25 0 0 0 0 0 10 10 10 10 10 10 10 10 10 10 80 80 0 10 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 10 80 80 80 0 10 0 0 0 0 10 0 0 0 10 0 0 0 0 0 0 0 0 0 10 10 10 0 0 10 0 0 0 0 0 80 80 80 80 80 80 0 0 0 0 0 0 0 0 0 0 0 10 10 10 0 0 0 0 0 0 0 0 0 0 0 12 10 10 25 10 0 10 10 10 10 10 0 0 10 10 10 10 10 80 0 10 10 "
"12 10 10 10 10 10 10 10 10 0 0 0 0 0 0 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 0 10 0 0 0 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 10 10 10 10 10 10 10 10 10 10 80 80 0 0 10 10 10 0 0 10 0 0 0 0 0 0 0 0 0 0 10 10 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 20 80 80 80 10 0 10 10 0 10 10 10 0 0 10 0 0 0 0 0 0 0 0 0 10 10 10 0 0 10 0 0 0 0 0 80 80 80 80 80 80 0 0 0 0 0 0 0 0 0 0 0 10 10 10 0 0 0 0 10 0 0 0 0 0 0 12 10 10 25 10 0 10 10 10 10 10 0 0 10 10 10 10 10 80 0 10 10 "
"0 0 0 0 0 10 0 0 10 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 10 "
"0 0 0 0 10 10 0 10 10 0 0 0 0 0 0 0 10 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 10 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 10 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 10 "
"0 0 0 0 0 10 0 0 10 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 10 "
"0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 6 6 0 6 0 0 0 10 "
"0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 10 "
"0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 "
"0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 6 6 0 6 0 0 0 10 "
"0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 10 0 10 0 0 0 0 10 "
"0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 10 "
"10 10 10 10 10 10 10 10 10 4 0 0 0 0 0 10 10 10 4 10 20 0 0 0 0 0 10 10 10 10 10 10 10 10 0 10 10 10 10 10 10 10 10 10 10 4 10 4 0 0 4 10 4 10 10 10 4 10 10 10 80 80 10 10 10 10 0 0 0 0 10 10 4 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 4 0 0 0 0 0 0 0 0 0 0 0 4 4 4 10 10 80 10 10 0 0 0 0 0 0 10 10 10 10 10 10 10 10 10 10 10 0 0 10 10 10 0 0 10 10 10 0 10 0 80 80 80 80 80 80 0 0 0 10 10 10 10 0 10 0 0 0 0 10 0 0 10 10 0 0 0 10 0 0 0 10 10 10 5 10 0 10 4 10 10 10 10 4 4 4 4 4 4 80 0 10 4 "
"12 10 10 10 10 10 10 10 10 0 0 0 0 0 0 10 10 10 10 10 20 0 0 0 0 0 0 0 0 0 0 10 0 0 0 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 10 10 10 10 10 10 10 10 10 10 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 20 80 80 80 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 10 10 10 0 0 10 0 0 0 0 0 80 80 80 80 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 12 10 10 25 10 0 10 10 10 10 10 0 0 10 10 10 10 10 80 0 10 10 "
"0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 5 5 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 "
"12 10 10 10 10 10 10 10 10 0 0 20 0 20 20 10 10 10 10 10 20 10 20 20 20 20 20 20 20 20 20 20 100 20 10 20 20 20 20 20 20 20 20 20 20 0 0 0 0 0 10 10 10 10 10 10 10 10 10 10 20 20 20 20 20 20 20 20 20 20 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 10 10 10 10 0 10 0 0 0 10 0 10 10 0 0 10 0 10 0 0 0 10 0 0 0 0 0 0 0 0 0 0 10 10 10 0 20 20 20 10 20 20 20 20 20 20 20 20 20 20 10 0 0 0 0 0 0 0 0 0 10 10 10 0 0 10 0 0 0 0 0 20 20 20 20 20 20 20 20 20 0 0 0 0 0 0 0 10 20 20 10 0 0 0 0 10 0 0 0 0 0 0 12 10 10 25 10 0 10 10 10 10 10 0 0 10 10 10 10 10 20 0 10 10 "
"12 10 10 10 10 10 10 10 10 0 20 20 20 20 20 10 10 10 10 10 20 0 20 20 20 20 20 20 20 20 20 20 20 20 10 20 20 20 20 20 20 20 20 20 20 0 0 0 0 0 10 10 10 10 10 10 10 10 10 10 20 20 20 20 20 20 20 20 20 20 0 0 0 0 0 0 0 0 0 0 0 0 10 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 20 0 10 0 0 0 0 0 0 0 0 0 20 0 10 10 0 20 20 20 10 20 20 20 20 20 20 20 20 20 20 10 0 0 0 0 0 0 0 0 0 10 10 10 0 0 0 0 0 0 0 0 20 20 20 20 20 20 20 20 20 0 0 0 0 0 0 0 0 20 20 10 0 0 0 0 0 0 0 0 0 0 0 12 10 10 5 10 0 10 10 10 10 10 0 0 10 10 10 10 10 20 0 10 10 "
"10 10 10 10 10 10 10 10 10 4 0 0 0 0 0 10 10 10 4 10 20 0 0 10 0 0 10 10 10 10 10 10 10 10 0 10 10 10 10 10 10 10 10 10 10 4 10 4 0 0 4 10 4 10 10 10 4 10 10 10 80 80 10 10 10 10 0 0 0 0 10 10 4 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 4 0 0 0 0 0 0 0 0 0 0 0 4 4 4 10 10 80 10 10 0 0 0 0 10 0 10 10 10 10 10 10 10 10 10 0 0 10 0 10 10 10 0 0 10 10 10 10 0 0 80 80 80 80 80 80 0 0 0 10 10 10 10 10 10 0 0 0 0 10 0 0 10 10 0 0 0 10 0 0 0 10 20 10 5 10 0 10 4 10 10 10 10 4 4 4 4 4 4 80 0 10 4 "
"0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 "
"0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 "
"0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 10 0 0 0 0 0 0 0 10 0 10 0 10 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 "
"10 10 10 10 10 10 10 10 10 4 0 0 0 0 0 10 10 10 4 10 20 0 0 10 0 0 10 0 10 10 0 10 10 10 10 10 10 10 10 10 10 10 10 10 10 4 10 4 0 0 4 10 4 10 10 10 4 10 10 10 80 80 10 10 10 10 0 0 0 0 10 10 4 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 4 0 0 0 0 0 0 0 0 0 0 10 4 4 4 10 10 80 10 10 0 0 0 0 0 0 10 10 0 10 10 10 10 10 10 10 0 0 0 10 10 10 0 10 10 10 10 0 0 0 80 80 80 80 80 80 0 0 0 10 10 0 10 0 0 0 0 0 0 10 0 0 10 10 0 0 0 10 0 0 0 10 10 10 5 10 0 10 4 10 10 10 10 4 4 4 4 4 4 80 0 10 4 "
"30 10 10 10 10 10 10 10 10 4 0 0 0 0 0 10 10 10 4 10 20 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 4 0 4 0 0 4 10 4 10 10 10 4 10 10 10 80 80 0 0 0 0 0 0 0 0 0 0 4 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 4 0 0 0 0 0 0 0 0 0 0 0 4 4 4 20 80 80 80 0 0 0 0 0 0 0 0 0 0 10 0 0 0 10 0 10 0 0 0 10 10 10 0 0 0 0 0 0 0 0 80 80 80 80 80 80 0 0 0 10 0 0 0 0 0 0 0 0 0 10 0 0 0 10 0 0 0 0 0 0 0 30 10 10 25 10 0 10 4 10 10 10 0 4 4 4 4 4 4 80 0 10 4 "
"12 10 10 10 10 10 10 10 10 0 10 10 10 10 10 30 30 30 10 10 10 0 10 10 10 10 10 10 10 10 10 20 20 20 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 10 20 10 30 30 30 30 30 10 10 10 10 10 10 10 10 10 10 0 10 0 0 0 0 0 0 0 0 0 0 0 0 30 0 0 0 0 0 10 10 10 0 0 0 0 0 10 10 0 10 0 10 10 0 10 0 10 0 0 0 0 0 0 0 0 0 10 0 10 10 0 10 10 10 10 10 11 10 10 10 10 10 10 10 10 30 0 10 0 0 0 0 0 0 0 30 30 30 0 0 0 0 0 0 0 0 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 10 10 30 0 0 0 0 0 10 0 0 0 0 0 12 10 10 25 10 0 30 10 20 30 30 0 0 10 10 10 10 10 10 0 10 10 "
"12 10 10 10 10 10 10 10 10 0 0 0 0 0 0 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 0 10 0 0 0 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 10 10 10 10 10 10 10 10 10 10 80 80 0 0 10 10 10 0 0 10 0 0 0 0 0 0 0 0 0 0 10 10 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 20 80 80 80 10 0 10 10 0 10 10 10 0 0 10 0 0 0 0 0 0 0 0 0 10 10 10 0 0 10 0 0 0 0 0 80 80 80 80 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 10 10 0 0 0 0 0 12 10 10 25 10 0 10 10 10 10 10 0 0 10 10 10 10 10 80 0 10 10 "
"12 10 10 10 10 10 10 10 10 0 10 10 10 10 10 30 30 30 10 10 10 0 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 10 20 10 30 30 30 30 30 10 10 10 10 10 10 10 10 10 10 0 10 0 0 0 0 0 0 0 0 0 0 0 0 30 0 0 0 0 0 0 0 10 0 0 0 0 0 10 10 0 0 0 0 10 0 10 0 10 0 0 0 0 0 0 0 0 0 10 0 10 10 0 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 0 30 30 30 0 0 0 0 0 0 0 0 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 10 10 30 0 0 0 0 0 0 0 0 0 0 0 12 10 10 0 10 0 30 10 20 30 30 0 0 10 10 10 10 10 10 0 10 10 "
"12 10 10 10 10 10 10 10 10 0 10 10 10 10 10 30 30 30 10 10 10 0 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 10 20 10 30 30 30 30 30 10 10 10 10 10 10 10 10 10 10 0 10 0 0 0 0 0 0 0 0 0 0 0 0 30 0 0 0 0 0 0 0 10 0 0 0 0 0 10 0 0 0 10 0 10 0 10 0 10 0 0 0 0 0 0 0 0 0 10 0 10 10 0 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 0 30 30 30 0 0 0 0 0 0 0 0 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 10 10 30 0 0 0 0 0 0 0 0 0 0 0 12 10 10 0 10 0 30 10 20 30 30 0 0 10 10 10 10 10 10 0 10 10 "
"12 10 10 10 10 10 10 10 10 0 10 10 10 10 10 30 30 30 10 10 10 0 10 10 10 10 10 10 10 10 10 20 20 20 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 10 20 10 30 30 30 30 30 10 10 10 10 10 10 10 10 10 10 0 10 0 0 0 0 0 0 0 0 0 0 0 0 30 0 0 0 0 0 10 10 10 0 0 0 0 0 10 10 0 10 0 10 0 0 10 0 10 0 0 0 0 0 0 0 0 0 10 0 10 10 0 10 10 10 10 10 11 10 10 10 10 10 10 10 10 30 0 10 0 0 0 0 0 0 0 30 30 30 0 0 0 0 0 0 0 0 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 10 10 30 0 0 0 0 0 0 0 0 0 0 0 12 10 10 25 10 0 30 10 20 30 30 0 0 10 10 10 10 10 10 0 10 10 "
"0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 "
"12 10 10 10 10 10 10 10 10 0 10 10 10 10 10 30 30 30 10 10 10 0 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 10 20 10 30 30 30 30 30 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 0 0 0 0 30 0 0 0 0 0 0 0 10 0 0 0 0 0 10 0 0 0 0 0 10 0 10 0 10 0 0 0 0 0 0 0 0 0 10 0 10 10 0 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 0 30 30 30 0 0 0 0 0 0 0 0 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 10 10 30 0 0 0 0 0 0 0 0 0 0 0 12 10 10 0 10 0 30 10 20 30 30 0 0 10 10 10 10 10 10 0 10 10 "
"12 8 8 8 8 8 8 8 8 0 10 10 10 10 10 8 8 8 10 10 10 0 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 8 8 10 8 8 8 10 10 10 10 10 10 10 10 10 10 10 10 0 10 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 10 0 0 0 0 0 10 0 0 0 0 0 10 0 10 0 10 10 0 0 0 0 0 0 0 0 10 0 10 10 0 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 0 8 8 8 0 0 0 0 0 0 0 0 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 10 10 8 0 0 0 0 0 0 0 0 0 0 0 12 10 10 25 10 0 8 8 8 8 8 0 0 8 10 10 10 10 10 0 10 10 "
"12 10 10 10 10 10 10 10 10 0 10 10 10 10 10 30 30 30 10 10 10 0 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 10 20 10 30 30 30 30 30 10 10 10 10 10 10 10 10 10 10 0 10 0 0 0 0 0 0 0 0 0 0 0 0 30 0 0 0 0 0 0 0 10 0 0 0 0 0 10 0 0 0 0 0 10 0 10 10 10 10 0 0 0 0 0 0 0 0 10 0 10 10 0 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 0 30 30 30 0 0 0 0 0 0 0 0 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 10 10 30 0 0 0 0 0 0 0 0 0 0 0 12 10 10 0 10 0 30 10 20 30 30 0 0 10 10 10 10 10 10 0 10 10 "
"12 10 10 10 10 10 10 10 10 0 10 10 10 10 10 10 10 10 10 10 10 0 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 10 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 10 0 0 0 0 0 10 0 0 0 0 0 10 0 10 10 10 10 0 10 10 10 0 10 10 0 10 0 10 10 0 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 0 10 10 10 0 0 0 0 0 0 0 0 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 10 10 10 0 0 0 0 0 0 0 0 0 0 0 12 10 10 25 10 0 10 10 10 10 10 0 0 10 10 10 10 10 10 0 10 10 "
"12 8 8 8 8 8 8 8 8 0 10 10 10 10 10 8 8 8 10 10 10 0 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 8 8 10 8 8 8 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 10 0 0 0 0 0 10 0 0 0 0 0 10 0 10 10 10 10 0 10 0 0 0 0 10 0 10 0 10 10 0 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 0 8 8 8 0 0 0 0 0 0 0 0 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 10 10 8 0 10 0 0 0 0 0 0 0 0 0 12 10 10 25 10 0 8 8 8 8 8 0 0 8 10 10 10 10 10 0 10 10 "
"12 8 8 8 8 8 8 8 8 0 10 10 10 10 10 8 8 8 10 10 10 0 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 8 8 10 8 8 8 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 10 0 0 0 0 0 10 0 0 0 0 0 10 0 10 10 10 10 0 10 0 0 0 10 10 0 10 0 10 10 0 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 0 8 8 8 0 0 0 0 0 0 0 0 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 10 10 8 0 10 0 0 0 0 0 0 0 0 0 12 10 10 25 10 0 8 8 8 8 8 0 0 8 10 10 10 10 10 0 10 10 "
"12 10 10 10 10 10 10 10 10 0 10 10 10 10 10 30 30 30 10 10 10 0 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 10 10 20 10 30 30 30 30 30 10 10 10 10 10 10 10 10 10 10 0 10 0 0 0 0 0 0 0 0 0 0 0 0 30 0 0 0 0 0 0 0 10 0 0 0 0 0 10 0 0 0 0 0 10 0 10 0 10 0 0 0 0 0 0 0 0 0 10 0 10 10 0 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 0 30 30 30 0 0 0 0 0 0 0 0 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 10 10 30 0 0 0 0 0 0 0 0 0 0 0 12 10 10 0 10 0 30 10 20 30 30 0 0 10 10 10 10 10 10 0 10 10 "
"12 8 8 8 8 8 8 8 8 0 10 10 10 10 10 8 8 8 10 10 10 0 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 8 8 10 8 8 8 10 10 10 10 10 10 10 10 10 10 10 10 0 10 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 10 0 0 0 0 0 10 0 0 0 0 0 10 0 10 0 10 0 0 0 0 0 0 0 0 0 10 0 10 10 0 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 0 8 8 8 0 0 0 0 0 0 0 0 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 10 10 8 0 0 0 0 0 0 0 0 0 0 0 12 10 10 25 10 0 8 8 8 8 8 0 0 8 10 10 10 10 10 0 10 10 "
"12 8 8 8 8 8 8 8 8 0 10 10 10 10 10 8 8 8 10 10 10 0 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 8 8 10 8 8 8 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 10 0 0 0 0 0 10 0 0 0 0 0 10 0 10 10 10 10 0 10 10 10 0 10 10 0 10 0 10 10 0 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 0 8 8 8 0 0 0 0 0 0 0 0 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 10 10 8 0 10 0 0 0 0 0 0 0 0 0 12 10 10 25 10 0 8 8 8 8 8 0 0 8 10 10 10 10 10 0 10 10 "
"12 8 8 8 8 8 8 8 8 0 10 10 10 10 10 8 8 8 10 10 10 0 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 8 8 10 8 8 8 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 10 0 0 0 0 0 10 0 0 0 0 0 10 0 10 10 10 10 0 10 0 10 0 10 10 0 10 0 10 10 0 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 0 8 8 8 0 0 0 0 0 0 0 0 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 10 10 8 0 10 0 0 0 0 0 0 0 0 0 12 10 10 25 10 0 8 8 8 8 8 0 0 8 10 10 10 10 10 0 10 10 "
"12 8 8 8 8 8 8 8 8 0 10 10 10 10 10 8 8 8 10 10 10 0 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 8 8 10 8 8 8 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 10 0 0 0 0 0 10 0 0 0 0 0 10 0 10 10 10 10 0 10 0 0 10 10 10 0 10 0 10 10 0 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 0 8 8 8 0 0 0 0 0 0 0 0 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 10 10 8 0 10 0 0 0 0 0 0 0 0 0 12 10 10 25 10 0 8 8 8 8 8 0 0 8 10 10 10 10 10 0 10 10 "
"12 10 10 10 10 10 10 10 10 0 10 10 10 10 10 10 10 10 10 10 10 0 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 10 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 10 0 0 0 0 0 10 0 0 0 0 0 10 0 10 0 10 0 0 10 10 10 10 10 10 0 10 0 10 10 0 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 0 10 10 10 0 0 0 0 0 0 0 0 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 10 10 10 0 0 0 0 0 0 0 0 0 0 0 12 10 10 25 10 0 10 10 10 10 10 0 0 10 10 10 10 10 10 0 10 10 "
"12 10 10 10 10 10 10 10 10 0 10 10 10 10 10 30 30 30 10 10 10 0 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 10 20 10 30 30 30 30 30 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 0 0 0 0 30 0 0 0 0 0 0 0 10 0 0 0 0 0 10 0 0 0 0 0 10 0 10 0 10 0 0 0 0 0 0 0 10 0 10 0 10 10 0 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 0 30 30 30 0 0 0 0 0 0 0 0 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 10 10 30 0 0 0 0 0 0 0 0 0 0 0 12 10 10 0 10 0 30 10 20 30 30 0 0 10 10 10 10 10 10 0 10 10 "
"12 10 10 10 10 10 10 10 10 0 10 10 10 10 10 30 30 30 10 10 10 0 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 10 20 10 30 30 30 30 30 10 10 10 10 10 10 10 10 10 10 0 10 0 0 0 0 0 0 0 0 0 0 0 0 30 0 0 0 0 0 0 0 10 0 0 0 0 0 10 0 0 0 0 0 10 0 10 0 10 0 0 0 0 0 0 0 0 0 10 0 10 10 0 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 0 30 30 30 0 0 0 0 0 0 0 0 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 10 10 30 0 0 0 0 0 0 0 0 0 0 0 12 10 10 0 10 0 30 10 20 30 30 0 0 10 10 10 10 10 10 0 10 10 "
"12 10 10 10 10 10 10 10 10 0 10 10 10 10 10 30 30 30 10 10 10 0 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 5 5 10 20 10 30 30 30 30 30 10 10 10 10 10 10 10 10 10 10 0 10 0 0 0 0 0 0 0 0 0 0 0 0 30 0 0 0 0 0 0 0 10 0 0 0 0 0 10 0 0 0 0 0 10 0 10 0 10 5 5 0 0 0 0 10 10 10 10 0 0 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 30 0 0 0 0 0 0 0 0 0 30 30 30 0 0 0 0 0 0 0 0 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 10 10 30 0 10 0 0 0 0 0 0 0 0 0 12 10 10 0 10 0 30 10 20 30 30 0 0 10 10 10 10 10 10 0 10 10 "
"12 10 10 10 10 10 10 10 10 0 10 10 10 10 10 30 30 30 10 10 10 0 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 5 5 10 20 10 30 30 30 30 30 10 10 10 10 10 10 10 10 10 10 0 10 0 0 0 0 0 0 0 0 0 0 0 0 30 0 0 0 0 0 0 0 10 0 0 0 0 0 10 0 0 0 0 0 10 0 10 0 10 5 5 0 0 0 0 10 10 10 10 0 0 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 30 0 0 0 0 0 0 0 0 0 30 30 30 0 0 0 0 0 0 0 0 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 10 10 30 0 0 0 0 0 0 0 0 0 0 0 12 10 10 0 10 0 30 10 20 30 30 0 0 10 10 10 10 10 10 0 10 10 "
"12 10 10 10 10 10 10 10 10 0 10 10 10 10 10 30 30 30 10 10 10 0 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 5 5 10 20 10 30 30 30 30 30 10 10 10 10 10 10 10 10 10 10 0 10 0 0 0 0 0 0 0 0 0 0 0 0 30 0 0 0 0 0 0 0 10 0 0 0 0 0 10 0 0 0 0 0 10 0 10 0 10 5 5 0 0 0 0 10 10 10 10 0 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 30 0 0 0 0 0 0 0 0 0 30 30 30 0 0 0 0 0 0 0 0 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 10 10 30 0 10 0 0 0 0 0 0 0 0 0 12 10 10 0 10 0 30 10 20 30 30 0 0 10 10 10 10 10 10 0 10 10 "
"0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 10 10 10 10 10 10 10 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 "
"12 8 8 8 8 8 8 8 8 0 0 0 0 0 0 8 8 8 10 10 10 0 10 0 0 0 0 0 10 10 0 10 0 0 0 10 10 10 10 10 10 10 10 0 25 0 0 0 0 0 8 8 10 8 8 8 10 10 10 10 80 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 10 80 10 80 10 10 10 10 10 10 10 10 0 0 10 0 0 0 0 0 0 0 0 0 8 8 8 0 0 10 0 0 0 0 0 80 10 80 80 10 80 10 0 10 0 0 0 0 0 0 0 0 0 0 8 0 0 0 0 0 0 0 0 10 0 0 12 10 10 25 10 0 8 8 8 8 8 0 0 8 10 10 10 10 80 0 10 10 "
"12 8 8 8 8 8 8 8 8 0 0 0 0 0 0 8 8 8 10 10 20 0 0 0 0 0 0 0 0 0 0 10 0 0 0 10 10 10 10 10 10 10 10 0 25 0 0 0 0 0 8 8 10 8 8 8 10 10 10 10 80 80 0 0 0 0 0 0 0 15 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 10 80 80 80 10 0 0 10 0 0 10 10 0 0 10 0 0 0 0 0 0 0 0 0 8 8 8 0 0 10 0 0 0 0 0 80 80 80 80 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 8 0 0 0 0 0 0 0 0 0 0 0 12 10 10 25 10 0 8 8 8 8 8 0 0 8 10 10 10 10 80 0 10 10 "
"12 8 8 8 8 8 8 8 8 0 0 0 0 0 0 8 8 8 10 10 10 0 0 0 0 0 0 0 0 0 0 10 0 0 0 10 10 10 10 10 10 10 10 0 25 0 0 0 0 0 8 8 10 8 8 8 10 10 10 10 10 80 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 10 80 80 80 10 10 10 10 10 10 10 10 0 0 10 0 0 0 0 0 0 0 0 0 8 8 8 0 0 10 0 0 0 0 0 80 80 80 80 80 80 10 0 10 0 0 0 0 0 0 0 0 0 0 8 0 0 0 0 0 0 0 0 10 0 0 12 10 10 25 10 0 8 8 8 8 8 0 0 8 10 10 10 10 80 0 10 10 "
"12 8 8 8 8 8 8 8 8 0 0 0 0 0 0 8 8 8 10 10 20 0 0 0 0 0 0 0 0 0 0 10 0 0 0 10 0 0 10 10 10 10 0 0 25 0 0 0 0 0 8 8 10 8 8 8 10 10 10 10 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 10 80 80 80 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 8 8 8 0 0 10 0 0 0 0 0 80 80 80 80 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 8 0 0 0 0 0 0 0 0 0 0 0 12 10 10 25 10 0 8 8 8 8 8 0 0 8 10 10 10 10 80 0 10 10 "
"12 8 8 8 8 8 8 8 8 0 0 0 0 0 0 8 8 8 10 10 20 0 0 0 0 0 0 0 10 10 0 10 0 0 0 10 10 10 10 10 10 10 10 0 25 0 0 0 0 0 8 8 10 8 8 8 10 10 10 10 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 10 80 80 80 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 8 8 8 0 0 10 0 0 0 0 0 80 80 80 80 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 8 0 0 0 0 0 0 0 0 0 0 0 12 10 10 25 10 0 8 8 8 8 8 0 0 8 10 10 10 10 80 0 10 10 "
"12 8 8 8 8 8 8 8 8 0 0 0 0 0 0 8 8 8 10 10 20 0 0 0 0 0 0 0 10 10 0 10 0 0 0 10 10 0 10 10 10 10 10 0 25 0 0 0 0 0 8 8 10 8 8 8 10 10 10 10 80 10 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 10 80 10 10 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 8 8 8 0 0 10 0 0 0 0 0 80 80 80 80 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 8 0 0 0 0 0 0 0 0 0 0 0 12 10 10 25 10 0 8 8 8 8 8 0 0 8 10 10 10 10 80 0 10 10 "
"12 8 8 8 8 8 8 8 8 0 0 0 0 0 0 8 8 8 10 10 20 0 0 0 0 0 0 0 0 0 0 10 0 0 0 10 0 0 10 10 10 10 0 0 25 0 0 0 0 0 8 8 10 8 8 8 10 10 10 10 80 10 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 10 80 80 10 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 8 8 8 0 0 10 0 0 0 0 0 80 80 80 80 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 8 0 0 0 0 0 0 0 0 0 0 0 12 10 10 25 10 0 8 8 8 8 8 0 0 8 10 10 10 10 80 0 10 10 "
"12 8 8 8 8 8 8 8 8 0 0 0 0 0 0 8 8 8 10 10 10 0 0 10 10 0 0 0 10 10 0 10 0 0 0 10 10 10 10 10 10 10 10 0 25 0 0 0 0 0 8 8 10 8 8 8 10 10 10 10 80 10 10 0 10 10 10 10 10 10 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 10 80 10 10 10 10 10 10 0 10 0 10 0 0 10 0 10 0 0 0 0 0 0 0 8 8 8 0 0 10 0 0 0 0 0 10 10 80 80 10 80 10 0 10 0 0 0 0 0 0 0 0 0 0 8 0 0 0 0 0 0 0 0 0 0 0 12 10 10 25 10 0 8 8 8 8 8 0 0 8 10 10 10 10 80 0 10 10 "
"12 8 8 8 8 8 8 8 8 0 0 0 0 0 0 8 8 8 10 10 10 0 10 0 0 0 0 0 0 0 0 10 0 0 0 0 10 0 10 10 10 10 10 0 25 0 0 0 0 0 8 8 10 8 8 8 10 10 10 10 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 10 80 10 10 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 8 8 8 0 0 10 0 0 0 0 0 10 80 80 80 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 8 0 0 0 0 0 0 0 0 0 0 0 12 10 10 25 10 0 8 8 8 8 8 0 0 8 10 10 10 10 80 0 10 10 "
"12 8 8 8 8 8 8 8 8 0 0 0 0 0 0 8 8 8 10 10 20 0 0 0 0 0 0 0 10 0 0 10 0 0 0 0 0 0 0 10 10 0 0 0 0 0 0 0 0 0 8 8 10 8 8 8 10 10 10 10 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 10 80 80 80 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 8 8 8 0 0 0 0 0 0 0 0 80 80 80 80 10 80 0 0 0 0 0 0 0 0 0 0 0 0 0 8 0 0 0 0 0 0 0 0 0 0 0 12 10 10 25 10 0 8 8 8 8 8 0 0 8 10 10 10 10 80 0 10 10 "
"12 8 8 8 8 8 8 8 8 0 0 0 0 0 0 8 8 8 10 10 20 0 0 0 0 0 0 0 0 0 0 10 0 0 0 10 0 0 0 10 10 10 0 0 25 0 0 0 0 0 8 8 10 8 8 8 10 10 10 10 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 10 80 80 80 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 8 8 8 0 0 10 0 0 0 0 0 80 80 80 80 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 8 0 0 0 0 0 0 0 0 0 0 0 12 10 10 25 10 0 8 8 8 8 8 0 0 8 10 10 10 10 80 0 10 10 "
"12 10 10 10 10 10 10 10 10 0 0 0 0 0 0 10 10 10 10 10 10 0 10 10 10 10 10 10 10 10 100 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 10 0 0 0 0 0 10 0 0 0 0 0 10 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 0 10 10 10 0 0 0 0 0 0 0 0 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 10 10 10 0 0 0 0 0 0 0 0 10 0 0 12 10 10 25 10 0 10 10 10 10 10 0 0 10 10 10 10 10 10 0 10 10 "
"12 10 10 10 10 10 10 10 10 0 0 0 0 0 0 10 10 10 10 10 20 0 0 0 0 0 0 0 0 0 0 10 0 0 0 10 0 0 10 10 10 10 0 0 25 0 0 0 0 0 10 10 10 10 10 10 10 10 10 10 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 10 80 80 80 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 10 10 10 0 0 10 0 0 0 0 0 80 80 80 80 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 12 10 10 25 10 0 10 10 10 10 10 0 0 10 10 10 10 10 80 0 10 10 "
"12 10 10 10 10 10 10 10 10 0 20 20 20 20 20 10 10 10 10 10 20 0 20 20 20 20 20 20 20 20 20 20 20 20 10 20 20 20 20 20 20 20 20 20 20 0 10 0 0 0 10 10 10 10 10 10 10 10 10 10 20 20 20 20 20 20 20 20 20 20 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 20 0 10 0 0 0 0 0 0 0 0 0 20 0 10 10 0 20 20 20 10 20 20 20 20 20 20 20 20 20 20 10 0 0 0 0 0 0 0 0 0 10 10 10 0 0 0 0 0 0 0 0 20 20 20 20 20 20 20 20 20 0 0 0 0 0 0 0 0 20 20 10 0 0 0 0 0 0 0 0 0 0 0 12 10 10 5 10 0 10 10 10 10 10 0 0 10 10 10 10 10 20 0 10 10 "
"12 10 10 10 10 10 10 10 10 0 0 0 0 0 0 10 10 10 10 10 20 0 0 0 0 0 0 0 0 0 0 10 0 0 0 10 0 0 10 10 10 10 0 0 25 0 0 0 0 0 10 10 10 10 10 10 10 10 10 10 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 10 80 80 80 0 0 0 0 0 0 10 0 0 0 10 0 0 0 0 0 0 0 0 0 10 10 10 0 0 10 0 0 0 0 0 80 80 80 80 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 12 10 10 25 10 0 10 10 10 10 10 0 0 10 10 10 10 10 80 0 10 10 "
"12 10 10 10 10 10 10 10 10 0 0 0 0 0 0 10 10 10 10 10 10 0 10 0 10 0 0 0 10 10 0 10 0 0 0 10 10 10 10 10 10 10 10 0 25 0 10 0 0 0 10 10 10 10 10 10 10 10 10 10 80 80 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 10 80 10 10 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 10 10 10 0 0 10 0 0 0 0 0 10 10 10 10 10 80 10 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 12 10 10 25 10 0 10 10 10 10 10 0 0 10 10 10 10 10 80 0 10 10 "
"12 10 10 10 10 10 10 10 10 0 0 0 0 0 0 10 10 10 10 10 10 0 0 0 0 0 0 0 0 0 0 10 0 0 0 10 0 0 10 0 0 10 0 0 25 0 0 0 0 0 10 10 10 10 10 10 10 10 10 10 80 80 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 10 80 80 80 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 10 10 10 0 0 10 0 0 0 0 0 80 80 80 80 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 12 10 10 25 10 0 10 10 10 10 10 0 0 10 10 10 10 10 80 0 10 10 "
"12 10 10 10 10 10 10 10 10 0 0 0 0 0 0 10 10 10 10 10 20 0 0 0 0 0 0 0 10 10 0 10 0 0 0 10 10 10 10 10 10 10 10 0 25 0 0 0 0 0 10 10 10 10 10 10 10 10 10 10 80 80 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 10 80 80 80 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 10 10 10 0 0 10 0 0 0 0 0 80 10 80 80 80 80 10 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 12 10 10 25 10 0 10 10 10 10 10 0 0 10 10 10 10 10 80 0 10 10 "
"12 10 10 10 10 10 10 10 10 0 10 10 10 10 10 30 30 30 10 10 10 0 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 10 20 10 30 30 30 30 30 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 0 0 0 0 30 0 0 0 0 0 0 0 10 0 0 0 0 0 10 0 0 0 0 0 10 0 0 0 10 0 0 0 0 0 0 0 0 0 10 0 10 10 0 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 10 0 0 30 30 30 0 0 0 0 0 0 0 0 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 10 10 30 0 0 0 0 0 0 0 0 0 0 0 12 10 10 0 10 0 30 10 20 30 30 0 0 10 10 10 10 10 10 0 10 10 "
"12 10 10 10 10 10 10 10 10 0 0 0 0 0 0 10 10 10 10 10 20 0 10 0 0 0 0 0 10 10 0 10 0 0 0 10 10 10 0 10 10 10 10 0 25 0 10 0 0 0 10 10 10 10 10 10 10 10 10 10 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 10 80 80 10 0 0 0 0 0 0 0 0 0 0 10 0 10 0 0 0 0 0 0 0 10 10 10 0 0 10 0 0 0 0 0 80 10 80 80 80 80 10 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 12 10 10 25 10 0 10 10 10 10 10 0 0 10 10 10 10 10 80 0 10 10 "
"12 10 10 10 10 10 10 10 10 0 0 0 0 0 0 10 10 10 10 10 10 0 0 0 0 0 0 0 0 0 0 10 0 0 0 10 10 10 10 10 10 10 10 0 25 0 0 0 0 0 10 10 10 10 10 10 10 10 10 10 80 80 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 10 80 80 80 0 0 0 0 0 0 0 0 0 0 10 0 10 0 0 0 0 0 0 0 10 10 10 0 0 10 0 0 0 0 0 80 80 80 80 80 80 10 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 12 10 10 25 10 0 10 10 10 10 10 0 0 10 10 10 10 10 80 0 10 10 "
"12 10 10 10 10 10 10 10 10 0 0 0 0 0 0 10 10 10 10 10 20 0 0 0 0 0 0 0 0 0 0 10 0 0 0 10 0 0 10 10 10 0 0 0 25 0 0 0 0 0 10 10 10 10 10 10 10 10 10 10 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 10 80 80 80 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 10 10 10 0 0 0 0 0 0 0 0 80 80 80 80 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 12 10 10 25 10 0 10 10 10 10 10 0 0 10 10 10 10 10 80 0 10 10 "
"12 10 10 10 10 10 10 10 10 0 0 20 0 20 20 10 10 10 10 10 20 10 20 20 20 20 20 20 20 20 20 20 100 20 10 20 20 20 20 20 20 20 20 20 20 0 0 0 0 0 10 10 10 10 10 10 10 10 10 10 20 20 20 20 20 20 20 20 20 20 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 10 10 10 10 0 10 0 0 0 10 0 10 10 0 0 0 0 10 0 0 0 10 0 0 0 0 0 0 0 0 0 0 10 10 10 0 20 20 20 10 20 20 20 20 20 20 20 20 20 20 10 0 0 0 0 0 0 0 0 0 10 10 10 10 0 10 0 0 0 0 0 20 20 20 20 20 20 20 20 20 0 0 0 0 0 0 0 0 20 20 10 0 0 0 0 10 0 0 0 0 0 0 12 10 10 25 10 0 10 10 10 10 10 0 0 10 10 10 10 10 20 0 10 10 "
"10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 20 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 10 10 10 10 10 10 10 0 10 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 80 80 10 10 10 10 0 0 0 0 10 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 10 80 80 10 0 0 0 0 0 0 10 10 0 0 10 10 10 0 0 0 0 0 0 0 0 0 0 0 10 10 10 0 0 0 80 80 80 80 80 80 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 20 0 5 10 0 0 0 0 0 0 0 0 0 0 0 0 0 80 0 0 0 "
"10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 20 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 25 0 0 0 0 0 0 0 0 0 0 0 0 0 10 10 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 10 80 80 10 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 80 80 80 80 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 20 0 5 10 0 0 0 0 0 0 0 0 0 0 0 0 0 80 0 0 0 "
"10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 20 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 10 10 10 0 0 25 0 0 0 0 0 0 0 0 0 0 0 0 0 10 10 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 10 80 80 10 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 80 80 80 80 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 20 0 5 10 0 0 0 0 0 0 0 0 0 0 0 0 0 80 0 0 0 "
"10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 20 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 25 0 0 0 0 0 0 0 0 0 0 0 0 0 10 10 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 10 80 80 10 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 80 80 80 80 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 20 0 5 10 0 0 0 0 0 0 0 0 0 0 0 0 0 80 0 0 0 "
"10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 20 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 10 0 0 0 0 0 0 0 10 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 80 80 10 10 10 10 0 0 0 0 10 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 10 80 80 10 0 0 0 0 0 0 10 10 0 0 10 10 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 80 80 80 80 80 80 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 20 0 5 10 0 0 0 0 0 0 0 0 0 0 0 0 0 80 0 0 0 "
"10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 20 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 10 0 0 10 10 0 25 0 0 0 0 0 0 0 0 0 0 0 0 0 10 10 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 10 80 80 10 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 80 80 80 80 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 20 0 5 10 0 0 0 0 0 0 0 0 0 0 0 0 0 80 0 0 0 "
"12 8 8 8 8 8 8 8 8 0 0 0 0 0 0 8 8 8 10 10 20 0 0 0 0 0 0 0 0 0 0 10 0 0 0 10 10 10 10 10 10 10 10 0 25 0 0 0 0 0 8 8 10 8 8 8 10 10 10 10 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 10 80 80 80 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 8 8 8 0 0 10 0 0 0 0 0 80 80 80 80 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 8 0 0 0 0 0 0 0 0 0 0 0 12 10 10 25 10 0 8 8 8 8 8 0 0 8 10 10 10 10 80 0 10 10 "
"12 8 8 8 8 8 8 8 8 0 0 0 0 0 0 8 8 8 10 10 10 0 10 0 0 0 0 0 10 10 0 10 0 0 0 10 10 10 10 10 10 10 10 0 25 0 0 0 0 0 8 8 10 8 8 8 10 10 10 10 80 80 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 10 80 80 80 10 10 10 10 10 10 10 10 0 0 10 0 0 0 0 0 0 0 0 0 8 8 8 0 0 10 0 0 0 0 0 80 80 80 80 80 80 10 0 10 0 0 0 0 0 0 0 0 0 0 8 0 0 0 0 0 0 0 0 0 0 0 12 10 10 25 10 0 8 8 8 8 8 0 0 8 10 10 10 10 80 0 10 10 "
"12 8 8 8 8 8 8 8 8 0 0 0 0 0 0 8 8 8 10 10 10 0 10 10 0 0 0 0 0 0 0 10 0 0 0 10 10 10 10 10 10 10 10 0 25 0 0 0 0 0 8 8 10 8 8 8 10 10 10 10 80 80 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 10 80 80 80 10 10 10 10 10 10 10 10 0 0 10 0 0 0 0 0 0 0 0 0 8 8 8 0 0 10 0 0 0 0 0 80 80 80 80 80 80 10 0 10 0 0 0 0 0 0 0 0 0 0 8 0 0 0 0 0 0 0 0 0 0 0 12 10 10 25 10 0 8 8 8 8 8 0 0 8 10 10 10 10 80 0 10 10 "
"12 8 8 8 8 8 8 8 8 0 0 0 0 0 0 8 8 8 10 10 10 0 0 10 0 0 0 0 10 10 0 10 0 0 0 10 10 10 10 10 10 10 10 0 25 0 0 0 0 0 8 8 10 8 8 8 10 10 10 10 80 80 0 0 10 10 0 10 10 10 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 10 80 80 80 10 0 0 0 0 0 0 10 0 0 10 0 0 0 0 0 0 0 0 0 8 8 8 0 0 10 0 0 0 0 0 80 80 80 80 80 80 10 0 10 0 0 0 0 0 0 0 0 0 0 8 0 0 0 0 0 0 0 0 0 0 0 12 10 10 25 10 0 8 8 8 8 8 0 0 8 10 10 10 10 80 0 10 10 "
"12 8 8 8 8 8 8 8 8 0 0 0 0 0 0 8 8 8 10 10 20 0 0 10 0 0 0 0 10 10 0 10 0 0 0 10 10 10 10 10 10 10 10 0 25 0 0 0 0 0 8 8 10 8 8 8 10 10 10 10 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 10 80 80 80 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 8 8 8 0 0 10 0 0 0 0 0 80 80 80 80 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 8 0 0 0 0 0 0 0 0 0 0 0 12 10 10 25 10 0 8 8 8 8 8 0 0 8 10 10 10 10 80 0 10 10 "
"12 8 8 8 8 8 8 8 8 0 0 0 0 0 0 8 8 8 10 10 20 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 10 10 10 10 0 0 25 0 0 0 0 0 8 8 10 8 8 8 10 10 10 10 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 10 80 80 80 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 8 8 8 0 0 10 0 0 0 0 0 80 80 80 80 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 8 0 0 0 0 0 0 0 0 0 0 0 12 10 10 25 10 0 8 8 8 8 8 0 0 8 10 10 10 10 80 0 10 10 "
"12 8 8 8 8 8 8 8 8 0 0 0 0 0 0 8 8 8 10 10 20 0 0 0 0 0 0 0 0 0 0 10 0 0 0 10 0 0 10 10 10 10 0 0 0 0 0 0 0 0 8 8 10 8 8 8 10 10 10 10 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 10 80 80 80 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 8 8 8 0 0 10 0 0 0 0 0 80 80 80 80 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 8 0 0 0 0 0 0 0 0 0 0 0 12 10 10 25 10 0 8 8 8 8 8 0 0 8 10 10 10 10 80 0 10 10 "
"12 10 10 10 10 10 10 10 10 0 0 0 0 0 0 10 10 10 10 10 20 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 10 0 0 0 0 0 25 0 0 0 0 0 10 10 10 10 10 10 10 10 10 10 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 10 80 80 80 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 10 10 10 0 0 0 0 0 0 0 0 80 80 80 80 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 12 10 10 25 10 0 10 10 10 10 10 0 0 10 10 10 10 10 80 0 10 10 "
"12 10 10 10 10 10 10 10 10 0 0 0 0 0 0 10 10 10 10 10 20 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 10 0 0 25 0 0 0 0 0 10 10 10 10 10 10 10 10 10 10 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 10 80 80 80 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 10 10 10 0 0 10 0 0 0 0 0 80 80 80 80 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 12 10 10 25 10 0 10 10 10 10 10 0 0 10 10 10 10 10 80 0 10 10 "
"0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 "
"0 70 70 70 70 70 70 70 70 10 0 0 0 0 0 70 70 70 70 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 10 0 0 70 70 70 70 70 70 70 70 0 0 0 0 10 0 0 0 0 0 0 0 0 10 10 0 0 0 0 0 0 0 0 0 70 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 70 0 0 0 0 0 0 0 0 0 0 0 70 70 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 70 0 0 0 0 0 0 0 0 0 70 70 70 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 70 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 70 70 70 70 70 0 0 70 70 70 70 70 0 0 70 70 "
"30 10 10 10 10 10 10 10 10 4 0 0 0 0 0 10 10 10 4 10 20 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 4 0 4 0 0 4 10 4 10 10 10 4 10 10 10 80 80 0 0 0 0 0 0 0 0 0 0 4 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 4 0 0 0 0 0 0 0 0 0 0 0 4 4 4 20 80 80 80 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 10 10 10 0 0 0 0 0 0 0 0 80 80 80 80 80 80 0 0 0 10 0 0 0 0 0 0 0 0 0 10 0 0 0 10 0 0 0 0 0 0 0 30 10 10 25 10 0 10 4 10 10 10 0 4 4 4 4 4 4 80 0 10 4 "
"12 10 10 10 10 10 10 10 10 0 0 0 0 0 0 10 10 10 10 10 20 10 0 0 0 0 0 0 0 0 0 10 0 0 0 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 10 10 10 10 10 10 10 10 10 10 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 20 80 80 80 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 10 10 10 0 0 10 0 0 0 0 0 80 80 80 80 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 10 10 0 0 0 0 12 10 10 25 10 0 10 10 10 10 10 0 0 10 10 10 10 10 80 0 10 10 "
"10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 20 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 10 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 80 80 10 10 10 10 0 0 0 0 10 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 10 80 80 10 0 0 0 0 0 0 10 10 0 0 10 10 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 80 80 80 80 80 80 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 20 0 5 10 0 0 0 0 0 0 0 0 0 0 0 0 0 80 0 0 0 "
"10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 20 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 10 10 10 10 0 0 10 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 80 80 10 10 10 10 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 10 80 80 10 0 0 0 0 0 0 10 10 0 0 10 10 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 0 0 0 80 80 80 80 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 20 0 5 10 0 0 0 0 0 0 0 0 0 0 0 0 0 80 0 0 0 "
"10 10 10 10 10 10 10 10 10 4 0 0 0 0 0 10 10 10 4 10 20 0 0 0 0 0 0 0 0 0 0 10 10 10 0 10 0 0 10 10 10 10 0 0 10 4 10 4 0 0 4 10 4 10 10 10 4 10 10 10 80 80 10 10 10 10 0 0 0 0 10 10 4 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 4 0 0 0 0 0 0 0 0 0 0 0 4 4 4 10 10 80 80 10 0 0 0 0 0 0 10 10 0 10 10 10 10 0 0 0 0 0 0 10 10 10 0 0 10 10 0 0 0 0 80 80 80 80 80 80 0 0 0 10 10 0 0 0 0 0 0 0 0 10 0 0 0 10 0 0 0 0 0 0 0 10 10 10 5 10 0 10 4 10 10 10 0 4 4 4 4 4 4 80 0 10 4 "
"10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 20 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 10 10 10 10 0 0 10 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 80 80 10 10 10 10 0 0 0 0 10 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 10 80 80 10 0 0 0 0 0 0 10 10 0 0 10 10 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 0 0 0 80 80 80 80 80 80 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 20 0 5 10 0 0 0 0 0 0 0 0 0 0 0 0 0 80 0 0 0 "
"0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 "
"10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 20 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 10 10 80 80 10 10 10 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 10 80 80 10 0 0 0 0 0 0 10 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 80 80 80 80 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 20 0 5 10 0 0 0 0 0 0 0 0 0 0 0 0 0 80 0 0 0 "
"12 10 10 10 10 10 10 10 10 0 0 0 0 0 0 10 10 10 10 10 20 10 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 10 10 10 10 10 10 10 10 10 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 20 80 80 80 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 10 10 10 0 0 10 0 0 0 0 10 80 80 80 80 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 12 10 10 25 10 0 10 10 10 10 10 0 0 10 10 10 10 10 80 0 10 10 "
"30 10 10 10 10 10 10 10 10 4 0 0 0 0 0 10 10 10 4 10 20 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 4 0 4 0 0 4 10 4 10 10 10 4 10 10 10 80 80 0 0 0 0 0 0 0 0 0 0 4 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 4 0 0 0 0 0 0 0 0 0 0 0 4 4 4 20 80 80 80 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 10 10 10 0 0 0 0 0 0 0 10 80 80 80 80 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 10 0 0 0 0 0 0 0 30 10 10 25 10 0 10 4 10 10 10 0 4 4 4 4 4 4 80 0 10 4 "
"10 10 10 10 10 10 10 10 10 4 0 0 0 0 0 10 10 10 4 10 20 0 0 0 0 0 0 0 0 0 0 10 10 10 0 10 10 10 10 10 10 10 10 0 10 4 10 4 0 0 4 10 4 10 10 10 4 10 10 10 80 80 10 10 10 10 0 0 0 0 10 10 4 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 4 0 0 0 0 0 0 0 0 0 0 0 4 4 4 10 10 80 80 10 0 0 0 0 0 0 10 10 0 10 10 10 10 0 0 0 0 0 0 10 10 10 0 0 10 10 10 0 0 0 80 80 80 80 80 80 0 0 0 10 0 10 10 10 10 0 0 0 0 10 0 0 0 10 0 0 0 0 0 0 0 10 10 10 5 10 0 10 4 10 10 10 10 4 4 4 4 4 4 80 0 10 4 "
"12 10 10 10 10 10 10 10 10 0 0 0 0 0 0 10 10 10 10 10 20 10 10 0 0 0 0 10 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 10 10 10 10 10 10 10 10 10 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 20 80 80 80 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 10 10 10 0 0 10 0 0 0 0 0 80 80 80 80 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 12 10 10 25 10 0 10 10 10 10 10 0 0 10 10 10 10 10 80 0 10 10 "
"10 10 10 10 10 10 10 10 10 4 0 0 0 0 0 10 10 10 4 10 20 0 0 0 0 0 0 0 0 0 0 10 10 10 0 10 0 0 0 0 0 0 0 0 10 4 10 4 0 0 4 10 4 10 10 10 4 10 10 10 80 80 10 10 10 10 0 0 0 0 10 10 4 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 4 0 0 0 0 0 0 0 0 0 0 0 4 4 4 10 10 80 80 10 0 0 0 0 0 0 10 10 0 10 10 10 10 0 0 0 0 0 0 10 10 10 0 0 0 0 0 0 10 0 80 80 80 80 80 80 0 0 0 10 0 0 10 0 0 0 0 0 0 10 0 0 0 10 0 0 0 0 0 0 0 10 10 10 5 10 0 10 4 10 10 10 0 4 4 4 4 4 4 80 0 10 4 "
"12 10 10 10 10 10 10 10 10 0 0 0 0 0 0 10 10 10 10 10 10 10 10 0 0 0 0 0 10 10 0 10 0 0 0 10 10 10 10 10 10 10 10 0 10 0 0 0 0 0 10 10 10 10 10 10 10 10 10 10 80 80 10 10 10 10 10 0 0 10 0 0 0 0 0 0 0 0 10 10 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 20 80 80 80 10 10 10 10 10 10 10 10 0 0 10 0 0 0 0 0 0 0 0 0 10 10 10 0 0 10 0 0 0 0 0 80 80 80 80 80 80 0 0 0 0 10 0 0 0 0 0 0 10 10 10 0 0 0 0 0 10 10 0 0 0 0 12 10 10 25 10 0 10 10 10 10 10 0 0 10 10 10 10 10 80 0 10 10 "
"10 10 10 10 10 10 10 10 10 4 0 0 0 0 0 10 10 10 4 10 20 0 0 0 0 0 0 0 10 10 0 10 10 10 0 10 10 10 10 10 10 10 10 0 10 4 10 4 0 0 4 10 4 10 10 10 4 10 10 10 80 80 10 10 10 10 0 0 0 0 10 10 4 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 4 0 0 0 0 0 0 0 0 0 0 0 4 4 4 10 10 80 80 10 0 0 0 0 0 0 10 10 0 10 10 10 10 0 0 0 0 0 0 10 10 10 0 0 10 10 10 0 0 0 80 80 80 80 80 80 0 0 0 10 0 10 10 10 10 0 0 0 10 10 0 0 0 10 0 0 0 0 0 0 0 10 10 10 5 10 0 10 4 10 10 10 10 4 4 4 4 4 4 80 0 10 4 "
"10 10 10 10 10 10 10 10 10 4 0 0 0 0 0 10 10 10 4 10 20 0 0 0 0 0 0 0 0 0 0 10 10 10 0 0 10 10 10 10 10 10 10 0 0 4 10 4 0 0 4 10 4 10 10 10 4 10 10 10 80 80 0 0 0 0 0 0 0 0 0 0 4 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 4 0 0 0 0 0 0 0 0 0 0 0 4 4 4 10 10 80 80 0 0 0 0 0 0 0 0 0 0 10 10 0 0 0 0 0 0 0 0 10 10 10 0 0 10 10 10 0 0 0 80 80 80 80 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 10 0 0 0 0 0 0 0 10 10 10 5 10 0 10 4 10 10 10 0 4 4 4 4 4 4 80 0 10 4 "
"30 10 10 10 10 10 10 10 10 4 0 0 0 0 0 10 10 10 4 10 20 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 4 0 4 0 0 4 10 4 10 10 10 4 10 10 10 80 80 0 0 0 0 0 0 0 0 0 0 4 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 4 0 0 0 0 0 0 0 0 0 0 0 4 4 4 20 80 10 80 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 10 10 10 0 0 0 0 0 0 0 0 80 80 80 80 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 10 0 0 0 0 0 0 0 30 10 10 25 10 0 10 4 10 10 10 0 4 4 4 4 4 4 80 0 10 4 "
"30 10 10 10 10 10 10 10 10 4 0 0 0 0 0 10 10 10 4 10 20 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 4 0 4 0 0 4 10 4 10 10 10 4 10 10 10 80 80 0 0 0 0 0 0 0 0 0 0 4 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 4 0 0 0 0 0 0 0 0 0 0 0 4 4 4 20 80 80 80 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 10 10 10 0 0 0 0 0 0 0 0 80 80 80 80 80 80 0 0 0 10 0 0 0 0 10 0 0 0 0 100 0 0 0 10 0 0 0 0 0 0 0 30 10 10 25 10 0 10 4 10 10 10 0 4 4 4 4 4 4 80 0 10 4 "
"12 10 10 10 10 10 10 10 10 0 10 10 10 10 10 30 30 30 10 10 10 0 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 10 20 10 30 30 30 30 30 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 0 0 0 0 30 0 0 0 0 0 0 0 10 0 0 0 0 0 10 0 0 0 0 0 10 0 10 0 10 0 0 0 0 0 0 0 0 0 10 0 10 10 0 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 0 30 30 30 0 0 0 0 0 0 0 0 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 10 10 30 0 10 0 0 0 0 0 0 0 0 0 12 10 10 0 10 0 30 10 20 30 30 0 0 10 10 10 10 10 10 0 10 10 "
"0 10 10 10 10 10 10 10 10 0 0 0 0 0 0 10 10 10 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 10 10 0 10 10 10 0 0 0 0 0 0 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 0 10 10 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 10 10 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 10 10 10 10 0 0 10 0 0 0 0 0 0 0 10 "
"0 10 10 10 10 10 10 10 10 0 0 0 0 0 0 10 10 10 10 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 10 10 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 10 10 0 0 0 10 10 10 10 10 0 0 10 10 10 10 10 0 0 10 10 "
"0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 "
"10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 10 10 10 10 10 0 8 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 20 0 0 0 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 20 20 0 0 0 0 0 0 0 0 0 0 0 0 8 0 0 0 0 0 0 0 0 0 10 10 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 0 10 0 10 0 10 10 10 10 10 0 0 10 10 10 10 10 0 8 10 10 "
"10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 10 10 10 10 10 30 10 30 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 30 0 0 0 0 0 10 10 10 10 10 10 10 10 10 10 30 30 0 0 0 30 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 10 10 30 30 30 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 10 10 10 0 0 0 0 0 0 0 0 30 30 30 30 30 30 0 0 0 0 0 0 0 0 0 0 0 30 30 10 0 0 0 0 0 0 0 0 0 0 0 0 10 10 0 10 0 10 10 10 10 10 0 0 10 10 10 10 10 30 10 10 10 "
"30 0 0 0 0 0 0 0 0 0 5 5 5 5 5 0 0 0 0 10 5 0 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5 0 0 0 0 0 0 0 0 0 0 0 0 0 10 10 5 5 5 5 5 5 5 5 5 5 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 5 0 0 0 0 0 0 0 0 0 0 0 5 0 0 0 0 5 5 5 5 5 5 5 5 5 5 5 5 5 5 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 5 5 5 5 5 5 5 5 5 0 0 0 0 0 0 0 0 5 5 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 5 0 0 0 "
"30 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 "
"12 10 10 10 10 10 10 10 10 0 0 20 0 20 20 10 10 10 10 10 20 10 20 20 20 20 20 20 20 20 20 20 100 20 10 20 20 20 20 20 20 20 20 20 20 0 0 0 0 0 10 10 10 10 10 10 10 10 10 10 20 20 20 20 20 20 20 20 20 20 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 10 10 10 10 0 10 0 0 0 10 0 10 10 0 0 10 0 10 0 0 0 10 0 0 0 0 0 0 0 0 0 0 10 10 10 0 20 20 20 10 20 20 20 20 20 20 20 20 20 20 10 0 0 0 0 0 0 0 0 0 10 10 10 0 0 10 0 0 10 0 0 20 20 20 20 20 20 20 20 20 0 0 0 0 0 0 0 10 20 20 10 0 0 0 0 10 0 0 0 0 0 0 12 10 10 25 10 0 10 10 10 10 10 0 0 10 10 10 10 10 20 0 10 10 "
"12 10 10 10 10 10 10 10 10 0 0 20 0 20 20 10 10 10 10 10 20 10 20 20 20 20 20 20 20 20 20 20 100 20 10 20 20 20 20 20 20 20 20 20 20 0 0 0 0 0 10 10 10 10 10 10 10 10 10 10 20 20 20 20 20 20 20 20 20 20 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 10 10 10 10 0 10 0 0 0 10 0 10 10 0 0 0 0 10 0 0 0 10 0 0 0 0 0 0 0 0 0 0 10 10 10 0 20 20 20 10 20 20 20 20 20 20 20 20 20 20 10 0 0 0 0 0 0 0 0 0 10 10 10 0 0 10 0 0 0 0 0 20 20 20 20 20 20 20 20 20 0 0 0 0 0 0 0 10 20 20 10 0 0 0 0 10 0 0 0 0 0 0 12 10 10 25 10 0 10 10 10 10 10 0 0 10 10 10 10 10 20 0 10 10 "
"0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 5 0 5 5 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 "
"0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 "
"0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 10 0 10 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 "
"30 10 10 10 10 10 10 10 10 4 0 0 0 0 0 10 10 10 4 10 20 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 10 4 0 4 0 0 4 10 4 10 10 10 4 10 10 10 80 80 10 10 10 10 0 0 0 0 0 0 4 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 4 0 0 0 0 0 0 0 0 0 0 0 4 4 4 20 80 80 80 10 0 0 0 0 0 0 10 10 0 10 0 0 0 0 0 0 0 0 0 10 10 10 0 0 0 0 0 0 0 0 80 80 80 80 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 10 0 0 0 0 0 0 0 30 10 10 25 10 0 10 4 10 10 10 0 4 4 4 4 4 4 80 0 10 4 "
"12 10 10 10 10 10 10 10 10 0 0 0 0 0 0 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 10 10 10 10 10 10 10 10 10 10 80 80 0 0 10 10 10 0 0 10 0 0 0 0 0 0 0 0 0 0 10 10 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 20 80 80 80 10 0 10 10 0 10 10 10 0 0 10 0 0 0 0 0 0 0 0 0 10 10 10 0 0 10 0 0 0 0 0 80 80 80 80 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 10 0 0 0 0 0 0 12 10 10 25 10 0 10 10 10 10 10 0 0 10 10 10 10 10 80 0 10 10 "
"30 10 10 10 10 10 10 10 10 4 0 0 0 0 0 10 10 10 4 10 20 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 4 0 4 0 0 4 10 4 10 10 10 4 10 10 10 80 80 0 0 0 0 0 0 0 0 0 0 4 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 4 0 0 0 0 0 0 0 0 0 0 0 4 4 4 20 80 80 80 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 10 10 10 0 0 0 0 0 0 0 0 80 80 80 80 80 80 0 0 0 10 0 0 0 0 10 0 0 0 0 10 0 0 0 10 0 0 0 0 0 0 0 30 10 10 25 10 0 10 4 10 10 10 0 4 4 4 4 4 4 80 0 10 4 "
"10 10 10 10 10 10 10 10 10 4 0 0 0 0 0 10 10 10 4 10 20 0 0 0 0 0 0 0 0 0 0 10 10 10 0 10 10 10 10 10 10 10 10 0 10 4 10 4 0 0 4 10 4 10 10 10 4 10 10 10 80 80 10 10 10 10 0 0 0 0 10 0 4 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 4 0 0 0 0 0 0 0 0 0 0 0 4 4 4 10 10 80 80 10 0 0 0 0 0 0 10 10 0 10 10 10 10 0 0 0 0 0 0 10 10 10 0 0 10 10 10 0 0 0 80 80 80 80 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 10 0 0 0 0 0 0 0 10 10 10 5 10 0 10 4 10 10 10 0 4 4 4 4 4 4 80 0 10 4 "
"12 10 10 10 10 10 5 5 5 0 10 10 10 10 10 5 5 5 10 10 10 0 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 5 5 10 10 10 10 30 30 10 10 10 10 10 10 10 10 10 10 0 10 0 0 0 0 0 0 0 0 0 0 0 0 30 0 0 0 0 0 0 0 10 0 0 0 0 0 10 0 0 0 0 0 10 0 10 0 10 0 10 0 0 0 0 0 10 0 10 0 10 10 0 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 0 30 30 30 0 0 0 0 0 0 0 0 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 10 10 30 0 0 0 0 0 0 0 0 0 10 0 12 10 10 0 10 0 30 10 20 30 30 0 0 10 10 10 10 10 10 0 10 10 "
"12 10 10 10 10 10 10 10 10 0 10 10 10 10 10 30 30 30 10 10 10 0 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 10 20 10 30 30 30 30 30 10 10 10 10 10 10 10 10 10 10 0 10 0 0 0 0 0 0 0 0 0 0 0 0 30 0 0 0 0 0 0 0 10 0 0 0 0 0 10 0 0 0 0 0 10 0 10 0 10 0 0 0 0 0 0 0 10 0 10 0 10 10 0 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 0 30 30 30 0 0 0 0 0 0 0 0 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 10 10 30 0 0 0 0 0 0 0 0 0 0 0 12 10 10 0 10 0 30 10 20 30 30 0 0 10 10 10 10 10 10 0 10 10 "
"12 10 10 10 10 10 10 10 10 0 10 10 10 10 10 30 30 30 10 10 10 0 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 10 20 10 30 30 30 30 30 10 10 10 10 10 10 10 10 10 10 0 10 0 0 0 0 0 0 0 0 0 0 0 0 30 0 0 0 0 0 0 0 10 0 0 0 0 0 10 0 0 0 0 0 10 0 10 0 10 0 0 0 0 0 0 0 10 10 10 0 10 10 0 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 0 30 30 30 0 0 0 0 0 0 0 0 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 10 10 30 0 0 0 0 0 0 0 0 0 0 0 12 10 10 0 10 0 30 10 20 30 30 0 0 10 10 10 10 10 10 0 10 10 "
"12 10 10 10 10 10 10 10 10 0 10 10 10 10 10 10 10 10 10 10 10 0 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 10 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 10 0 0 0 0 0 10 0 0 0 0 0 10 0 10 0 10 0 0 10 10 10 0 10 10 0 10 0 10 10 0 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 0 10 10 10 0 0 0 0 0 0 0 0 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 10 10 10 0 0 0 0 0 0 0 0 0 0 0 12 10 10 25 10 0 10 10 10 10 10 0 0 10 10 10 10 10 10 0 10 10 "
"12 10 10 10 10 10 10 10 10 0 10 10 10 10 10 10 10 10 10 10 10 0 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 10 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 10 0 0 0 0 0 10 0 0 0 0 0 10 0 10 0 10 0 0 0 0 0 0 0 0 0 10 0 10 10 0 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 0 10 10 10 0 0 0 0 0 0 0 0 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 10 10 10 0 0 0 0 0 0 0 0 0 0 0 12 10 10 25 10 0 10 10 10 10 10 0 0 10 10 10 10 10 10 0 10 10 "
"12 10 10 10 10 10 10 10 10 0 0 0 0 0 0 10 10 10 10 10 10 0 10 10 10 10 10 10 10 10 100 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 10 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 10 0 0 0 0 0 10 0 0 0 0 0 10 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 0 10 10 10 0 0 0 0 0 0 0 0 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 10 10 10 0 0 0 0 0 0 0 0 10 0 0 12 10 10 25 10 0 10 10 10 10 10 0 0 10 10 10 10 10 10 0 10 10 "
"12 8 8 8 8 8 8 8 8 0 0 0 0 0 0 8 8 8 10 10 20 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 10 10 0 0 0 0 0 0 0 0 0 8 8 10 8 8 8 10 10 10 10 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 10 80 80 80 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 8 8 8 0 0 0 0 0 0 0 0 80 80 80 80 80 80 0 0 0 0 0 0 0 0 0 0 0 0 0 8 0 0 0 0 0 0 0 0 0 0 0 12 10 10 25 10 0 8 8 8 8 8 0 0 8 10 10 10 10 80 0 10 10 "
"12 10 10 10 10 10 10 10 10 0 20 20 20 20 20 10 10 10 10 10 20 0 20 20 20 20 20 20 20 20 20 20 20 20 10 20 20 20 20 20 20 20 20 20 20 0 0 0 0 0 10 10 10 10 10 10 10 10 10 10 20 20 20 20 20 20 20 20 20 20 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 20 0 10 0 0 0 0 0 0 0 0 0 20 0 10 10 0 20 20 20 10 20 20 20 20 20 20 20 20 20 20 10 0 0 0 0 0 0 0 0 0 10 10 10 0 0 0 0 0 0 0 0 20 20 20 20 20 20 20 20 20 0 0 0 0 0 0 0 0 20 20 10 0 0 0 0 0 0 0 0 0 0 0 12 10 10 5 10 0 10 10 10 10 10 0 0 10 10 10 10 10 20 0 10 10 "
"0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 10 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 10 "
"0 0 0 10 10 10 10 10 10 0 0 0 0 0 0 10 10 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 10 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 10 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 "
"0 10 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 "
"0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 10 11 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 11 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 11 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 10 10 10 0 0 0 11 0 12 12 12 0 0 0 11 "
"12 10 10 10 10 10 5 5 5 0 10 10 10 10 10 5 5 5 10 10 10 0 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 5 5 10 30 30 30 30 30 10 10 10 10 10 10 10 10 10 10 0 10 0 0 0 0 0 0 0 0 0 0 0 0 30 0 0 0 0 0 0 0 10 0 0 0 0 10 10 0 0 0 0 0 10 0 10 0 10 0 10 0 0 0 0 0 10 10 10 0 10 10 0 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 0 30 30 30 0 0 0 0 0 0 0 0 10 10 10 10 10 10 10 10 10 0 0 0 0 0 0 0 0 10 10 30 0 0 0 0 0 0 0 0 0 10 0 12 10 10 0 10 0 30 10 20 30 30 0 0 10 10 10 10 10 10 0 10 10 ";
*/

char *table_string = "1718\n"
"0 0 0 0 0 0 *\n"
"1 1 3 0 18 1 よい\n"
"1 1 3 0 18 1 良い\n"
"1 2 3 0 18 1 ない\n"
"21 3 2 0 10 1 ある\n"
"21 6 2 0 1 1 できる\n"
"34 9 6 8 0 0 こと\n"
"1 2 3 0 18 1 ない\n"
"35 10 14 2 0 0 程\n"
"35 10 14 2 0 0 ほど\n"
"35 10 14 2 0 0 間\n"
"35 11 14 2 0 0 前\n"
"35 11 14 2 0 0 後\n"
"35 10 14 2 0 0 程度\n"
"35 10 14 2 0 0 頃\n"
"35 10 14 2 0 0 ころ\n"
"35 10 14 2 0 0 ごろ\n"
"35 12 14 2 0 0 ずつ\n"
"35 10 14 2 0 0 あたり\n"
"35 10 14 2 0 0 当たり\n"
"35 10 14 2 0 0 当り\n"
"35 10 14 2 0 0 辺り\n"
"35 11 14 2 0 0 通り\n"
"35 11 14 2 0 0 どおり\n"
"35 10 14 2 0 0 上\n"
"35 11 14 2 0 0 中\n"
"35 10 14 2 0 0 下\n"
"36 10 14 2 0 0 以上\n"
"35 10 14 2 0 0 以下\n"
"35 10 14 2 0 0 未満\n"
"36 10 14 2 0 0 近く\n"
"35 10 14 2 0 0 ちかく\n"
"35 13 14 2 0 0 以外\n"
"35 14 14 2 0 0 自体\n"
"35 10 14 2 0 0 その他\n"
"21 15 2 0 16 1 する\n"
"43 18 13 1 0 0 同\n"
"45 20 9 2 0 0 は\n"
"46 21 10 0 0 0 しかも\n"
"47 22 9 3 0 0 の\n"
"48 23 9 3 0 0 と\n"
"49 24 9 3 0 0 や\n"
"50 25 9 3 0 0 および\n"
"50 25 9 3 0 0 及び\n"
"51 25 9 3 0 0 ならびに\n"
"52 26 9 3 0 0 も\n"
"53 26 9 3 0 0 やら\n"
"53 26 9 3 0 0 だの\n"
"54 27 9 3 0 0 に\n"
"55 28 9 3 0 0 か\n"
"50 29 9 3 0 0 かも\n"
"56 30 9 3 0 0 なり\n"
"57 31 9 3 0 0 または\n"
"57 31 9 3 0 0 又は\n"
"50 31 9 3 0 0 また\n"
"50 31 9 3 0 0 又\n"
"50 31 9 3 0 0 かつ\n"
"50 31 9 3 0 0 かつまた\n"
"50 31 9 3 0 0 もしくは\n"
"50 31 9 3 0 0 若しくは\n"
"50 31 9 3 0 0 あるいは\n"
"50 31 9 3 0 0 或いは\n"
"50 32 9 3 0 0 ないし\n"
"50 33 9 3 0 0 ないしは\n"
"58 31 9 3 0 0 そして\n"
"50 31 9 3 0 0 それとも\n"
"59 34 9 3 0 0 ながら\n"
"60 35 9 4 0 0 さ\n"
"60 35 9 4 0 0 さあ\n"
"61 36 9 4 0 0 か\n"
"62 37 9 4 0 0 かしら\n"
"60 38 9 4 0 0 ね\n"
"60 38 9 4 0 0 ネ\n"
"60 38 9 4 0 0 ねえ\n"
"60 38 9 4 0 0 ねぇ\n"
"63 39 9 4 0 0 よ\n"
"63 39 9 4 0 0 ヨ\n"
"62 40 9 4 0 0 やろ\n"
"60 41 9 4 0 0 なあ\n"
"60 41 9 4 0 0 なぁ\n"
"63 42 9 4 0 0 かい\n"
"21 43 5 0 19 1 らしい\n"
"65 43 5 0 21 1 みたいだ\n"
"84 44 9 2 0 0 って\n"
"85 45 6 8 0 0 もの\n"
"85 45 6 8 0 0 もん\n"
"86 46 9 3 0 0 が\n"
"87 47 6 9 0 0 ため\n"
"87 47 6 9 0 0 為\n"
"87 47 6 9 0 0 あまり\n"
"87 47 6 9 0 0 ゆえ\n"
"87 47 6 9 0 0 故\n"
"88 10 14 2 0 0 化\n"
"89 48 14 3 0 0 倍\n"
"89 48 14 3 0 0 戦\n"
"89 49 14 3 0 0 勝\n"
"89 48 14 3 0 0 敗\n"
"89 48 14 3 0 0 泊\n"
"88 10 14 2 0 0 入り\n"
"88 10 14 2 0 0 あけ\n"
"21 15 2 0 16 1 する\n"
"21 6 2 0 1 1 できる\n"
"21 15 2 0 1 1 出来る\n"
"21 15 2 0 5 1 いたす\n"
"21 15 2 0 5 1 致す\n"
"90 50 3 0 21 1 可能だ\n"
"90 50 3 0 21 1 不可能だ\n"
"91 52 6 1 0 0 御覧\n"
"91 52 6 1 0 0 ご覧\n"
"91 52 6 1 0 0 ごらん\n"
"21 53 2 0 11 1 下さる\n"
"94 56 7 1 0 0 ここ\n"
"95 10 14 2 0 0 的\n"
"96 57 11 0 0 0 何たる\n"
"96 57 11 0 0 0 なんたる\n"
"21 43 5 0 19 1 らしい\n"
"65 43 5 0 21 1 みたいだ\n"
"98 18 13 1 0 0 準\n"
"99 59 1 5 0 0 々\n"
"100 60 9 1 0 0 まで\n"
"101 61 9 1 0 0 から\n"
"102 62 9 2 0 0 だけ\n"
"103 63 9 2 0 0 ばかり\n"
"103 63 9 2 0 0 ばっかり\n"
"103 63 9 2 0 0 ばっか\n"
"104 64 9 2 0 0 のみ\n"
"105 65 9 2 0 0 など\n"
"106 66 9 2 0 0 なんか\n"
"107 67 9 2 0 0 くらい\n"
"107 67 9 2 0 0 ぐらい\n"
"107 68 9 2 0 0 位\n"
"108 69 9 2 0 0 も\n"
"109 70 9 3 0 0 から\n"
"65 71 5 0 21 1 のだ\n"
"111 18 13 1 0 0 御\n"
"112 18 13 1 0 0 お\n"
"113 18 13 1 0 0 大\n"
"113 18 13 1 0 0 おお\n"
"113 18 13 1 0 0 初\n"
"113 18 13 1 0 0 総\n"
"113 18 13 1 0 0 ひと\n"
"111 18 13 1 0 0 ご\n"
"114 18 13 1 0 0 元\n"
"114 18 13 1 0 0 前\n"
"115 18 13 1 0 0 超\n"
"116 18 13 1 0 0 まる\n"
"117 18 13 1 0 0 全\n"
"118 18 13 1 0 0 故\n"
"119 18 13 1 0 0 真っ\n"
"119 18 13 1 0 0 まっ\n"
"87 72 6 9 0 0 最中\n"
"87 72 6 9 0 0 さいちゅう\n"
"21 73 14 7 1 1 れる\n"
"21 74 14 7 1 1 せる\n"
"21 74 14 7 5 1 す\n"
"21 73 14 7 1 1 れる\n"
"21 75 14 7 1 1 られる\n"
"21 76 14 7 1 1 させる\n"
"21 76 14 7 5 1 さす\n"
"21 75 14 7 1 1 られる\n"
"21 73 14 7 1 1 れる\n"
"21 77 14 7 1 1 しめる\n"
"21 78 14 7 1 1 いる\n"
"21 79 14 7 1 1 る\n"
"21 79 14 7 1 1 みる\n"
"21 79 14 7 14 1 くる\n"
"21 79 14 7 15 1 来る\n"
"21 79 14 7 2 1 おく\n"
"21 79 14 7 10 1 ある\n"
"21 79 14 7 10 1 おる\n"
"21 79 14 7 10 1 居る\n"
"21 79 14 7 3 1 いく\n"
"21 79 14 7 1 1 いける\n"
"21 79 14 7 1 1 くれる\n"
"21 79 14 7 12 1 もらう\n"
"21 79 14 7 12 1 しまう\n"
"21 79 14 7 11 1 下さる\n"
"21 79 14 7 11 1 くださる\n"
"21 80 14 7 16 1 する\n"
"21 81 14 7 10 1 なる\n"
"124 82 12 0 0 0 ありがとう\n"
"124 82 12 0 0 0 おめでとう\n"
"124 82 12 0 0 0 おはよう\n"
"21 83 14 7 31 1 御座います\n"
"21 83 14 7 31 1 ございます\n"
"21 84 14 7 31 1 存じます\n"
"21 84 14 7 31 1 ぞんじます\n"
"21 85 14 7 32 1 うる\n"
"21 85 14 7 33 1 得る\n"
"21 86 14 7 31 1 ます\n"
"21 86 14 7 11 1 なさる\n"
"21 86 14 7 31 1 ます\n"
"21 87 14 7 10 1 かかる\n"
"21 87 14 7 10 1 掛かる\n"
"21 87 14 7 10 1 掛る\n"
"21 87 14 7 1 1 かける\n"
"21 87 14 7 1 1 掛ける\n"
"21 87 14 7 1 1 かねる\n"
"21 87 14 7 1 1 兼ねる\n"
"21 87 14 7 9 1 あぐむ\n"
"21 87 14 7 1 1 あぐねる\n"
"21 87 14 7 1 1 そびれる\n"
"21 88 14 7 1 1 すぎる\n"
"21 88 14 7 1 1 過ぎる\n"
"21 89 14 7 10 1 がる\n"
"21 90 14 7 2 1 めく\n"
"21 90 14 7 10 1 がかる\n"
"21 90 14 7 1 1 じみる\n"
"21 90 14 7 1 1 染みる\n"
"21 91 14 7 12 1 う\n"
"21 92 14 7 2 1 とく\n"
"21 92 14 7 12 1 ちまう\n"
"21 93 14 7 2 1 どく\n"
"21 93 14 7 12 1 じまう\n"
"21 94 14 7 10 1 やがる\n"
"21 95 14 7 10 1 る\n"
"128 96 14 6 18 1 っぽい\n"
"128 94 14 5 18 1 たい\n"
"128 87 14 5 18 1 やすい\n"
"128 87 14 5 18 1 易い\n"
"128 87 14 5 18 1 よい\n"
"128 87 14 5 18 1 にくい\n"
"128 87 14 5 18 1 がたい\n"
"128 87 14 5 18 1 難い\n"
"128 87 14 5 18 1 づらい\n"
"90 87 14 5 22 1 がちだ\n"
"90 87 14 5 22 1 気味だ\n"
"90 87 14 5 22 1 ぎみだ\n"
"131 97 14 5 21 1 そうだ\n"
"128 94 14 5 18 1 たい\n"
"133 99 14 1 0 0 さ\n"
"131 97 14 5 21 1 そうだ\n"
"134 87 14 1 0 0 っこ\n"
"128 100 14 5 18 1 ない\n"
"90 101 14 5 22 1 めだ\n"
"135 99 14 5 22 1 目だ\n"
"90 101 14 5 22 1 めだ\n"
"135 99 14 5 22 1 目だ\n"
"90 102 14 6 21 1 的だ\n"
"90 103 14 5 22 1 気だ\n"
"90 103 14 5 22 1 げだ\n"
"128 95 14 6 18 1 い\n"
"136 98 9 0 0 0 か\n"
"137 104 14 2 0 0 ども\n"
"138 105 14 4 0 0 半\n"
"139 52 6 1 0 0 半数\n"
"139 52 6 1 0 0 半分\n"
"140 106 6 10 0 0 半日\n"
"140 106 6 10 0 0 半月\n"
"140 106 6 10 0 0 半年\n"
"141 107 14 3 0 0 台\n"
"141 107 14 3 0 0 号\n"
"141 107 14 3 0 0 連続\n"
"142 107 14 3 0 0 分\n"
"141 107 14 3 0 0 単位\n"
"141 107 14 3 0 0 余り\n"
"141 107 14 3 0 0 余\n"
"141 107 14 3 0 0 あまり\n"
"142 108 14 3 0 0 時\n"
"143 52 6 1 0 0 最多\n"
"144 105 14 4 0 0 超\n"
"144 105 14 4 0 0 以内\n"
"144 105 14 4 0 0 強\n"
"144 105 14 4 0 0 弱\n"
"144 105 14 4 0 0 増\n"
"144 105 14 4 0 0 減\n"
"144 105 14 4 0 0 がかり\n"
"144 109 14 4 0 0 限り\n"
"145 48 14 3 0 0 年度\n"
"145 48 14 3 0 0 年\n"
"145 48 14 3 0 0 月\n"
"144 110 14 4 0 0 暮れ\n"
"146 48 14 3 0 0 世紀\n"
"146 48 14 3 0 0 週\n"
"144 111 14 4 0 0 末\n"
"147 48 14 3 0 0 日\n"
"148 106 6 10 0 0 元日\n"
"144 112 14 4 0 0 付\n"
"142 48 14 3 0 0 秒\n"
"142 48 14 3 0 0 キロ\n"
"144 113 14 4 0 0 過ぎ\n"
"144 113 14 4 0 0 すぎ\n"
"144 114 14 4 0 0 以降\n"
"144 114 14 4 0 0 以来\n"
"144 114 14 4 0 0 以後\n"
"144 114 14 4 0 0 以前\n"
"149 11 14 2 0 0 目\n"
"149 10 14 2 0 0 戦\n"
"144 115 14 4 0 0 都\n"
"144 115 14 4 0 0 府\n"
"144 115 14 4 0 0 県\n"
"144 115 14 4 0 0 郡\n"
"144 115 14 4 0 0 市\n"
"144 115 14 4 0 0 村\n"
"144 115 14 4 0 0 町\n"
"144 115 14 4 0 0 区\n"
"144 115 14 4 0 0 州\n"
"144 115 14 4 0 0 省\n"
"150 99 14 1 0 0 め\n"
"150 103 14 1 0 0 み\n"
"150 103 14 1 0 0 味\n"
"137 116 14 2 0 0 そのもの\n"
"150 87 14 1 0 0 かた\n"
"150 87 14 1 0 0 方\n"
"150 87 14 1 0 0 手\n"
"150 87 14 1 0 0 たて\n"
"150 87 14 1 0 0 ぶり\n"
"150 87 14 1 0 0 っぷり\n"
"150 87 14 1 0 0 よう\n"
"150 87 14 1 0 0 様\n"
"150 87 14 1 0 0 がい\n"
"150 87 14 1 0 0 さし\n"
"150 87 14 1 0 0 止し\n"
"150 117 14 1 0 0 放題\n"
"150 117 14 1 0 0 ほうだい\n"
"150 88 14 1 0 0 そう\n"
"151 118 6 7 0 0 数\n"
"151 118 6 7 0 0 すう\n"
"151 118 6 7 0 0 何\n"
"151 118 6 7 0 0 なん\n"
"151 118 6 7 0 0 幾\n"
"152 118 6 7 0 0 いく\n"
"153 119 6 7 0 0 十\n"
"153 119 6 7 0 0 百\n"
"153 119 6 7 0 0 千\n"
"153 119 6 7 0 0 万\n"
"153 119 6 7 0 0 億\n"
"153 119 6 7 0 0 兆\n"
"154 120 6 7 0 0 分の\n"
"154 120 6 7 0 0 ??\n"
"155 121 9 1 0 0 と\n"
"155 122 9 1 0 0 っと\n"
"156 123 9 1 0 0 を\n"
"157 124 9 1 0 0 に\n"
"158 125 9 2 0 0 なんて\n"
"159 126 9 2 0 0 でも\n"
"160 127 9 2 0 0 さえ\n"
"161 128 9 2 0 0 すら\n"
"162 129 9 2 0 0 まで\n"
"158 130 9 2 0 0 しか\n"
"163 131 9 2 0 0 こそ\n"
"158 132 9 2 0 0 なんぞ\n"
"164 133 9 2 0 0 どころ\n"
"165 134 9 2 0 0 とて\n"
"166 135 8 0 0 0 幾ら\n"
"166 135 8 0 0 0 いくら\n"
"167 136 9 3 0 0 し\n"
"168 82 12 0 0 0 すみません\n"
"168 82 12 0 0 0 すいません\n"
"169 137 9 3 0 0 なら\n"
"167 138 9 3 0 0 けど\n"
"167 138 9 3 0 0 けども\n"
"167 138 9 3 0 0 けれど\n"
"167 138 9 3 0 0 けれども\n"
"170 139 9 3 0 0 まで\n"
"171 140 9 3 0 0 より\n"
"172 141 9 3 0 0 まま\n"
"173 56 7 1 0 0 これ\n"
"173 56 7 1 0 0 それ\n"
"173 56 7 1 0 0 あれ\n"
"174 142 9 3 0 0 きり\n"
"174 142 9 3 0 0 っきり\n"
"175 87 9 3 0 0 つつ\n"
"176 143 9 3 0 0 やいなや\n"
"167 144 9 3 0 0 ど\n"
"167 144 9 3 0 0 ども\n"
"21 145 2 0 12 1 思う\n"
"22 145 2 0 12 2 思う\n"
"23 146 2 0 12 3 思う\n"
"24 145 2 0 12 4 思う\n"
"25 145 2 0 12 5 思う\n"
"26 145 2 0 12 6 思う\n"
"6 145 2 0 12 7 思う\n"
"177 147 2 0 12 8 思う\n"
"28 145 2 0 12 9 思う\n"
"29 145 2 0 12 10 思う\n"
"9 145 2 0 12 11 思う\n"
"5 145 2 0 12 12 思う\n"
"10 145 2 0 12 13 思う\n"
"30 145 2 0 12 14 思う\n"
"12 145 2 0 12 15 思う\n"
"31 145 2 0 12 16 思う\n"
"50 148 9 3 0 0 きや\n"
"21 149 5 0 26 1 です\n"
"178 149 5 0 26 2 です\n"
"179 150 9 4 0 0 な\n"
"60 151 9 4 0 0 ぞ\n"
"60 151 9 4 0 0 ぜ\n"
"60 152 9 4 0 0 で\n"
"180 151 9 4 0 0 わ\n"
"181 152 9 4 0 0 ねん\n"
"21 153 5 0 26 1 まい\n"
"182 153 5 0 26 2 まい\n"
"183 154 9 4 0 0 っけ\n"
"60 155 9 4 0 0 *\n"
"184 156 9 1 0 0 が\n"
"185 157 9 1 0 0 で\n"
"186 158 9 1 0 0 へ\n"
"187 159 9 1 0 0 より\n"
"188 160 9 1 0 0 の\n"
"184 161 9 1 0 0 にて\n"
"158 162 9 2 0 0 なら\n"
"158 163 9 2 0 0 ったら\n"
"189 163 9 2 0 0 じゃ\n"
"190 164 9 2 0 0 だって\n"
"62 98 9 4 0 0 や\n"
"191 98 9 3 0 0 のみならず\n"
"192 98 9 3 0 0 とどうじに\n"
"193 165 5 0 25 1 はずだ\n"
"65 165 5 0 22 1 ばかりだ\n"
"65 165 5 0 22 1 ばっかりだ\n"
"65 165 5 0 22 1 ばっかだ\n"
"65 165 5 0 21 1 ようだ\n"
"65 165 5 0 21 1 ふうだ\n"
"65 71 5 0 21 1 のだ\n"
"65 71 5 0 21 1 わけだ\n"
"65 166 5 0 21 1 んだ\n"
"21 167 5 0 26 1 ことだ\n"
"197 167 5 0 26 2 ことだ\n"
"193 167 5 0 25 1 つもりだ\n"
"21 43 5 0 19 1 らしい\n"
"65 43 5 0 21 1 みたいだ\n"
"21 149 5 0 26 1 です\n"
"65 168 5 0 29 1 そうだ\n"
"65 169 5 0 21 1 べきだ\n"
"201 169 5 0 30 1 べし\n"
"201 170 5 0 30 1 ごとし\n"
"201 170 5 0 30 1 如し\n"
"21 153 5 0 26 1 まい\n"
"21 171 5 0 27 1 ぬ\n"
"21 43 5 0 19 1 らしい\n"
"65 43 5 0 21 1 みたいだ\n"
"137 11 14 2 0 0 率\n"
"137 11 14 2 0 0 数\n"
"137 11 14 2 0 0 なし\n"
"137 11 14 2 0 0 どころ\n"
"137 11 14 2 0 0 ごと\n"
"137 11 14 2 0 0 側\n"
"137 11 14 2 0 0 用\n"
"137 11 14 2 0 0 作り\n"
"137 11 14 2 0 0 づくり\n"
"137 11 14 2 0 0 型\n"
"137 11 14 2 0 0 さん\n"
"21 173 4 0 25 1 だ\n"
"21 145 2 0 1 1 でる\n"
"21 176 999 0 0 0 にも\n"
"213 10 14 2 0 0 前後\n"
"21 177 999 0 0 0 もの\n"
"21 178 999 0 0 0 やに\n"
"21 178 999 0 0 0 やも\n"
"214 98 999 0 0 0 のに\n"
"21 179 999 0 0 0 へんで\n"
"21 98 999 0 3 1 おいく\n"
"21 98 999 0 1 1 おくれる\n"
"21 98 999 0 12 1 おもらう\n"
"21 98 999 0 12 1 おしまう\n"
"21 79 999 0 1 1 はいる\n"
"21 79 999 0 1 1 もいる\n"
"21 79 999 0 1 1 すらいる\n"
"21 79 999 0 1 1 さえいる\n"
"21 79 999 0 1 1 はみる\n"
"21 79 999 0 1 1 もみる\n"
"21 79 999 0 1 1 すらみる\n"
"21 79 999 0 1 1 さえみる\n"
"21 79 999 0 14 1 はくる\n"
"21 79 999 0 14 1 もくる\n"
"21 79 999 0 14 1 すらくる\n"
"21 79 999 0 14 1 さえくる\n"
"21 79 999 0 2 1 はおく\n"
"21 79 999 0 2 1 もおく\n"
"21 79 999 0 2 1 すらおく\n"
"21 79 999 0 2 1 さえおく\n"
"21 79 999 0 10 1 はおる\n"
"21 79 999 0 10 1 もおる\n"
"21 79 999 0 10 1 すらおる\n"
"21 79 999 0 10 1 さえおる\n"
"21 79 999 0 3 1 はいく\n"
"21 79 999 0 3 1 もいく\n"
"21 79 999 0 3 1 すらいく\n"
"21 79 999 0 3 1 さえいく\n"
"21 79 999 0 1 1 はくれる\n"
"21 79 999 0 1 1 もくれる\n"
"21 79 999 0 1 1 すらくれる\n"
"21 79 999 0 1 1 さえくれる\n"
"21 79 999 0 12 1 はもらう\n"
"21 79 999 0 12 1 ももらう\n"
"21 79 999 0 12 1 すらもらう\n"
"21 79 999 0 12 1 さえもらう\n"
"21 180 999 0 16 1 はする\n"
"21 180 999 0 16 1 もする\n"
"21 180 999 0 16 1 すらする\n"
"21 180 999 0 16 1 さえする\n"
"21 81 999 0 10 1 はなる\n"
"21 81 999 0 10 1 もなる\n"
"21 81 999 0 10 1 すらなる\n"
"21 81 999 0 10 1 さえなる\n"
"21 181 999 0 18 1 はない\n"
"21 181 999 0 18 1 もない\n"
"21 181 999 0 18 1 すらない\n"
"21 181 999 0 18 1 さえない\n"
"21 182 999 0 10 1 はある\n"
"21 182 999 0 10 1 もある\n"
"21 182 999 0 10 1 すらある\n"
"21 182 999 0 10 1 さえある\n"
"21 183 999 0 18 1 ではない\n"
"21 183 999 0 18 1 じゃない\n"
"21 183 999 0 18 1 でもない\n"
"21 98 999 0 12 1 とはいえ\n"
"21 184 999 0 18 1 ならない\n"
"21 185 999 0 18 1 しようがない\n"
"216 186 1 0 0 0 *\n"
"217 187 1 1 0 0 *\n"
"218 188 1 2 0 0 *\n"
"44 189 1 3 0 0 *\n"
"219 190 1 4 0 0 *\n"
"99 191 1 5 0 0 *\n"
"220 192 1 6 0 0 *\n"
"21 145 2 0 1 1 *\n"
"22 145 2 0 1 2 *\n"
"32 146 2 0 1 3 *\n"
"24 145 2 0 1 4 *\n"
"25 145 2 0 1 5 *\n"
"3 145 2 0 1 6 *\n"
"6 145 2 0 1 7 *\n"
"33 147 2 0 1 8 *\n"
"28 145 2 0 1 9 *\n"
"29 145 2 0 1 10 *\n"
"9 145 2 0 1 11 *\n"
"5 145 2 0 1 12 *\n"
"10 145 2 0 1 13 *\n"
"30 145 2 0 1 14 *\n"
"12 145 2 0 1 15 *\n"
"31 145 2 0 1 16 *\n"
"15 145 2 0 1 17 *\n"
"20 145 2 0 1 18 *\n"
"21 145 2 0 2 1 *\n"
"22 145 2 0 2 2 *\n"
"23 146 2 0 2 3 *\n"
"24 145 2 0 2 4 *\n"
"25 145 2 0 2 5 *\n"
"26 145 2 0 2 6 *\n"
"6 145 2 0 2 7 *\n"
"27 147 2 0 2 8 *\n"
"28 145 2 0 2 9 *\n"
"29 145 2 0 2 10 *\n"
"9 145 2 0 2 11 *\n"
"5 145 2 0 2 12 *\n"
"10 145 2 0 2 13 *\n"
"30 145 2 0 2 14 *\n"
"12 145 2 0 2 15 *\n"
"31 145 2 0 2 16 *\n"
"15 145 2 0 2 17 *\n"
"21 145 2 0 3 1 *\n"
"22 145 2 0 3 2 *\n"
"23 146 2 0 3 3 *\n"
"24 145 2 0 3 4 *\n"
"25 145 2 0 3 5 *\n"
"26 145 2 0 3 6 *\n"
"6 145 2 0 3 7 *\n"
"27 147 2 0 3 8 *\n"
"28 145 2 0 3 9 *\n"
"29 145 2 0 3 10 *\n"
"9 145 2 0 3 11 *\n"
"5 145 2 0 3 12 *\n"
"10 145 2 0 3 13 *\n"
"30 145 2 0 3 14 *\n"
"12 145 2 0 3 15 *\n"
"31 145 2 0 3 16 *\n"
"15 145 2 0 3 17 *\n"
"21 145 2 0 4 1 *\n"
"22 145 2 0 4 2 *\n"
"23 146 2 0 4 3 *\n"
"24 145 2 0 4 4 *\n"
"25 145 2 0 4 5 *\n"
"26 145 2 0 4 6 *\n"
"6 145 2 0 4 7 *\n"
"27 147 2 0 4 8 *\n"
"127 145 2 0 4 9 *\n"
"29 145 2 0 4 10 *\n"
"9 145 2 0 4 11 *\n"
"5 145 2 0 4 12 *\n"
"10 145 2 0 4 13 *\n"
"30 145 2 0 4 14 *\n"
"12 145 2 0 4 15 *\n"
"31 145 2 0 4 16 *\n"
"15 145 2 0 4 17 *\n"
"21 145 2 0 5 1 *\n"
"22 145 2 0 5 2 *\n"
"23 146 2 0 5 3 *\n"
"24 145 2 0 5 4 *\n"
"25 145 2 0 5 5 *\n"
"26 145 2 0 5 6 *\n"
"6 145 2 0 5 7 *\n"
"27 147 2 0 5 8 *\n"
"28 145 2 0 5 9 *\n"
"29 145 2 0 5 10 *\n"
"9 145 2 0 5 11 *\n"
"5 145 2 0 5 12 *\n"
"10 145 2 0 5 13 *\n"
"30 145 2 0 5 14 *\n"
"12 145 2 0 5 15 *\n"
"31 145 2 0 5 16 *\n"
"15 145 2 0 5 17 *\n"
"21 145 2 0 6 1 *\n"
"22 145 2 0 6 2 *\n"
"23 146 2 0 6 3 *\n"
"24 145 2 0 6 4 *\n"
"25 145 2 0 6 5 *\n"
"26 145 2 0 6 6 *\n"
"6 145 2 0 6 7 *\n"
"27 147 2 0 6 8 *\n"
"28 145 2 0 6 9 *\n"
"29 145 2 0 6 10 *\n"
"9 145 2 0 6 11 *\n"
"5 145 2 0 6 12 *\n"
"10 145 2 0 6 13 *\n"
"30 145 2 0 6 14 *\n"
"12 145 2 0 6 15 *\n"
"31 145 2 0 6 16 *\n"
"15 145 2 0 6 17 *\n"
"21 145 2 0 7 1 *\n"
"22 145 2 0 7 2 *\n"
"23 146 2 0 7 3 *\n"
"24 145 2 0 7 4 *\n"
"25 145 2 0 7 5 *\n"
"26 145 2 0 7 6 *\n"
"6 145 2 0 7 7 *\n"
"27 147 2 0 7 8 *\n"
"127 145 2 0 7 9 *\n"
"29 145 2 0 7 10 *\n"
"9 145 2 0 7 11 *\n"
"5 145 2 0 7 12 *\n"
"10 145 2 0 7 13 *\n"
"30 145 2 0 7 14 *\n"
"12 145 2 0 7 15 *\n"
"31 145 2 0 7 16 *\n"
"15 145 2 0 7 17 *\n"
"21 145 2 0 8 1 *\n"
"22 145 2 0 8 2 *\n"
"23 146 2 0 8 3 *\n"
"24 145 2 0 8 4 *\n"
"25 145 2 0 8 5 *\n"
"26 145 2 0 8 6 *\n"
"6 145 2 0 8 7 *\n"
"27 147 2 0 8 8 *\n"
"127 145 2 0 8 9 *\n"
"29 145 2 0 8 10 *\n"
"9 145 2 0 8 11 *\n"
"5 145 2 0 8 12 *\n"
"10 145 2 0 8 13 *\n"
"30 145 2 0 8 14 *\n"
"12 145 2 0 8 15 *\n"
"31 145 2 0 8 16 *\n"
"15 145 2 0 8 17 *\n"
"21 145 2 0 9 1 *\n"
"22 145 2 0 9 2 *\n"
"23 146 2 0 9 3 *\n"
"24 145 2 0 9 4 *\n"
"25 145 2 0 9 5 *\n"
"26 145 2 0 9 6 *\n"
"6 145 2 0 9 7 *\n"
"27 147 2 0 9 8 *\n"
"127 145 2 0 9 9 *\n"
"29 145 2 0 9 10 *\n"
"9 145 2 0 9 11 *\n"
"5 145 2 0 9 12 *\n"
"10 145 2 0 9 13 *\n"
"30 145 2 0 9 14 *\n"
"12 145 2 0 9 15 *\n"
"31 145 2 0 9 16 *\n"
"15 145 2 0 9 17 *\n"
"21 145 2 0 10 1 *\n"
"22 145 2 0 10 2 *\n"
"23 146 2 0 10 3 *\n"
"24 145 2 0 10 4 *\n"
"25 145 2 0 10 5 *\n"
"26 145 2 0 10 6 *\n"
"6 145 2 0 10 7 *\n"
"27 147 2 0 10 8 *\n"
"28 145 2 0 10 9 *\n"
"29 145 2 0 10 10 *\n"
"9 145 2 0 10 11 *\n"
"5 145 2 0 10 12 *\n"
"10 145 2 0 10 13 *\n"
"30 145 2 0 10 14 *\n"
"12 145 2 0 10 15 *\n"
"31 145 2 0 10 16 *\n"
"15 145 2 0 10 17 *\n"
"21 145 2 0 11 1 *\n"
"22 145 2 0 11 2 *\n"
"92 146 2 0 11 3 *\n"
"24 145 2 0 11 4 *\n"
"25 145 2 0 11 5 *\n"
"93 145 2 0 11 6 *\n"
"6 145 2 0 11 7 *\n"
"27 147 2 0 11 8 *\n"
"28 145 2 0 11 9 *\n"
"29 145 2 0 11 10 *\n"
"9 145 2 0 11 11 *\n"
"5 145 2 0 11 12 *\n"
"10 145 2 0 11 13 *\n"
"30 145 2 0 11 14 *\n"
"12 145 2 0 11 15 *\n"
"31 145 2 0 11 16 *\n"
"15 145 2 0 11 17 *\n"
"21 145 2 0 12 1 *\n"
"22 145 2 0 12 2 *\n"
"23 146 2 0 12 3 *\n"
"24 145 2 0 12 4 *\n"
"25 145 2 0 12 5 *\n"
"26 145 2 0 12 6 *\n"
"6 145 2 0 12 7 *\n"
"27 147 2 0 12 8 *\n"
"28 145 2 0 12 9 *\n"
"29 145 2 0 12 10 *\n"
"9 145 2 0 12 11 *\n"
"5 145 2 0 12 12 *\n"
"10 145 2 0 12 13 *\n"
"30 145 2 0 12 14 *\n"
"12 145 2 0 12 15 *\n"
"31 145 2 0 12 16 *\n"
"21 145 2 0 13 1 *\n"
"22 145 2 0 13 2 *\n"
"23 146 2 0 13 3 *\n"
"24 145 2 0 13 4 *\n"
"25 145 2 0 13 5 *\n"
"26 145 2 0 13 6 *\n"
"6 145 2 0 13 7 *\n"
"27 147 2 0 13 8 *\n"
"28 145 2 0 13 9 *\n"
"29 145 2 0 13 10 *\n"
"9 145 2 0 13 11 *\n"
"5 145 2 0 13 12 *\n"
"10 145 2 0 13 13 *\n"
"30 145 2 0 13 14 *\n"
"12 145 2 0 13 15 *\n"
"31 145 2 0 13 16 *\n"
"21 145 2 0 14 1 *\n"
"22 145 2 0 14 2 *\n"
"32 146 2 0 14 3 *\n"
"24 145 2 0 14 4 *\n"
"25 145 2 0 14 5 *\n"
"3 145 2 0 14 6 *\n"
"6 145 2 0 14 7 *\n"
"27 147 2 0 14 8 *\n"
"28 145 2 0 14 9 *\n"
"29 145 2 0 14 10 *\n"
"9 145 2 0 14 11 *\n"
"5 145 2 0 14 12 *\n"
"10 145 2 0 14 13 *\n"
"30 145 2 0 14 14 *\n"
"12 145 2 0 14 15 *\n"
"31 145 2 0 14 16 *\n"
"15 145 2 0 14 17 *\n"
"21 145 2 0 15 1 *\n"
"22 145 2 0 15 2 *\n"
"32 146 2 0 15 3 *\n"
"24 145 2 0 15 4 *\n"
"25 145 2 0 15 5 *\n"
"3 145 2 0 15 6 *\n"
"6 145 2 0 15 7 *\n"
"27 147 2 0 15 8 *\n"
"28 145 2 0 15 9 *\n"
"29 145 2 0 15 10 *\n"
"9 145 2 0 15 11 *\n"
"5 145 2 0 15 12 *\n"
"10 145 2 0 15 13 *\n"
"30 145 2 0 15 14 *\n"
"12 145 2 0 15 15 *\n"
"31 145 2 0 15 16 *\n"
"15 145 2 0 15 17 *\n"
"21 145 2 0 16 1 *\n"
"22 145 2 0 16 2 *\n"
"37 146 2 0 16 3 *\n"
"24 145 2 0 16 4 *\n"
"25 145 2 0 16 5 *\n"
"3 145 2 0 16 6 *\n"
"6 145 2 0 16 7 *\n"
"221 147 2 0 16 8 *\n"
"28 145 2 0 16 9 *\n"
"29 145 2 0 16 10 *\n"
"9 145 2 0 16 11 *\n"
"5 145 2 0 16 12 *\n"
"10 145 2 0 16 13 *\n"
"30 145 2 0 16 14 *\n"
"12 145 2 0 16 15 *\n"
"31 145 2 0 16 16 *\n"
"15 145 2 0 16 17 *\n"
"40 145 2 0 16 18 *\n"
"41 145 2 0 16 19 *\n"
"20 145 2 0 16 20 *\n"
"21 145 2 0 17 1 *\n"
"22 145 2 0 17 2 *\n"
"21 146 2 0 17 3 *\n"
"24 145 2 0 17 4 *\n"
"25 145 2 0 17 5 *\n"
"3 145 2 0 17 6 *\n"
"6 145 2 0 17 7 *\n"
"222 147 2 0 17 8 *\n"
"28 145 2 0 17 9 *\n"
"29 145 2 0 17 10 *\n"
"9 145 2 0 17 11 *\n"
"5 145 2 0 17 12 *\n"
"10 145 2 0 17 13 *\n"
"30 145 2 0 17 14 *\n"
"12 145 2 0 17 15 *\n"
"31 145 2 0 17 16 *\n"
"15 145 2 0 17 17 *\n"
"40 145 2 0 17 18 *\n"
"223 145 2 0 17 19 *\n"
"20 145 2 0 17 20 *\n"
"21 145 2 0 31 1 *\n"
"125 145 2 0 31 2 *\n"
"17 146 2 0 31 3 *\n"
"24 145 2 0 31 4 *\n"
"25 145 2 0 31 5 *\n"
"3 145 2 0 31 6 *\n"
"29 145 2 0 31 7 *\n"
"10 145 2 0 31 8 *\n"
"30 145 2 0 31 9 *\n"
"12 145 2 0 31 10 *\n"
"1 193 3 0 18 1 *\n"
"2 193 3 0 18 2 *\n"
"3 193 3 0 18 3 *\n"
"4 193 3 0 18 4 *\n"
"5 193 3 0 18 5 *\n"
"6 193 3 0 18 6 *\n"
"7 193 3 0 18 7 *\n"
"8 193 3 0 18 8 *\n"
"9 193 3 0 18 9 *\n"
"5 193 3 0 18 10 *\n"
"10 193 3 0 18 11 *\n"
"11 193 3 0 18 12 *\n"
"12 193 3 0 18 13 *\n"
"13 193 3 0 18 14 *\n"
"14 193 3 0 18 15 *\n"
"15 193 3 0 18 16 *\n"
"13 193 3 0 18 17 *\n"
"16 193 3 0 18 18 *\n"
"17 193 3 0 18 19 *\n"
"18 193 3 0 18 20 *\n"
"19 193 3 0 18 21 *\n"
"20 193 3 0 18 22 *\n"
"1 193 3 0 19 1 *\n"
"2 193 3 0 19 2 *\n"
"3 193 3 0 19 3 *\n"
"4 193 3 0 19 4 *\n"
"5 193 3 0 19 5 *\n"
"6 193 3 0 19 6 *\n"
"7 193 3 0 19 7 *\n"
"8 193 3 0 19 8 *\n"
"9 193 3 0 19 9 *\n"
"5 193 3 0 19 10 *\n"
"10 193 3 0 19 11 *\n"
"11 193 3 0 19 12 *\n"
"12 193 3 0 19 13 *\n"
"13 193 3 0 19 14 *\n"
"14 193 3 0 19 15 *\n"
"15 193 3 0 19 16 *\n"
"13 193 3 0 19 17 *\n"
"16 193 3 0 19 18 *\n"
"17 193 3 0 19 19 *\n"
"18 193 3 0 19 20 *\n"
"19 193 3 0 19 21 *\n"
"20 193 3 0 19 22 *\n"
"1 193 3 0 20 1 *\n"
"2 193 3 0 20 2 *\n"
"3 193 3 0 20 3 *\n"
"4 193 3 0 20 4 *\n"
"5 193 3 0 20 5 *\n"
"6 193 3 0 20 6 *\n"
"7 193 3 0 20 7 *\n"
"8 193 3 0 20 8 *\n"
"9 193 3 0 20 9 *\n"
"5 193 3 0 20 10 *\n"
"10 193 3 0 20 11 *\n"
"11 193 3 0 20 12 *\n"
"12 193 3 0 20 13 *\n"
"13 193 3 0 20 14 *\n"
"14 193 3 0 20 15 *\n"
"15 193 3 0 20 16 *\n"
"13 193 3 0 20 17 *\n"
"16 193 3 0 20 18 *\n"
"17 193 3 0 20 19 *\n"
"18 193 3 0 20 20 *\n"
"19 193 3 0 20 21 *\n"
"20 193 3 0 20 22 *\n"
"90 194 3 0 21 1 *\n"
"66 195 3 0 21 2 *\n"
"20 195 3 0 21 3 *\n"
"67 195 3 0 21 4 *\n"
"68 195 3 0 21 5 *\n"
"69 195 3 0 21 6 *\n"
"15 195 3 0 21 7 *\n"
"70 195 3 0 21 8 *\n"
"71 195 3 0 21 9 *\n"
"68 195 3 0 21 10 *\n"
"69 195 3 0 21 11 *\n"
"13 195 3 0 21 12 *\n"
"72 195 3 0 21 13 *\n"
"73 195 3 0 21 14 *\n"
"74 195 3 0 21 15 *\n"
"75 195 3 0 21 16 *\n"
"15 195 3 0 21 17 *\n"
"76 195 3 0 21 18 *\n"
"42 195 3 0 21 19 *\n"
"68 195 3 0 21 20 *\n"
"69 195 3 0 21 21 *\n"
"15 195 3 0 21 22 *\n"
"77 195 3 0 21 23 *\n"
"78 195 3 0 21 24 *\n"
"68 195 3 0 21 25 *\n"
"69 195 3 0 21 26 *\n"
"13 195 3 0 21 27 *\n"
"79 195 3 0 21 28 *\n"
"73 195 3 0 21 29 *\n"
"80 195 3 0 21 30 *\n"
"68 195 3 0 21 31 *\n"
"69 195 3 0 21 32 *\n"
"81 195 3 0 21 33 *\n"
"68 195 3 0 21 34 *\n"
"69 195 3 0 21 35 *\n"
"13 195 3 0 21 36 *\n"
"82 195 3 0 21 37 *\n"
"83 195 3 0 21 38 *\n"
"90 194 3 0 23 1 *\n"
"66 196 3 0 23 2 *\n"
"20 196 3 0 23 3 *\n"
"224 196 3 0 23 4 *\n"
"130 196 3 0 23 5 *\n"
"68 196 3 0 23 6 *\n"
"69 196 3 0 23 7 *\n"
"15 196 3 0 23 8 *\n"
"70 196 3 0 23 9 *\n"
"82 196 3 0 23 10 *\n"
"71 196 3 0 23 11 *\n"
"68 196 3 0 23 12 *\n"
"69 196 3 0 23 13 *\n"
"13 196 3 0 23 14 *\n"
"72 196 3 0 23 15 *\n"
"73 196 3 0 23 16 *\n"
"74 196 3 0 23 17 *\n"
"75 196 3 0 23 18 *\n"
"15 196 3 0 23 19 *\n"
"76 196 3 0 23 20 *\n"
"42 196 3 0 23 21 *\n"
"68 196 3 0 23 22 *\n"
"69 196 3 0 23 23 *\n"
"15 196 3 0 23 24 *\n"
"77 196 3 0 23 25 *\n"
"78 196 3 0 23 26 *\n"
"68 196 3 0 23 27 *\n"
"69 196 3 0 23 28 *\n"
"13 196 3 0 23 29 *\n"
"79 196 3 0 23 30 *\n"
"73 196 3 0 23 31 *\n"
"80 196 3 0 23 32 *\n"
"68 196 3 0 23 33 *\n"
"69 196 3 0 23 34 *\n"
"81 196 3 0 23 35 *\n"
"68 196 3 0 23 36 *\n"
"69 196 3 0 23 37 *\n"
"13 196 3 0 23 38 *\n"
"82 196 3 0 23 39 *\n"
"83 196 3 0 23 40 *\n"
"90 194 3 0 22 1 *\n"
"66 195 3 0 22 2 *\n"
"20 195 3 0 22 3 *\n"
"67 195 3 0 22 4 *\n"
"130 195 3 0 22 5 *\n"
"68 195 3 0 22 6 *\n"
"69 195 3 0 22 7 *\n"
"15 195 3 0 22 8 *\n"
"70 195 3 0 22 9 *\n"
"71 195 3 0 22 10 *\n"
"68 195 3 0 22 11 *\n"
"69 195 3 0 22 12 *\n"
"13 195 3 0 22 13 *\n"
"72 195 3 0 22 14 *\n"
"73 195 3 0 22 15 *\n"
"74 195 3 0 22 16 *\n"
"75 195 3 0 22 17 *\n"
"15 195 3 0 22 18 *\n"
"76 195 3 0 22 19 *\n"
"42 195 3 0 22 20 *\n"
"68 195 3 0 22 21 *\n"
"69 195 3 0 22 22 *\n"
"15 195 3 0 22 23 *\n"
"77 195 3 0 22 24 *\n"
"78 195 3 0 22 25 *\n"
"68 195 3 0 22 26 *\n"
"69 195 3 0 22 27 *\n"
"13 195 3 0 22 28 *\n"
"79 195 3 0 22 29 *\n"
"73 195 3 0 22 30 *\n"
"80 195 3 0 22 31 *\n"
"68 195 3 0 22 32 *\n"
"69 195 3 0 22 33 *\n"
"81 195 3 0 22 34 *\n"
"68 195 3 0 22 35 *\n"
"69 195 3 0 22 36 *\n"
"13 195 3 0 22 37 *\n"
"82 195 3 0 22 38 *\n"
"83 195 3 0 22 39 *\n"
"225 197 3 0 24 1 *\n"
"226 197 3 0 24 2 *\n"
"227 197 3 0 24 3 *\n"
"21 173 4 0 25 1 *\n"
"66 173 4 0 25 2 *\n"
"20 173 4 0 25 3 *\n"
"194 173 4 0 25 4 *\n"
"228 173 4 0 25 5 *\n"
"68 173 4 0 25 6 *\n"
"69 173 4 0 25 7 *\n"
"15 173 4 0 25 8 *\n"
"71 173 4 0 25 9 *\n"
"68 173 4 0 25 10 *\n"
"69 173 4 0 25 11 *\n"
"13 173 4 0 25 12 *\n"
"196 173 4 0 25 13 *\n"
"73 173 4 0 25 14 *\n"
"74 173 4 0 25 15 *\n"
"76 173 4 0 25 16 *\n"
"42 173 4 0 25 17 *\n"
"68 173 4 0 25 18 *\n"
"69 173 4 0 25 19 *\n"
"15 173 4 0 25 20 *\n"
"77 173 4 0 25 21 *\n"
"78 173 4 0 25 22 *\n"
"68 173 4 0 25 23 *\n"
"69 173 4 0 25 24 *\n"
"13 173 4 0 25 25 *\n"
"79 173 4 0 25 26 *\n"
"73 173 4 0 25 27 *\n"
"80 173 4 0 25 28 *\n"
"68 173 4 0 25 29 *\n"
"69 173 4 0 25 30 *\n"
"81 174 4 0 25 31 *\n"
"68 173 4 0 25 32 *\n"
"69 173 4 0 25 33 *\n"
"13 173 4 0 25 34 *\n"
"82 173 4 0 25 35 *\n"
"83 173 4 0 25 36 *\n"
"21 98 5 0 19 1 *\n"
"2 98 5 0 19 2 *\n"
"3 98 5 0 19 3 *\n"
"4 98 5 0 19 4 *\n"
"5 98 5 0 19 5 *\n"
"6 98 5 0 19 6 *\n"
"7 98 5 0 19 7 *\n"
"8 98 5 0 19 8 *\n"
"9 98 5 0 19 9 *\n"
"5 98 5 0 19 10 *\n"
"10 98 5 0 19 11 *\n"
"64 98 5 0 19 12 *\n"
"12 98 5 0 19 13 *\n"
"13 98 5 0 19 14 *\n"
"14 98 5 0 19 15 *\n"
"15 98 5 0 19 16 *\n"
"13 98 5 0 19 17 *\n"
"21 98 5 0 19 18 *\n"
"17 98 5 0 19 19 *\n"
"18 98 5 0 19 20 *\n"
"19 98 5 0 19 21 *\n"
"20 98 5 0 19 22 *\n"
"65 98 5 0 21 1 *\n"
"66 98 5 0 21 2 *\n"
"20 98 5 0 21 3 *\n"
"67 98 5 0 21 4 *\n"
"68 98 5 0 21 5 *\n"
"69 98 5 0 21 6 *\n"
"15 98 5 0 21 7 *\n"
"70 98 5 0 21 8 *\n"
"71 98 5 0 21 9 *\n"
"68 98 5 0 21 10 *\n"
"69 98 5 0 21 11 *\n"
"13 98 5 0 21 12 *\n"
"72 98 5 0 21 13 *\n"
"73 98 5 0 21 14 *\n"
"74 98 5 0 21 15 *\n"
"75 98 5 0 21 16 *\n"
"15 98 5 0 21 17 *\n"
"76 98 5 0 21 18 *\n"
"42 98 5 0 21 19 *\n"
"68 98 5 0 21 20 *\n"
"69 98 5 0 21 21 *\n"
"15 98 5 0 21 22 *\n"
"77 98 5 0 21 23 *\n"
"78 98 5 0 21 24 *\n"
"68 98 5 0 21 25 *\n"
"69 98 5 0 21 26 *\n"
"13 98 5 0 21 27 *\n"
"79 98 5 0 21 28 *\n"
"73 98 5 0 21 29 *\n"
"80 98 5 0 21 30 *\n"
"68 98 5 0 21 31 *\n"
"69 98 5 0 21 32 *\n"
"81 98 5 0 21 33 *\n"
"68 98 5 0 21 34 *\n"
"69 98 5 0 21 35 *\n"
"13 98 5 0 21 36 *\n"
"82 98 5 0 21 37 *\n"
"83 98 5 0 21 38 *\n"
"65 98 5 0 23 1 *\n"
"66 98 5 0 23 2 *\n"
"20 98 5 0 23 3 *\n"
"224 98 5 0 23 4 *\n"
"130 98 5 0 23 5 *\n"
"68 98 5 0 23 6 *\n"
"69 98 5 0 23 7 *\n"
"15 98 5 0 23 8 *\n"
"70 98 5 0 23 9 *\n"
"82 98 5 0 23 10 *\n"
"71 98 5 0 23 11 *\n"
"68 98 5 0 23 12 *\n"
"69 98 5 0 23 13 *\n"
"13 98 5 0 23 14 *\n"
"72 98 5 0 23 15 *\n"
"73 98 5 0 23 16 *\n"
"74 98 5 0 23 17 *\n"
"75 98 5 0 23 18 *\n"
"15 98 5 0 23 19 *\n"
"76 98 5 0 23 20 *\n"
"42 98 5 0 23 21 *\n"
"68 98 5 0 23 22 *\n"
"69 98 5 0 23 23 *\n"
"15 98 5 0 23 24 *\n"
"77 98 5 0 23 25 *\n"
"78 98 5 0 23 26 *\n"
"68 98 5 0 23 27 *\n"
"69 98 5 0 23 28 *\n"
"13 98 5 0 23 29 *\n"
"79 98 5 0 23 30 *\n"
"73 98 5 0 23 31 *\n"
"80 98 5 0 23 32 *\n"
"68 98 5 0 23 33 *\n"
"69 98 5 0 23 34 *\n"
"81 98 5 0 23 35 *\n"
"68 98 5 0 23 36 *\n"
"69 98 5 0 23 37 *\n"
"13 98 5 0 23 38 *\n"
"82 98 5 0 23 39 *\n"
"83 98 5 0 23 40 *\n"
"65 98 5 0 22 1 *\n"
"66 98 5 0 22 2 *\n"
"20 98 5 0 22 3 *\n"
"67 98 5 0 22 4 *\n"
"130 98 5 0 22 5 *\n"
"68 98 5 0 22 6 *\n"
"69 98 5 0 22 7 *\n"
"15 98 5 0 22 8 *\n"
"70 98 5 0 22 9 *\n"
"71 98 5 0 22 10 *\n"
"68 98 5 0 22 11 *\n"
"69 98 5 0 22 12 *\n"
"13 98 5 0 22 13 *\n"
"72 98 5 0 22 14 *\n"
"73 98 5 0 22 15 *\n"
"74 98 5 0 22 16 *\n"
"75 98 5 0 22 17 *\n"
"15 98 5 0 22 18 *\n"
"76 98 5 0 22 19 *\n"
"42 98 5 0 22 20 *\n"
"68 98 5 0 22 21 *\n"
"69 98 5 0 22 22 *\n"
"15 98 5 0 22 23 *\n"
"77 98 5 0 22 24 *\n"
"78 98 5 0 22 25 *\n"
"68 98 5 0 22 26 *\n"
"69 98 5 0 22 27 *\n"
"13 98 5 0 22 28 *\n"
"79 98 5 0 22 29 *\n"
"73 98 5 0 22 30 *\n"
"80 98 5 0 22 31 *\n"
"68 98 5 0 22 32 *\n"
"69 98 5 0 22 33 *\n"
"81 98 5 0 22 34 *\n"
"68 98 5 0 22 35 *\n"
"69 98 5 0 22 36 *\n"
"13 98 5 0 22 37 *\n"
"82 98 5 0 22 38 *\n"
"83 98 5 0 22 39 *\n"
"193 98 5 0 25 1 *\n"
"66 98 5 0 25 2 *\n"
"20 98 5 0 25 3 *\n"
"194 98 5 0 25 4 *\n"
"195 98 5 0 25 5 *\n"
"68 98 5 0 25 6 *\n"
"69 98 5 0 25 7 *\n"
"15 98 5 0 25 8 *\n"
"71 98 5 0 25 9 *\n"
"68 98 5 0 25 10 *\n"
"69 98 5 0 25 11 *\n"
"13 98 5 0 25 12 *\n"
"196 98 5 0 25 13 *\n"
"73 98 5 0 25 14 *\n"
"74 98 5 0 25 15 *\n"
"76 98 5 0 25 16 *\n"
"42 98 5 0 25 17 *\n"
"68 98 5 0 25 18 *\n"
"69 98 5 0 25 19 *\n"
"15 98 5 0 25 20 *\n"
"77 98 5 0 25 21 *\n"
"78 98 5 0 25 22 *\n"
"68 98 5 0 25 23 *\n"
"69 98 5 0 25 24 *\n"
"13 98 5 0 25 25 *\n"
"79 98 5 0 25 26 *\n"
"73 98 5 0 25 27 *\n"
"80 98 5 0 25 28 *\n"
"68 98 5 0 25 29 *\n"
"69 98 5 0 25 30 *\n"
"81 98 5 0 25 31 *\n"
"68 98 5 0 25 32 *\n"
"69 98 5 0 25 33 *\n"
"13 98 5 0 25 34 *\n"
"82 98 5 0 25 35 *\n"
"83 98 5 0 25 36 *\n"
"21 98 5 0 26 1 *\n"
"197 98 5 0 26 2 *\n"
"21 98 5 0 27 1 *\n"
"205 98 5 0 27 2 *\n"
"6 98 5 0 27 3 *\n"
"206 98 5 0 27 4 *\n"
"4 98 5 0 27 5 *\n"
"5 98 5 0 27 6 *\n"
"207 98 5 0 27 7 *\n"
"10 98 5 0 27 8 *\n"
"208 98 5 0 27 9 *\n"
"9 98 5 0 27 10 *\n"
"5 98 5 0 27 11 *\n"
"209 98 5 0 27 12 *\n"
"210 98 5 0 27 13 *\n"
"69 98 5 0 27 14 *\n"
"211 98 5 0 27 15 *\n"
"15 98 5 0 27 16 *\n"
"14 98 5 0 27 17 *\n"
"21 198 5 0 28 1 *\n"
"229 198 5 0 28 2 *\n"
"69 198 5 0 28 3 *\n"
"15 198 5 0 28 4 *\n"
"68 198 5 0 28 5 *\n"
"69 198 5 0 28 6 *\n"
"68 198 5 0 28 7 *\n"
"69 198 5 0 28 8 *\n"
"65 98 5 0 29 1 *\n"
"198 98 5 0 29 2 *\n"
"82 98 5 0 29 3 *\n"
"199 98 5 0 29 4 *\n"
"200 98 5 0 29 5 *\n"
"201 98 5 0 30 1 *\n"
"202 98 5 0 30 2 *\n"
"203 98 5 0 30 3 *\n"
"204 98 5 0 30 4 *\n"
"21 199 6 0 0 0 *\n"
"150 52 6 1 0 0 *\n"
"230 200 6 2 0 0 *\n"
"231 201 6 3 0 0 *\n"
"232 202 6 4 0 0 *\n"
"231 203 6 5 0 0 *\n"
"231 204 6 6 0 0 *\n"
"153 118 6 7 0 0 *\n"
"85 9 6 8 0 0 *\n"
"87 9 6 9 0 0 *\n"
"233 106 6 10 0 0 *\n"
"21 57 7 0 0 0 *\n"
"94 56 7 1 0 0 *\n"
"75 57 7 2 0 0 *\n"
"234 57 7 3 0 0 *\n"
"235 135 8 0 0 0 *\n"
"235 135 8 1 0 0 *\n"
"235 135 8 2 0 0 *\n"
"235 135 8 3 0 0 *\n"
"235 135 8 4 0 0 *\n"
"235 135 8 5 0 0 *\n"
"235 135 8 6 0 0 *\n"
"235 135 8 7 0 0 *\n"
"235 135 8 8 0 0 *\n"
"21 98 9 0 0 0 *\n"
"184 205 9 1 0 0 *\n"
"236 163 9 2 0 0 *\n"
"50 98 9 3 0 0 *\n"
"60 98 9 4 0 0 *\n"
"46 206 10 0 0 0 *\n"
"75 57 11 0 0 0 *\n"
"237 82 12 0 0 0 *\n"
"21 207 13 0 0 0 *\n"
"238 18 13 1 0 0 *\n"
"239 207 13 2 0 0 *\n"
"240 207 13 3 0 0 *\n"
"241 207 13 4 0 0 *\n"
"21 98 14 0 0 0 *\n"
"150 98 14 1 0 0 *\n"
"137 10 14 2 0 0 *\n"
"141 48 14 3 0 0 *\n"
"144 98 14 4 0 0 *\n"
"90 98 14 5 21 1 *\n"
"66 98 14 5 21 2 *\n"
"20 98 14 5 21 3 *\n"
"67 98 14 5 21 4 *\n"
"68 98 14 5 21 5 *\n"
"69 98 14 5 21 6 *\n"
"15 98 14 5 21 7 *\n"
"70 98 14 5 21 8 *\n"
"71 98 14 5 21 9 *\n"
"68 98 14 5 21 10 *\n"
"69 98 14 5 21 11 *\n"
"13 98 14 5 21 12 *\n"
"72 98 14 5 21 13 *\n"
"73 98 14 5 21 14 *\n"
"74 98 14 5 21 15 *\n"
"75 98 14 5 21 16 *\n"
"15 98 14 5 21 17 *\n"
"76 98 14 5 21 18 *\n"
"42 98 14 5 21 19 *\n"
"68 98 14 5 21 20 *\n"
"69 98 14 5 21 21 *\n"
"15 98 14 5 21 22 *\n"
"77 98 14 5 21 23 *\n"
"78 98 14 5 21 24 *\n"
"68 98 14 5 21 25 *\n"
"69 98 14 5 21 26 *\n"
"13 98 14 5 21 27 *\n"
"79 98 14 5 21 28 *\n"
"73 98 14 5 21 29 *\n"
"80 98 14 5 21 30 *\n"
"68 98 14 5 21 31 *\n"
"69 98 14 5 21 32 *\n"
"81 98 14 5 21 33 *\n"
"68 98 14 5 21 34 *\n"
"69 98 14 5 21 35 *\n"
"13 98 14 5 21 36 *\n"
"82 98 14 5 21 37 *\n"
"83 98 14 5 21 38 *\n"
"90 98 14 5 22 1 *\n"
"66 98 14 5 22 2 *\n"
"20 98 14 5 22 3 *\n"
"67 98 14 5 22 4 *\n"
"130 98 14 5 22 5 *\n"
"68 98 14 5 22 6 *\n"
"69 98 14 5 22 7 *\n"
"15 98 14 5 22 8 *\n"
"70 98 14 5 22 9 *\n"
"71 98 14 5 22 10 *\n"
"68 98 14 5 22 11 *\n"
"69 98 14 5 22 12 *\n"
"13 98 14 5 22 13 *\n"
"72 98 14 5 22 14 *\n"
"73 98 14 5 22 15 *\n"
"74 98 14 5 22 16 *\n"
"75 98 14 5 22 17 *\n"
"15 98 14 5 22 18 *\n"
"76 98 14 5 22 19 *\n"
"42 98 14 5 22 20 *\n"
"68 98 14 5 22 21 *\n"
"69 98 14 5 22 22 *\n"
"15 98 14 5 22 23 *\n"
"77 98 14 5 22 24 *\n"
"78 98 14 5 22 25 *\n"
"68 98 14 5 22 26 *\n"
"69 98 14 5 22 27 *\n"
"13 98 14 5 22 28 *\n"
"79 98 14 5 22 29 *\n"
"73 98 14 5 22 30 *\n"
"80 98 14 5 22 31 *\n"
"68 98 14 5 22 32 *\n"
"69 98 14 5 22 33 *\n"
"81 98 14 5 22 34 *\n"
"68 98 14 5 22 35 *\n"
"69 98 14 5 22 36 *\n"
"13 98 14 5 22 37 *\n"
"82 98 14 5 22 38 *\n"
"83 98 14 5 22 39 *\n"
"128 98 14 5 18 1 *\n"
"2 98 14 5 18 2 *\n"
"3 98 14 5 18 3 *\n"
"4 98 14 5 18 4 *\n"
"5 98 14 5 18 5 *\n"
"6 98 14 5 18 6 *\n"
"7 98 14 5 18 7 *\n"
"8 98 14 5 18 8 *\n"
"9 98 14 5 18 9 *\n"
"5 98 14 5 18 10 *\n"
"10 98 14 5 18 11 *\n"
"64 98 14 5 18 12 *\n"
"12 98 14 5 18 13 *\n"
"13 98 14 5 18 14 *\n"
"14 98 14 5 18 15 *\n"
"15 98 14 5 18 16 *\n"
"13 98 14 5 18 17 *\n"
"21 98 14 5 18 18 *\n"
"17 98 14 5 18 19 *\n"
"18 98 14 5 18 20 *\n"
"19 98 14 5 18 21 *\n"
"20 98 14 5 18 22 *\n"
"90 90 14 6 21 1 *\n"
"66 90 14 6 21 2 *\n"
"20 90 14 6 21 3 *\n"
"67 90 14 6 21 4 *\n"
"68 90 14 6 21 5 *\n"
"69 90 14 6 21 6 *\n"
"15 90 14 6 21 7 *\n"
"70 90 14 6 21 8 *\n"
"71 90 14 6 21 9 *\n"
"68 90 14 6 21 10 *\n"
"69 90 14 6 21 11 *\n"
"13 90 14 6 21 12 *\n"
"72 90 14 6 21 13 *\n"
"73 90 14 6 21 14 *\n"
"74 90 14 6 21 15 *\n"
"75 90 14 6 21 16 *\n"
"15 90 14 6 21 17 *\n"
"76 90 14 6 21 18 *\n"
"42 90 14 6 21 19 *\n"
"68 90 14 6 21 20 *\n"
"69 90 14 6 21 21 *\n"
"15 90 14 6 21 22 *\n"
"77 90 14 6 21 23 *\n"
"78 90 14 6 21 24 *\n"
"68 90 14 6 21 25 *\n"
"69 90 14 6 21 26 *\n"
"13 90 14 6 21 27 *\n"
"79 90 14 6 21 28 *\n"
"73 90 14 6 21 29 *\n"
"80 90 14 6 21 30 *\n"
"68 90 14 6 21 31 *\n"
"69 90 14 6 21 32 *\n"
"81 90 14 6 21 33 *\n"
"68 90 14 6 21 34 *\n"
"69 90 14 6 21 35 *\n"
"13 90 14 6 21 36 *\n"
"82 90 14 6 21 37 *\n"
"83 90 14 6 21 38 *\n"
"90 90 14 6 22 1 *\n"
"66 90 14 6 22 2 *\n"
"20 90 14 6 22 3 *\n"
"67 90 14 6 22 4 *\n"
"130 90 14 6 22 5 *\n"
"68 90 14 6 22 6 *\n"
"69 90 14 6 22 7 *\n"
"15 90 14 6 22 8 *\n"
"70 90 14 6 22 9 *\n"
"71 90 14 6 22 10 *\n"
"68 90 14 6 22 11 *\n"
"69 90 14 6 22 12 *\n"
"13 90 14 6 22 13 *\n"
"72 90 14 6 22 14 *\n"
"73 90 14 6 22 15 *\n"
"74 90 14 6 22 16 *\n"
"75 90 14 6 22 17 *\n"
"15 90 14 6 22 18 *\n"
"76 90 14 6 22 19 *\n"
"42 90 14 6 22 20 *\n"
"68 90 14 6 22 21 *\n"
"69 90 14 6 22 22 *\n"
"15 90 14 6 22 23 *\n"
"77 90 14 6 22 24 *\n"
"78 90 14 6 22 25 *\n"
"68 90 14 6 22 26 *\n"
"69 90 14 6 22 27 *\n"
"13 90 14 6 22 28 *\n"
"79 90 14 6 22 29 *\n"
"73 90 14 6 22 30 *\n"
"80 90 14 6 22 31 *\n"
"68 90 14 6 22 32 *\n"
"69 90 14 6 22 33 *\n"
"81 90 14 6 22 34 *\n"
"68 90 14 6 22 35 *\n"
"69 90 14 6 22 36 *\n"
"13 90 14 6 22 37 *\n"
"82 90 14 6 22 38 *\n"
"83 90 14 6 22 39 *\n"
"128 90 14 6 18 1 *\n"
"2 90 14 6 18 2 *\n"
"3 90 14 6 18 3 *\n"
"4 90 14 6 18 4 *\n"
"5 90 14 6 18 5 *\n"
"6 90 14 6 18 6 *\n"
"7 90 14 6 18 7 *\n"
"8 90 14 6 18 8 *\n"
"9 90 14 6 18 9 *\n"
"5 90 14 6 18 10 *\n"
"10 90 14 6 18 11 *\n"
"64 90 14 6 18 12 *\n"
"12 90 14 6 18 13 *\n"
"13 90 14 6 18 14 *\n"
"14 90 14 6 18 15 *\n"
"15 90 14 6 18 16 *\n"
"13 90 14 6 18 17 *\n"
"21 90 14 6 18 18 *\n"
"17 90 14 6 18 19 *\n"
"18 90 14 6 18 20 *\n"
"19 90 14 6 18 21 *\n"
"20 90 14 6 18 22 *\n"
"21 98 14 7 1 1 *\n"
"22 98 14 7 1 2 *\n"
"32 98 14 7 1 3 *\n"
"24 98 14 7 1 4 *\n"
"25 98 14 7 1 5 *\n"
"3 98 14 7 1 6 *\n"
"6 98 14 7 1 7 *\n"
"33 98 14 7 1 8 *\n"
"28 98 14 7 1 9 *\n"
"120 98 14 7 1 10 *\n"
"9 98 14 7 1 11 *\n"
"5 98 14 7 1 12 *\n"
"10 98 14 7 1 13 *\n"
"30 98 14 7 1 14 *\n"
"12 98 14 7 1 15 *\n"
"121 98 14 7 1 16 *\n"
"15 98 14 7 1 17 *\n"
"20 98 14 7 1 18 *\n"
"21 98 14 7 2 1 *\n"
"22 98 14 7 2 2 *\n"
"92 98 14 7 2 3 *\n"
"24 98 14 7 2 4 *\n"
"25 98 14 7 2 5 *\n"
"26 98 14 7 2 6 *\n"
"6 98 14 7 2 7 *\n"
"27 98 14 7 2 8 *\n"
"28 98 14 7 2 9 *\n"
"120 98 14 7 2 10 *\n"
"9 98 14 7 2 11 *\n"
"5 98 14 7 2 12 *\n"
"10 98 14 7 2 13 *\n"
"30 98 14 7 2 14 *\n"
"12 98 14 7 2 15 *\n"
"121 98 14 7 2 16 *\n"
"15 98 14 7 2 17 *\n"
"21 98 14 7 3 1 *\n"
"22 98 14 7 3 2 *\n"
"92 98 14 7 3 3 *\n"
"24 98 14 7 3 4 *\n"
"25 98 14 7 3 5 *\n"
"26 98 14 7 3 6 *\n"
"6 98 14 7 3 7 *\n"
"27 98 14 7 3 8 *\n"
"28 98 14 7 3 9 *\n"
"120 98 14 7 3 10 *\n"
"9 98 14 7 3 11 *\n"
"5 98 14 7 3 12 *\n"
"10 98 14 7 3 13 *\n"
"30 98 14 7 3 14 *\n"
"12 98 14 7 3 15 *\n"
"121 98 14 7 3 16 *\n"
"15 98 14 7 3 17 *\n"
"21 98 14 7 5 1 *\n"
"22 98 14 7 5 2 *\n"
"92 98 14 7 5 3 *\n"
"24 98 14 7 5 4 *\n"
"25 98 14 7 5 5 *\n"
"26 98 14 7 5 6 *\n"
"6 98 14 7 5 7 *\n"
"27 98 14 7 5 8 *\n"
"28 98 14 7 5 9 *\n"
"120 98 14 7 5 10 *\n"
"9 98 14 7 5 11 *\n"
"5 98 14 7 5 12 *\n"
"10 98 14 7 5 13 *\n"
"30 98 14 7 5 14 *\n"
"12 98 14 7 5 15 *\n"
"121 98 14 7 5 16 *\n"
"15 98 14 7 5 17 *\n"
"21 98 14 7 9 1 *\n"
"22 98 14 7 9 2 *\n"
"17 98 14 7 9 3 *\n"
"24 98 14 7 9 4 *\n"
"25 98 14 7 9 5 *\n"
"26 98 14 7 9 6 *\n"
"6 98 14 7 9 7 *\n"
"27 98 14 7 9 8 *\n"
"127 98 14 7 9 9 *\n"
"120 98 14 7 9 10 *\n"
"9 98 14 7 9 11 *\n"
"5 98 14 7 9 12 *\n"
"10 98 14 7 9 13 *\n"
"30 98 14 7 9 14 *\n"
"12 98 14 7 9 15 *\n"
"121 98 14 7 9 16 *\n"
"15 98 14 7 9 17 *\n"
"21 98 14 7 10 1 *\n"
"22 98 14 7 10 2 *\n"
"92 98 14 7 10 3 *\n"
"24 98 14 7 10 4 *\n"
"25 98 14 7 10 5 *\n"
"26 98 14 7 10 6 *\n"
"6 98 14 7 10 7 *\n"
"27 98 14 7 10 8 *\n"
"28 98 14 7 10 9 *\n"
"120 98 14 7 10 10 *\n"
"9 98 14 7 10 11 *\n"
"5 98 14 7 10 12 *\n"
"10 98 14 7 10 13 *\n"
"30 98 14 7 10 14 *\n"
"12 98 14 7 10 15 *\n"
"121 98 14 7 10 16 *\n"
"15 98 14 7 10 17 *\n"
"21 98 14 7 11 1 *\n"
"22 98 14 7 11 2 *\n"
"122 98 14 7 11 3 *\n"
"24 98 14 7 11 4 *\n"
"25 98 14 7 11 5 *\n"
"93 98 14 7 11 6 *\n"
"6 98 14 7 11 7 *\n"
"27 98 14 7 11 8 *\n"
"28 98 14 7 11 9 *\n"
"120 98 14 7 11 10 *\n"
"9 98 14 7 11 11 *\n"
"5 98 14 7 11 12 *\n"
"10 98 14 7 11 13 *\n"
"30 98 14 7 11 14 *\n"
"12 98 14 7 11 15 *\n"
"121 98 14 7 11 16 *\n"
"15 98 14 7 11 17 *\n"
"21 98 14 7 12 1 *\n"
"22 98 14 7 12 2 *\n"
"92 98 14 7 12 3 *\n"
"24 98 14 7 12 4 *\n"
"25 98 14 7 12 5 *\n"
"26 98 14 7 12 6 *\n"
"6 98 14 7 12 7 *\n"
"27 98 14 7 12 8 *\n"
"28 98 14 7 12 9 *\n"
"120 98 14 7 12 10 *\n"
"9 98 14 7 12 11 *\n"
"5 98 14 7 12 12 *\n"
"10 98 14 7 12 13 *\n"
"30 98 14 7 12 14 *\n"
"12 98 14 7 12 15 *\n"
"121 98 14 7 12 16 *\n"
"21 98 14 7 14 1 *\n"
"22 98 14 7 14 2 *\n"
"32 98 14 7 14 3 *\n"
"24 98 14 7 14 4 *\n"
"25 98 14 7 14 5 *\n"
"3 98 14 7 14 6 *\n"
"6 98 14 7 14 7 *\n"
"27 98 14 7 14 8 *\n"
"28 98 14 7 14 9 *\n"
"120 98 14 7 14 10 *\n"
"9 98 14 7 14 11 *\n"
"5 98 14 7 14 12 *\n"
"10 98 14 7 14 13 *\n"
"30 98 14 7 14 14 *\n"
"12 98 14 7 14 15 *\n"
"121 98 14 7 14 16 *\n"
"15 98 14 7 14 17 *\n"
"21 98 14 7 15 1 *\n"
"22 98 14 7 15 2 *\n"
"32 98 14 7 15 3 *\n"
"24 98 14 7 15 4 *\n"
"25 98 14 7 15 5 *\n"
"3 98 14 7 15 6 *\n"
"6 98 14 7 15 7 *\n"
"27 98 14 7 15 8 *\n"
"28 98 14 7 15 9 *\n"
"120 98 14 7 15 10 *\n"
"9 98 14 7 15 11 *\n"
"5 98 14 7 15 12 *\n"
"10 98 14 7 15 13 *\n"
"30 98 14 7 15 14 *\n"
"12 98 14 7 15 15 *\n"
"121 98 14 7 15 16 *\n"
"15 98 14 7 15 17 *\n"
"21 98 14 7 16 1 *\n"
"22 98 14 7 16 2 *\n"
"37 98 14 7 16 3 *\n"
"24 98 14 7 16 4 *\n"
"25 98 14 7 16 5 *\n"
"3 98 14 7 16 6 *\n"
"6 98 14 7 16 7 *\n"
"123 98 14 7 16 8 *\n"
"28 98 14 7 16 9 *\n"
"120 98 14 7 16 10 *\n"
"9 98 14 7 16 11 *\n"
"5 98 14 7 16 12 *\n"
"10 98 14 7 16 13 *\n"
"30 98 14 7 16 14 *\n"
"12 98 14 7 16 15 *\n"
"121 98 14 7 16 16 *\n"
"15 98 14 7 16 17 *\n"
"40 98 14 7 16 18 *\n"
"17 98 14 7 16 19 *\n"
"20 98 14 7 16 20 *\n"
"21 98 14 7 31 1 *\n"
"125 98 14 7 31 2 *\n"
"17 98 14 7 31 3 *\n"
"24 98 14 7 31 4 *\n"
"25 98 14 7 31 5 *\n"
"3 98 14 7 31 6 *\n"
"120 98 14 7 31 7 *\n"
"10 98 14 7 31 8 *\n"
"30 98 14 7 31 9 *\n"
"12 98 14 7 31 10 *\n"
"21 98 14 7 32 1 *\n"
"22 98 14 7 32 2 *\n"
"126 98 14 7 32 3 *\n"
"6 98 14 7 32 4 *\n"
"120 98 14 7 32 5 *\n"
"9 98 14 7 32 6 *\n"
"5 98 14 7 32 7 *\n"
"10 98 14 7 32 8 *\n"
"30 98 14 7 32 9 *\n"
"12 98 14 7 32 10 *\n"
"21 98 14 7 33 1 *\n"
"22 98 14 7 33 2 *\n"
"126 98 14 7 33 3 *\n"
"6 98 14 7 33 4 *\n"
"120 98 14 7 33 5 *\n"
"9 98 14 7 33 6 *\n"
"5 98 14 7 33 7 *\n"
"10 98 14 7 33 8 *\n"
"30 98 14 7 33 9 *\n"
"12 98 14 7 33 10 *\n"
"242 208 15 0 0 0 *\n"
"242 208 15 1 0 0 *\n"
"242 208 15 2 0 0 *\n"
"242 208 15 3 0 0 *\n";
